[{"Number": 1, "CWSAC": "VA101", "Battle": "First Kernstown", "Start Date": "23 March 1862", "County": [{"name": "Frederick", "state": "VA"}, {"name": "City of Winchester", "state": "VA"}], "General Location": "West of US 11 (Valley Pike) and N. of Hoge Run; Rte. 37 (4-lane bypass) bisects the area of heaviest fighting along Sand Ridge.", "Size of Study/Core Areas": "4,029/1,554 acres", "GIS Integrity of Study/Core Areas": "56/71 percent; Fair/Fair", "Field Assessment of Study Area Integrity": "Fair", "USGS Quadrants": ["Winchester", "Stephens City"], "Campaign": "Jackson's Valley Campaign", "Principal Commanders": {"C": [{"rank": "Maj. Gen.", "first_name": "A.", "middle_name": "Thomas", "last_name": "Jackson"}], "U": [{"rank": "Col.", "first_name": "Nathan", "last_name": "Kimball", "note": "commanding Brig. Gen. James Shields' division."}]}, "Forces Engaged": {"C": {"text": "Jackson's infantry division of three brigades (Garnett, Burks, and Fulkerson), 27 guns, and a cavalry contingent under Col. Turner Ashby; total strength did not exceed about 3,600-3,800, of which most were engaged", "strength_min": 3600, "strength_max": 3800}, "U": {"text": "One infantry division of three brigades (Kimball, Sullivan, and Tyler), 24 guns, and 16 companies of cavalry underBroadhead; total force between 8,500 and 9,000, three-fourths of which were brought into action.", "strength_min": 8500, "strength_max": 9500}}, "Casualties": {"C": {"text": "718 (80k/375w/263mc)", "casualties": 718, "killed": 80, "wounded": 375, "missing_captured": 263}, "U": {"text": "590 (118k/450w/22mc)", "casualties": 590, "killed": 118, "wounded": 450, "missing_captured": 22}}, "Significance": "This battle is considered by many historians as the opening conflict of the famous Valley Campaign of 1862.  It was the only battle recorded as ``lost'' by Stonewall Jackson, but in many ways he gained as much by losing as by winning.  After the battle, President Lincoln was disturbed by Jackson's potential threat to Washington and redirected more than 35,000 men to defend approaches from the Valley before the campaign was finished.  Maj. Gen. George B. McClellan's army was deprived of these reinforcements, which he claimed would have enabled him to take Richmond during his Peninsular campaign.  Because of this redeployment of Federal troops, First Kernstown is considered one of the decisive engagements of 1862.", "Description of the Battle": "\nPrelude: Acting on faulty intelligence that suggested that his small army outnumbered the Federal forces at Winchester, Maj. Gen. Thomas J. Jackson moved to strike his opponents and prevent US reinforcements from leaving the Valley to aid McClellan's army on the Peninsula.  The division of Brig. Gen. James Shields in fact outnumbered Jackson more than two-to-one.  On the afternoon of 22 March, Ashby's cavalry and horse artillery skirmished with US forces near Kernstown.  General Shields was wounded in this affair, his arm broken by a shell fragment, and divisional command devolved to Col. Nathan Kimball.\nPhase One: Skirmishing at Kernstown: At dawn Kimball moved against Ashby's advance on the Valley Pike north of Kernstown.  Sullivan's and a portion of Kimball's US brigades advanced, straddling the pike, and pushed Ashby south of Hoge's Run, taking possession of Pritchard's Hill.  Ashby's troopers formed a new defensive line, which was later supported by infantry and maintained throughout the battle.  Jenks' US battery unlimbered on Pritchard's Hill and responded to Ashby's artillery in position near the Opequon Church.  About 1100 hours, Jackson's infantry began to concentrate south of Kernstown.  It was soon evident to Kimball that Jackson's army was arriving on the field. Kimball consolidated his position and awaited reinforcements. \n  \nPhase Two: CS Flank Movement: By 1400 hours, Jackson's infantry was on the field, massed south of Kernstown.  Jackson launched a feint toward Kimball's main position along the Pike with a portion of Burks' brigade, but this was to disguise a flanking movement to his left along Sand Ridge.  Jackson directed Fulkerson's and Garnett's brigades to the ridge, leaving Burks to support Ashby.  Confederate artillery (3 batteries) were positioned on the eastern face of the ridge and engaged US batteries on Pritchard's Hill.  Fulkerson advanced on the left, seizing an east-west stone fence on the Glass farm under fire.  Garnett came up on Fulkerson's right, extending the CS battle line from Opequon Creek east across the front of the ridge, then bending back south to cover the artillery.  A regiment was deployed across the Middle Road to maintain a connection between the CS flanks.  Recognizing the threat to his right, Kimball moved Tyler's brigade forward from its reserve position near the toll gate at the intersection of the Valley Pike and Cedar Creek Grade to confront Fulkerson and Garnett.  As the artillery duel continued, skirmishers closed and the fighting began to heat up.\n\nPhase Three: US Assault on Sand Ridge: At 1600 hours, Tyler deployed his five regiments (about 3,000 men) and attacked the CS position on Sand Ridge, supported by his batteries on Pritchard's Hill and a small cavalry force on his far right flank.  Several attempts to turn the CS left flank were repulsed with heavy casualties.  Tyler now focused his attention on the CS center on the crest of the ridge.  Recognizing that Ashby's activity on the Valley Pike was a demonstration only, Colonel Kimball marched his brigade and part of Sullivan's (about 3,000) to the right, joining with Tyler to assault the CS center and right on Sand Ridge.  Garnett's outnumbered brigade lacked the protection of a stone fence like Fulkerson's and soon began to fall back.  Jackson dispatched two regiments to the support of Garnett but before they arrived, Garnett ordered a withdrawal, believing his position untenable.  This movement opened Fulkerson's right flank to a heavy fire and he too retired.  The retreat soon became badly disorganized.  The CS artillery kept US forces in the open ground east of Sand Ridge at bay, firing canister, but no fire could be brought to bear along the wooded ridge itself.  The Union advance along the crest forced the guns to retire.\nPhase Four: Rear Guard Action: Jackson deployed two regiments (5VA and 42VA) across the ridge to slow the US advance. Several regiment-sized attacks were repulsed, and for a brief time fighting was fierce and hand-to-hand.  According to Henderson, colors of the 5th Ohio changed hands six times.  A body of US cavalry advanced south along the road (rte. 621), but were checked by Funston's cavalry.  Darkness ended the fighting.\nPhase Five: CS Retreat: Jackson withdrew along ``Stone Lane'' past the Magill House and south along the Valley Pike.  Ashby remained with the cavalry at Bartonsville, while the infantry went on to Newtown (Stephens City).  Jackson slept in the corner of a rail fence near Bartonsville.  US forces did not pursue.", "Current Condition of the Battlefield": "\nThe core area of the battlefield where the major Union attacks occurred is bisected by the four-lane rte. 37-bypass, but the western and eastern portions of the field are in relatively pristine condition.  The western portion, scene of the most intense fighting, is the Glass property, site of the 1840s Glass House (in the same family).  The property preserves all of the original land contours and remnants of stone fences that figured prominently in the battle.  Part of the property is farmed as it was during the Civil War, but the woodland along Sand Ridge is more extensive now than at the time of the battle.  To the east is Pritchard's Hill and the Pritchard-Grim property.  Pritchard's Hill served as a Union artillery strongpoint during First Kernstown and was the center of fighting for Second Kernstown.  This property from rte. 628 to the historic Opequon Church and north of rte. 652 is also in very good condition.  The area of skirmishing on the morning of the battle along the Valley Pike (US 11) has been claimed by industrial, commercial, and residential developments and is lost.  Little remains of the original hamlet of Kernstown other than Hoge's Ordinary, which has been renovated into office space.  The area where the rear guard action was fought on Sand Ridge is occupied by a housing development.  The importance of this ground is enhanced by its significance in two major Shenandoah Valley campaigns.", "Perception of Threats to Battlefield": "\nLand east of US 11 along the railroad tracks has been developed for a large-scale industrial/business park.  Route 11 is zoned commercial/industrial and has been densely developed from south of Kernstown to the Winchester city limits, causing concern over potential development plans west of US 11.  A county planning official noted, however, that watershed and ground water considerations make development in the Pritchard's Hill and Sand Ridge areas less desirable.  These factors would need to be considered before any development plans would be approved.  Residential development is encroaching on the northern part of Pritchard's Hill.  For the present, a large portion of this land remains in private ownership and has been altered little since the Civil War.  The Glass property has been placed in the Glen Burnie Trust and Pritchard-Grim farm and adjacent portions of Pritchard's Hill are owned by the Charles Hardy Grim Estate.", "Identified Sites and Features Associated with the Battlefield": ["Bartonsville Mill", "Cedar Creek Grade", "Front Royal Road", "Glass House", "Hoge's Ordinary", "Hoge's Run", "Kernstown", "Magill House*", "Middle Road", "Old Town Winchester", "Opequon Church and Cemetery", "Pritchard House", "Pritchard's Hill", "Sand Ridge", "Springdale", "Stone Lane", "Stone Walls", "Toll Gate (site of)", "Valley Pike"], "url": "http://www.nps.gov/abpp/shenandoah/svs3-1.html"}, {"Number": 10, "CWSAC": "VA114", "Battle": "Cool Spring", "Start Date": "18 July 1864", "County": [{"name": "Clarke", "state": "VA"}], "General Location": "Along Shenandoah River from above crossing of rte. 7 north to Parker Island on west bank (present monastery grounds) and east bank (Shenandoah Retreat and golf course).", "Size of Study/Core Areas": "5,740/1,946 acres", "GIS Integrity of Study/Core Areas": "97/97 percent; Good/Good", "Field Assessment of Study Area Integrity": "Fair", "USGS Quadrants": ["Bluemont", "Ashby Gap", "Round Hill", "Berryville"], "Campaign": "Early's Maryland Campaign", "Principal Commanders": {"C": [{"rank": "Lt. Gen.", "first_name": "Jubal", "last_name": "Early"}, {"rank": "Maj. Gen.", "first_name": "Robert", "middle_name": "E.", "last_name": "Rodes"}], "U": [{"rank": "Maj. Gen.", "first_name": "Horatio", "last_name": "Wright"}, {"rank": "Brig. Gen.", "first_name": "George", "last_name": "Crook"}, {"rank": "Col.", "first_name": "Joseph", "last_name": "Thoburn"}]}, "Forces Engaged": {"C": {"text": "Three infantry divisions under Gordon, Wharton, and Rodes, about 8,000, and at least 3 batteries", "strength": 8000}, "U": {"text": "Three infantry brigades of Crook's Corps (about 3,250 men), supported by batteries and a division of the VI Corps, about 5,000 engaged.", "strength": 5000}}, "Casualties": {"C": {"text": "397 (80k/300w/17m)", "casualties": 397, "killed": 80, "wounded": 300, "missing_captured": 17}, "U": {"text": "422 (65k/301w/56m)", "casualties": 422, "killed": 65, "wounded": 301, "missing_captured": 56}}, "Significance": "\nIn the first weeks of July 1864, Lt. Gen. Jubal A. Early raided Maryland with an army of about 14,000 men, defeated a US force at the battle of Monocacy (9 July), and marched on Washington D.C.  Confronted there on 12 July by US veterans diverted from the Army of the Potomac, Early retreated, crossing the Potomac River at White's Ferry and the Blue Ridge at Snickers Gap.  Elements of three US corps (about 25,000 men) under overall command of Maj. Gen. Horatio Wright pursued and met Early's rear guard at the Shenandoah River crossing of Snickers Ferry near the farm of Cool Spring.  Although brief in duration, the battle of Cool Spring was desperately fought, checking US pursuit for several days.  The battle of Cool Spring (also known as Snickers Ferry or Parker's Ford) is representative of the division-sized engagements that occurred almost weekly throughout the remainder of the 1864 Valley Campaign, including Rutherford's Farm (20 July), Guard Hill (16 August), Abrams Creek (17 August), Cameron's Depot and Summit Point (21 August), Smithfield Crossing (29 August), and Berryville (3-4 September).  These encounters led up to the decisive battle of Opequon (Third Winchester) on 19 September.", "Description of the Battle": "\nPhase One: Skirmishing at Snickers Ford (17 July): On the afternoon of 17 July 1864, the US cavalry division of Alfred Duffie reached Snickers Ford and attempted to force a crossing of the Shenandoah River.  Two regiments of CS infantry supported by two` pieces of artillery positioned on North Hill overlooking the ford repulsed the attempt.  US cavalry then tried to cross at Shepherd's Ford about two miles south but were repulsed by CS cavalry of Vaughn's brigade.  During the night, Duffie continued south along the river, leaving a smaller force to picket the fords.  On the morning of 18 July, US cavalry pickets, supported by Mulligan's brigade of infantry (Crook's corps) again attempted a crossing at Snickers Ford but were repulsed.\nPhase Two: Advance of US Infantry (18 July): Col. Thoburn's division of Crook's Corps, followed by the VI Corps arrived on the Berryville Pike (current rte. 7) from their bivouac near Purcellville.  Union generals Wright, Emory, and Crook conferred on River Hill, where they established a signal station and brought up a battery of artillery.  It was assumed that General Early's CS army was in retreat to Winchester and that the ford was defended only by cavalry.  Because the attempted crossing at Snickers Ford in the morning had been unsuccessful, the US commanders decided to cross a division one mile downstream.  The infantry diverged from the main road onto a rocky cart road that led to Judge Parker's house, mill, and ford. The intervening hills disguised the movement from the CS pickets on the west bank of the river.\nPhase Three: River Crossing (18 July): About 1500 hours, Thoburn's 3,250 infantrymen forced CS skirmishers back from Parker's Ford and crossed the shallow river at a number of places across and between the islands.  Once on the west bank, US skirmishers fanned out across the Cool Spring farm, while the main body deployed along a rise about 100 yards from the river in the midst of a large wheatfield.  Commands regrouped after the crossing and prepared to move south to uncover Snickers Ford.  Captured Confederates, however, revealed that the island fords had been defended by infantry and that Early's army was nearby.  Thoburn alerted his superiors on River Hill (by signal flag and courier) and awaited further instructions.  He was told that he would be supported by a division of the VI Corps, which had begun to arrive on the east bank near the Parker House.\n  \nPhase Four: CS Response (18 July): In response to Thoburn's crossing (or in anticipation of it) Maj. Gen. John B. Gordon's division advanced along the Berryville Pike from its bivouac at Webbtown.  Gordon deployed along the river bluffs north and south of North Hill.  Simultaneously, Brig. Gen. Gabriel Wharton's division moved toward Cool Spring from its bivouac near Wickliffe Church.  Wharton deployed in line of battle and advanced on Cool Spring forcing back the US skirmishers to their main line near the river.  Maj. Gen. Robert E. Rodes's division was farther north at Gaylord but was set in motion to come up on the left of Wharton.  Skirmishing extended along Wharton's and Gordon's fronts.\nPhase Five: Rodes's Flank Attack (18 July): Colonel Thoburn was now aware of his precarious position but hoped to hold out until reinforced or withdrawn after dark.  Rodes's division arrived from Wickliffe Church, moving through ravines and behind the grove at Westwood which concealed the movement of the troops until they were within striking distance of Thoburn's contracted line.  Rodes deployed to Wharton's left, his line bending in an arc almost at right angles to the river and the US right flank.  About 1800 hours Rodes threw his division forward on a compact front, surprising and crushing the US right.\nThoburn sent the 116th Ohio to reinforce his right as both sides struggled for possession of a stone fence that bisected the wheatfield.  A second CS attack drove US forces back to another stone fence along the river bank.  There, they held out against a third desperate CS attack that came near to driving them into the river.  Three batteries of Union artillery came into play from the heights on the east bank.  A division of the VI Corps deployed on the east bank and engaged in sharpshooting, but it was not sent across the river.  Three batteries of CS artillery supported Rodes's attack.  Colonel Owens, commanding a CS brigade was mortally wounded.  The bulk of the almost 850 casualties of the battle occurred at this time and littered the wheatfield.\nPhase Six: US Withdrawal (18 July): The Union line held out until dark, then began to recross the river unmolested by CS infantry.  An artillery duel broke out across the river.  US and CS batteries fired at each others' positions, guided by the flashes of discharge and explosion.  When US infantry was safely on the east bank, the artillery fire tapered off, ending about 2100 hours.  Later CS skirmishers advanced to the river, finding the Union line abandoned.  CS units spread out across the field to tend to the wounded of both sides.  General Crook was angered that Thoburn's command had been left to their own devices without being reinforced by the VI Corps, which was at hand.", "Current Condition of the Battlefield": "\n\nThe setting of Cool Spring battlefield at the base of the Blue Ridge and on both banks of the Shenandoah River is very scenic.  The combination of rural condition and standing historic structures invokes a strong historic atmosphere.  The core area of the battlefield (where infantry attacks occurred) is private property owned by Holy Cross Abbey.  Buildings have been added on abbey grounds and Cool Spring mansion has been enlarged, but these additions, although visually intrusive, do not interfere with interpretation of the battle.  The recently constructed Abbey Retreat House sits astride the CS battle line and overlooks the main battlefield.  The wheatfield and river bank where the major infantry fighting occurred are in pristine condition.  The abbey does accommodate visitors to the battlefield with prior arrangement.\nUS approach routes along rte. 7 from Snickers Gap have been altered but not so that the strategy of movement is lost.  US staging and deployment areas on the east bank in the vicinity of the Parker House are private property owned by Golf Links, Inc.  Approaches to the fords here were recontoured for a previous golf course, which has been out of business for some years.  US artillery positions on the bluffs overlooking the river have been developed for a low-density housing project (Shenandoah Retreat). Access to this portion of the battlefield is restricted due to private ownership.\nThe general area contains many Civil War-era structures, including the Judge Parker House (judge who sentenced John Brown), North Hill, Riverside farm and tenant house, the old Snickers House, Waterloo, Cool Spring, and Wickliffe Church, besides other historic estates within a radius of several miles--Audley, Auburn, Clermont.  These structures reveal the plantation-style settlement pattern characteristic of this part of the Shenandoah Valley.  Remains of Westwood House near the Abbey can be located.  Remnants of stone fences used in the battle remain or old alignments can be traced.  Access roads to fords can be traced on the east and west banks.\nThe field surveyor rated this field fair, while GIS rated it good.  The field surveyor made deductions for the fourlane highway bridge, the recontoured ground on the east bank, housing on battery heights, and the modern retreat house which dominates many views from inside the core.", "Perception of Threats to Battlefield": "\nThe east bank of the battlefield is occupied by the Shenandoah Retreat development and a former golf course.  These areas were used for US staging and deployment in preparation of crossing the river and for the Union artillery positions.  The area was under fire from Confederate batteries.  It is uncertain how the planned redevelopment of the golf course by Golf Links, Inc., would impact battlefield integrity.  The east bank has already been substantially recontoured for the previous golf course upstream from the Parker House.\nThere has a long-standing controversy in the county among those who wish to redevelop the golf course and those who oppose further development in the area.  Golf Links did receive zoning from the county to go ahead with redevelopment, but as yet major construction has not begun.  A spokesman for the Holy Cross Abbey has suggested that the monastery might be forced to relocate to a more secluded place in response to the ``loss of privacy'' caused by encroaching development.  Residents of Shenandoah Retreat, on the other hand, have complained in the past about loud, raucous drinking parties along the river when the golf course was closed.\nAs a result, many residents support redevelopment of the golf course.  (It should be noted that public access to the Shenandoah River in this area is very restricted.) A spokesman for Golf Links, Inc., said that the owners were interested in incorporating a display and a possible walking trail into the new golf course design to help interpret the battle of Cool Spring.  The Judge Parker House (with existing additions) will serve as the club house for the golf course, if redevelopment proceeds.\nAt least two new housing tracts, featuring large houses on one- to three-acre lots have appeared along rte. 7 west of North Hill in the last several years.  Although these tracts are not within the battlefield study area, they are representative of the type of development that is occurring in this area.", "Identified Sites and Features Associated with the Battlefield": ["Berry's Ferry", "Berryville Pike", "Big Hill", "Castleman's Ferry House", "Champe Shepherd's Mill (site of*)", "Cool Spring House", "Cool Spring Run", "Fairview Mill (site of*)", "Frankford", "Front Royal-Charles Town Pike", "Gaylord", "Glenwood", "Island Fords", "Judge Parker House \"Retreat\"", "North Hill", "Old River Road (traces)", "Parker's Ford", "Parker's Hole", "Parker's Island", "Parker's Mill (site of)", "River Hill", "Riverside Farm", "Riverside Tenant House", "Shepherd's Mill (site of*)", "Snicker House", "Snicker's Ford", "Snicker's Gap", "Stone Walls (traces)", "UDC Cool Spring Battle Monument", "US Battery Heights", "Waterloo", "Webbtown", "Westwood (ruin)", "Westwood Grove", "Westwood Run", "Wheat Spring Branch", "Wickliffe Church"], "url": "http://www.nps.gov/abpp/shenandoah/svs3-10.html"}, {"Number": 11, "CWSAC": "VA116", "Battle": "Second Kernstown", "Start Date": "24 July 1864", "County": [{"name": "Frederick", "state": "VA"}, {"name": "City of Winchester", "state": "VA"}], "General Location": "\nUS 11 (Valley Pike) and Hoge Run; Old Opequon Church is approximate center of the field; Pritchard's Hill.", "Size of Study/Core Areas": "5,861/2,203 acres", "GIS Integrity of Study/Core Areas": "50/52 percent; Poor/Fair", "Field Assessment of Study Area Integrity": "Poor", "USGS Quadrants": ["Winchester", "Stephens City"], "Campaign": "Early's Maryland Campaign", "Principal Commanders": {"C": [{"rank": "Lt. Gen.", "first_name": "Jubal", "last_name": "Early"}], "U": [{"rank": "Brig. Gen.", "first_name": "George", "last_name": "Crook"}]}, "Forces Engaged": {"C": {"text": "Four infantry divisions (Gordon, Rodes, Ramseur, and Breckinridge/Wharton), four brigades of cavalry, and artillery, totalling about 13,000", "strength": 13000}, "U": {"text": "Three infantry divisions (Thoburn, Duval, and Mulligan), two cavalry divisions (Averell and Duffie), and three batteries of artillery, numbering about 10,000.", "strength": 10000}}, "Casualties": {"C": {"text": "unreported, est. 600 (100k/500w)", "casualties": 600, "killed": 100, "wounded": 500, "missing_captured": 0}, "U": {"text": "about 1,200 (120k/600w/480mc)", "casualties": 1200, "killed": 120, "wounded": 600, "missing_captured": 480}}, "Significance": "\nIn late June and early July 1864, Lt. Gen. Jubal A. Early's Confederate army used the strategic Shenandoah Valley corridor to terrorize Maryland, defeat a Union army at Monocacy, and march on Washington, D.C.  Only the diversion of reinforcements from the Army of the Potomac, bogged down in the trenches before Petersburg, turned back the invasion.  Early returned to the Valley and achieved a decisive victory over George Crook's command at Second Kernstown on 24 July.  He subsequently sent cavalry to burn Chambersburg, Pennsylvania on 30 July.  These disasters forced Lt. Gen. U.S. Grant to take immediate action to solve the Valley problem.  The VI Corps and elements of the XIX Corps were returned to the Valley and united with Crook's corps (called the Army of West Virginia).  Additional cavalry units were diverted to the Valley.  More importantly, Grant unified the various military districts of the region into the Middle Military District and appointed Maj. Gen. Philip Sheridan as overall commander.  Sheridan took command of the newly christened Army of the Shenandoah on 7 August at Harpers Ferry.  Sheridan's leadership and his strongly reinforced army turned the tide against Confederate power in the Shenandoah Valley.\nRutherford B. Hayes, later president of the United States, commanded a brigade during the battle on the left of the US line. John C. Breckinridge, former senator and vice president of the United States, commanded the Confederate division that confronted Hayes.", "Description of the Battle": "\nPhase One: Skirmishing at Kernstown (23 July): On the afternoon of 23 July 1864, CS cavalry advanced aggressively down the Valley Pike, driving US cavalry from Newtown (Stephens City) to Kernstown.  Brig. Gen. George Crook directed Duval's infantry division to deploy across the pike and clear the town of Confederates, which they did with little difficulty.  Crook then withdrew his infantry to Winchester behind Abrams Creek, leaving a brigade of cavalry to picket Kernstown.  The CS army encamped in the vicinity of Strasburg with headquarters at the Kendricks' House: Ramseur at Capon Grade, Rodes at Fisher's Mill, Wharton and Gordon on Hupp's Hill.  The CS cavalry withdrew to the vicinity of Newtown.\nPhase Two: Advance of CS Infantry (24 July): At first light, the CS infantry left their encampments near Strasburg and advanced down the Valley Pike.  At Bartonsville, Ramseur's division was directed west on side roads to the Middle Road.  Gordon, Wharton, and Rodes continued ahead on the pike.  Early sent two columns of cavalry to the east and west on a wide- ranging maneuver to converge on Winchester and the Federal rear.  Cavalry led the advance down the pike, coming up against the main US force at Kernstown about 1000 hours.  About noon, the vanguard of the CS infantry reached Kernstown.  Gordon deployed to the left of the Valley Pike, Wharton to the right.  Ramseur deployed across the Middle Road at Mrs. Massie's house.  Rodes moved east from the Pike, following a ravine.\nPhase Three: US Deployment on Pritchard's Hill: Crook received information that Early's army was approaching and brought two of his three divisions into line just north of Hoge's Run at Kernstown.  Mulligan's division held the US center behind a stone fence at the Pritchard House, supported by Capt. Henry DuPont's artillery massed on Pritchard's Hill to his rear.  Duval's two brigades were separated and posted on Mulligan's flanks with Hayes' brigade extending the US line east of the Valley Pike.  A strong skirmish line was posted near Opequon Church.  Thoburn's division was held in reserve on Pritchard's Hill to the right rear of the main US line.  Cavalry protected both flanks.\nPhase Four: CS Attack on Center: About noon, Gordon's division advanced in line west of the pike, driving back the skirmishers and closing with the main US line in the vicinity of Opequon Church.  Mulligan's division counterattacked, supported by Hayes on his left and took possession of the churchyard.  Soldiers sheltered there from the intense firing behind stone fences and headstones in the cemetery.  Gordon regrouped and again advanced, compelling Mulligan to fall back 250 yards to the stone fence along Pritchard's Lane.  Gordon reached Opequon Church but could make no further headway.  CS artillery was brought up south of the church to engage US artillery on Pritchard's Hill.  One of Wharton's brigades came into line on Gordon's right.  Crook repositioned his forces.  Duval's right flank brigade was moved west, astride Middle Road.  Thoburn's division was brought forward to fill the gap between Mulligan and Duval.  Elements of Duffie's cavalry supported the right flank on the Middle Road and picketed Cedar Creek Grade to the west.\nPhase Five: CS Attack on Left: Ramseur's division came into line from the Middle Road on Gordon's left and advanced.  Gordon shifted a brigade to the open ground west of Opequon Church and advanced against Thoburn in conjunction with Ramseur.  Without orders Gordon's brigade attacked and dislodged US troops sheltering behind two stone fences.  Thoburn withdrew to the base of Pritchard's Hill, bending his line back to the north and exposing Mulligan's right flank.  Ramseur advanced in force, wheeling right to confront Thoburn's line and bringing a heavy enfilade fire against Mulligan's line.\nPhase Six: CS Attack on Right: Wharton's division moved along the ridge east of the Pike to threaten the US left flank held by Hayes.  Elements of Averell's cavalry division were in position to delay this maneuver but withdrew without engaging.  In conjunction with Ramseur's advance on the CS left, Wharton attacked about 1500 hours and quickly turned the US left.  Hayes retreated to the stone walls that lined the Valley Pike and rallied his brigade, facing east at right angles to the center held by Mulligan.\nPhase Seven: US Retreat: Three CS divisions now moved in concert to envelope the US center.  Mulligan's division was under fire from three directions.  While trying to direct the defense, Mulligan himself was pierced by five minie balls and fell mortally wounded.  ``Lay me down and save the colors!'' he snapped at the officers who tried to assist him.  The US center collapsed, and soldiers began streaming to the rear.  Hayes' brigade stood long enough on the crest of Pritchard's Hill to allow the US artillery to escape.  Elements of Duffie's cavalry made a brief counterattack along the Middle Road, buying time for Thoburn's division to retire in relatively good order.\nPhase Eight: Rear Guard Actions: A brigade of Thoburn's division made a stand near the toll gate at the intersection of the Valley Pike and Cedar Creek Grade, while the rest of Crook's infantry retreated through the streets of Winchester.  Rodes' division, in the meantime, crossed from the Valley Pike to the Front Royal Road and marched north to cut off the Federal retreat, meeting only light opposition from the US cavalry.  Rodes followed the Federal forces north to Stephenson's Depot, taking hundreds of prisoners until darkness ended the pursuit.  The CS cavalry did not advance as Early expected.  The disorganized Federal army retreated to Bunker Hill where it regrouped.  Crook continued the retreat before dawn and eventually reached the Potomac River on 27 July.  For a few days after the battle, Federal prisoners were held in Star Fort.", "Current Condition of the Battlefield": "\nThe core of the battlefield, the US center and goal of decisive CS assaults, is Pritchard's Hill and the Pritchard Farm, owned by the Charles Hardy Grim Estate.  The ``Pritchard-Grim'' property (roughly from rte. 652 to Pritchard's Hill and from rte. 628 to the historic Opequon Church, about 200 acres) is agricultural land that retains a marked similarity to its Civil War appearance.  The property features a fine brick antebellum structure (Pritchard House), a frame tenant house, and several outbuildings that date from the time of the battle.  Col. James Mulligan, commander of the Union center, was wounded in front of and died in the Pritchard House two days after the battle.  The stone fence defended by Mulligan's infantry still runs along Pritchard's Lane.  CS forces attacked across the open meadow south of the house.  Pritchard's Hill served as a Union artillery strongpoint and was assaulted directly during the battle's closing phases.\nOpequon Church was the focal point of initial fighting; the original building was destroyed during the war but rebuilt in 1896.  Union accounts describe firing from behind tombstones in the cemetery.  An adjacent parcel (bounded by rte. 37, Cedar Creek Grade, and Middle Road to the Winchester city limits) is primarily agricultural with some new residences along Middle Road and Cedar Creek Grade.  This land, about 275 acres, was significant during First Kernstown, and was the location of the US far right at Second Kernstown, anchored on Sand Ridge until turned by Ramseur's advance.  Of about 2,200 acres of battlefield core, excluding Rodes' pursuit and cavalry actions, an estimated 625 acres of contiguous open ground remains.\nRamseur's deployment area on Middle Road is bisected by the four- lane rte. 37-bypass.  Gordon's deployment area is occupied by an industrial building and a housing subdivision.  The area where Wharton made his decisive flanking movement and attack Rutherford B. Hayes' brigade is occupied by a high density industrial park along US 11 and the railroad corridor.  Dense industrial and commercial development characterizes the land adjacent to and east of US 11.  The Pritchard-Grim property and Pritchard's Hill are the last portions of open ground south of the Winchester city limits.\nMost historic buildings of old Kernstown have been lost, with the notable exception of Hoge's Ordinary or Beemer's Tavern, which has been renovated into office space and anchors a five-acre office-commercial development.  Taylor provides a useful drawing of this structure in his sketchbook.  The Frederick County Historical Society has recently erected new interpretive signs and a map adjacent to Opequon Church, making the action more comprehensible to visitors.", "Perception of Threats to the Battlefield": "\nLand east of US 11 (Valley Pike) along the railroad tracks has been developed for a large-scale industrial/business park.  Route 11 is zoned commercial/industrial and has been densely developed from south of Kernstown to the Winchester city limits, causing concern over potential development plans west of the highway.  A new business/office park was recently constructed near the entrance to the Opequon Church with Hoge's Ordinary as its center piece.\nA county planning official noted, however, that watershed and ground water considerations make development in the Pritchard's Hill and Sand Ridge areas less desirable.  These factors would need to be considered before any development plans would be approved.  Residential development is encroaching on the northern part of Pritchard's Hill.  For the present, a large portion of this land remains in private ownership and has been altered little since the Civil War.  The Pritchard-Grim farm and adjacent portions of Pritchard's Hill are owned by the Charles Hardy Grim Estate.", "Identified Sites and Features Associated with the Battlefield": ["Bartonsville Mill", "Buffalo Lick Run", "Cedar Creek Grade", "Front Royal Road", "Glass House", "Hoge's Ordinary", "Hoge's Run", "Kernstown", "Magill House*", "Middle Road", "Old Town Winchester", "Opequon Church and Cemetery", "Pritchard House", "Pritchard's Hill", "Pritchard's Lane", "Sand Ridge", "Springdale", "Stephenson's Depot", "Stone Lane", "Stone Walls", "Tollgate (site of)", "Valley Pike"], "url": "http://www.nps.gov/abpp/shenandoah/svs3-11.html"}, {"Number": 7, "CWSAC": "VA107", "Battle": "Second Winchester", "Start Date": "13 June 1863", "End Date": "15 June 1863", "County": [{"name": "Frederick", "state": "VA"}, {"name": "City of Winchester", "state": "VA"}], "General Location": "Valley Pike (US 11 at Abrams Creek), Apple Pie Ridge and ``Louisiana Heights'' W of town, West Fort, Fort Milroy, and Star Fort; S. of present day Stephenson's (US 11 S of 761)", "Size of Study/Core Areas": "22,274/3,113 acres", "GIS Integrity of Study/Core Areas": "48/52 percent; Poor/Fair", "Field Assessment of Study Area Integrity": "Poor", "USGS Quadrants": ["Winchester", "Stephenson"], "Campaign": "Gettysburg Campaign", "Principal Commanders": {"C": [{"rank": "Lt. Gen.", "first_name": "Richard", "middle_name": "S.", "last_name": "Ewell"}], "U": [{"rank": "Maj. Gen.", "first_name": "Robert", "middle_name": "H.", "last_name": "Milroy"}]}, "Forces Engaged": {"C": {"text": "Second Corps ANV, two divisions (Early and Johnson), about 12,500", "strength": 12500}, "U": {"text": "Three infantry brigades (Elliott, Ely, McReynolds), numbering about 7,000", "strength": 7000}}, "Casualties": {"C": {"text": "269 (47k/219w/3m)", "casualties": 269, "killed": 47, "wounded": 219, "missing_captured": 3}, "U": {"text": "4,443 (95k/373w/3,975mc)", "casualties": 4443, "killed": 95, "wounded": 373, "missing_captured": 3975}}, "Significance": "\nAfter the Battle of Brandy Station (9 June 1863), Gen. Robert E. Lee launched his plan for a second invasion of the north.  He ordered the Second Corps, Army of Northern Virginia, under Maj. Gen. Richard Ewell to attack the US force at Winchester and clear the Lower Valley of Union opposition.  In the resulting three-day battle (13-15 June), Ewell's corps defeated, routed, and nearly destroyed a US division under Maj. Gen. Robert Milroy.  This victory (the apogee of Ewell's career) offered high hopes for the success of Lee's second invasion of the North, hopes that were dashed on the battlefield of Gettysburg in July.  In the words of Confederate artillerist Maj. Robert Stiles, ``This battle of Winchester ... was one of the most perfect pieces of work the Army of Northern Virginia ever did.'' The battle was won by deft flanking maneuvers and underscores the inadequacy of relying on entrenchments when confronted by a mobile attacking force.", "Description of the Battle": "\nPrelude (12 June): On 12 June 1863, the Second Corps of the Army of Northern Virginia under Lt. Gen. Richard S. Ewell, three divisions nearly 19,000 strong, entered the Valley at Chester Gap and pressed on to Front Royal.  Two divisions under Maj. Gen. Jubal A. Early and Maj. Gen. Edward Johnson continued north on the Valley Pike and the Front Royal Road to converge on the Union defenders of Winchester under Maj. Gen. Robert Milroy.  Despite the superior forces that were rumored to be approaching, Milroy was confident that the strength of his fortifications would enable him to repel the Confederates or withstand a siege.  The ridges west of town were heavily fortified and consisted of trenches linking central strong points or ``forts''.  The strongest of these were Fort Milroy and Star Fort.  West Fort, a redoubt of six guns, featured prominently in the action. \nPhase One.  US Dispositions (13 June): On 13 June, Milroy advanced elements of Elliott's brigade to Pritchard's Hill at Kernstown and sent elements of Ely's brigade to intercept any advance on the Front Royal Pike.  McReynolds brigade was at Berryville.\nPhase Two.  CS Advance on Front Royal Pike (13 June): Edward Johnson's Division of four brigades (Steuart, Williams, Walker, Jones) advanced on the Front Royal Pike driving back Union pickets.  Approaching the intersection of Millwood Road about 1400 hours, Johnson deployed and swept forward, driving Union skirmishers from behind stone fences.  US troops withdrew to high ground north of Abrams Creek under cover of a battery and the heavy guns of Fort Milroy.  Johnson brought up a battery and engaged Union field artillery, driving several pieces from the field.  The CS guns lacked the range to reply to Fort Milroy's guns and eventually were forced to withdraw.  Johnson's advance was stalled, and he awaited the arrival of Early's division to the west on the Valley Pike.\nPhase Three.  CS Advance on Valley Pike (13 June): Early's division of four brigades (Hays, Smith, Avery, Gordon) marched toward Winchester on the Valley Pike in conjunction with Johnson's division on the Front Royal Road.  Late afternoon, Early's column reached the outskirts of Kernstown and drove back the US skirmish line encountered at Pritchard's Hill.  US forces retreated to Cedar Creek Grade and briefly counterattacked, but Early extended his line to the west, out-flanking successive Union positions.  US cavalry attacked several times up the Valley Pike to ease pressure on the infantry.  Eventually, the Union force retreated north of Abrams Creek under cover of the heavy guns from Bower's Hill and Fort Milroy.\nPhase Four.  Milroy Withdraws into the Forts (13 June): After dark Milroy concentrated his forces inside a triangle defined by Fort Milroy, Star Fort, and West Fort.  McReynolds' brigade reached Fort Milroy after marching a round-about route from Berryville, harassed by Confederate cavalry.  Milroy's soldiers had fought well during the previous afternoon, and he was confident that he could withstand renewed Confederate assaults in the morning.  In the meantime, Ewell ordered his third division under Maj. Gen. Robert E. Rodes to advance on Martinsburg via Berryville to cut off Milroy's retreat in that direction.\nPhase Five.  Early's Flank March (14 June): At dawn of 14 June, one of Early's brigades (Gordon) swept forward to capture Bower's Hill with little resistance.  Johnson extended his line to the right against very light opposition; there was fitful skirmishing in the streets of Winchester.  Early and Ewell conferred on Bower's Hill and decided on a flanking strategy.  Gordon's brigade and two batteries were left on Bower's Hill, while Early led his three other brigades back to Cedar Creek Grade, west beyond Apple Pie Ridge where it was out of view of US fortifications, then north over Cloverdale Plantation to Walnut Grove.  His column was accompanied by 20 guns.  While Early made this march, Johnson advanced a line of skirmishers on the right to occupy the Federals' attention.  The CS batteries on Bower's Hill opened up, touching off a duel with the Union guns in Fort Milroy.  By mid-afternoon, Early's force had gained a position opposite West Fort on Apple Pie Ridge.  Eight guns were positioned on the Brierly Farm northwest of the fort, while 12 guns were placed in an orchard southwest of the fort.  By this time the field had quieted, and the US forces believed that the Confederates had been repulsed from Winchester.\nPhase Six.  Attack on West Fort (14 June): About 1800 hours, Early's artillery opened fire on West Fort.  The twenty guns fired for 45 minutes, while Brig. Gen. Harry T. Hays stealthily advanced his Louisiana brigade through the corn and wheat fields at the base of Apple Pie Ridge.  On command, the brigade rushed forward across 300 yards of open fields and swept upward into the works.  After a brief hand-to-hand struggle, US defenders abandoned the works, retreating to Fort Milroy.  Hays was supported in the attack by two brigades (Smith and Avery).  Early consolidated his line on West Fort Ridge, but darkness prevented further gains.  An artillery duel continued until long after dark.  After the battle, Ewell christened West Fort Ridge as ``Louisiana Heights'' in honor of Hays's brigade.\nPhase Seven. Johnson's Flank March (14-15 June): Ewell assumed that Milroy would retreat during the night and ordered Johnson to prevent his escape by cutting the Charles Town Road.  About 2100 hours, Johnson (with Steuart's and Williams's brigades and 8 guns) marched north to Berryville Pike and west to Jordan Springs Road, where he turned north toward Stephenson's Depot.  About midnight, the Stonewall brigade disengaged and joined the rear of the column, leaving one brigade (Jones) astride the Berryville Pike east of town.\nPhase Eight.  US Withdrawal (14-15 June): After conferring with his officers, Milroy made the decision to try to ``cut their way through'' to Harpers Ferry on the old Charles Town Road.  All of the cannons were spiked and their carriages destroyed.  Shortly after midnight, the Union soldiers left their works so quietly that Early's Confederates did not know they were gone until morning.  The column massed in the low ground between Star Fort and Fort Milroy, then moved down the railroad and the Valley Pike toward the Charles Town crossroad, just south of Stephenson's Depot.\nPhase Nine.  US Surrender at Stephenson's Depot (15 June): Near dawn, Johnson's skirmishers encountered the head of Milroy's retreating column near the intersection of the Valley Pike and old Charles Town road.  Milroy faced his column to the right on the pike and prepared to fight his way out of a ``murderous trap.'' Johnson deployed his regiments along Milburn Road as they came up and advanced to the railroad and placed two guns on either side of the Charles Town Road railroad bridge.  The rest of the artillery was deployed on the heights east of Milburn Road.  As it grew light, US forces made several desperate but uncoordinated attacks against the bridge and railroad embankment.\nThe Confederates were being steadily reinforced and repulsed each attempt.  The Stonewall brigade now came up in line of battle north of the road and advanced to cut the Valley Pike.  This was the final blow; Union regiments hoisted the white flag.  Between 2,500 and 3,000 surrendered.  Milroy and his staff, and other small units escaped to the west.  (Note: US casualty figures for Second Winchester vary widely.  This is explained by the fact that about two thousand Union soldiers not belonging to Milroy's command were in field hospitals in the city and were often added to the number of captured and missing.  Milroy, of course, played down his losses.)", "Current Condition of the Battlefield": "\nContrary to popular perception, Second Winchester is not a ``lost'' battlefield.  Because of the wide-ranging Confederate maneuvers involved, the battlefield covers a great deal of ground, but the major fighting and casualties occurred at five locations: Pritchard's Hill; the intersection of Millwood and Front Royal pikes (interchange 82 of I-81); Abrams Creek and Bower's Hill; Apple Pie Ridge and West Fort; and Stephenson's Depot.  Three of these locations retain high levels of integrity: Pritchard's Hill, Apple Pie Ridge and West Fort, and Stephenson's Depot.  The parcel of ground at Pritchard's Hill figured prominently in both battles of Kernstown and in the rear guard actions of Opequon.  The parcel of ground at Stephenson's Depot figured in cavalry actions during the battle of Opequon and in the engagement of Rutherford's Farm (20 July 1864).  Although the field over which the Louisiana Brigade attacked West Fort has been divided by the rte. 37 bypass, the terrain is still intact and adds to the interpretation of the battle.\nCentral to understanding the Union ring of fortifications at Winchester are Fort Milroy, Star Fort, and West Fort.  Of these, Star Fort is well preserved, while remnants survive of Fort Milroy and West Fort.  Portions of related entrenchments survive on ridges north and west of Winchester, although the extent of survivals has not been measured.  The view from Star Fort is essential for understanding the US position at Second Winchester.\nAccess to Fort Milroy and creation of a viewshed among trees would enhance the ability to interpret the Union situation.\nThe routes of CS flanking maneuvers (Early to the west and Johnson to the east) can be followed.  Early's route traverses well preserved rural tracts north from Cedar Creek Grade along Apple Pie Ridge.  The exact route can only be followed on foot across private property.  Johnson's route crosses a portion of the Opequon battlefield and follows rural roads past Jordan Spring to the intersection of rtes. 761 and 11 near Stephenson.  Much of this course is through scenic farmland, although the density of housing along segments of these roads is increasing.  Driving this route offers an appreciation of CS strategy and of the final action at Stephenson's Depot.\nMany historic structures associated with the battle remain in and around the city of Winchester, including Taylor's Hotel which served as the US headquarters, and Cloverdale and Walnut Grove, which were passed by Early's flank march.", "Perception of Threats to Battlefield": "\nThe city of Winchester has grown up around the US defensive position, which was anchored by West Fort, Star Fort, Fort Milroy, and connecting entrenchments.  In most cases, however, the ridge crests have been the last to develop as residential tracts have filled the valleys.  As a result, Star Fort is well preserved; portions of Fort Milroy remain; and traces of West Fort can be located.  Recently, housing has been built along West Fort Ridge (``Louisiana Heights'') destroying or otherwise segmenting surviving earthworks.  The northern portion of Fort Milroy was recently purchased for the purpose of development; the southern portion is owned by National Fruit Products.  Seven acres of Star Fort are owned by a local preservation group, but the surrounding 50 acres are zoned commercial/business and are currently for sale; portions of earthworks at Star Fort are in need of stabilization; grounds would need to be cleared, planted with grass, and maintained to expand visitation and interpretation.  Commercial and industrial development along rte. 522 intrudes somewhat on the viewshed.\nOf the five main engagement areas, Bower's Hill is a housing subdivision and site of a high school, elementary school, and water tower.  A degraded portion of the field (also fought over during First Winchester) remains along railroad tracks west of US 11, but this land is scheduled for high density residential development.  Johnson's position on June 13-14 at intersection of Front Royal and Millwood pikes lies beneath I-81 interchange #82. Land contours have been extensively altered and viewsheds blocked by dense commercial/industrial development in the vicinity.  These two segments for most interpretive activities have been lost.\nPritchard's Hill is privately owned and remains in a relatively pristine state.  The land between Pritchard's Hill and Bower's Hill has already been densely developed for residential and commercial purposes.  The Apple Pie Ridge-West Fort parcel across which the Louisiana brigade attacked West Fort is bisected by rte. 37-bypass but is visually well preserved, maintained as pasture and apple orchards.  Two historic stone houses survive adjacent to the highway, which runs through a ravine and is not particularly intrusive to the view from Apple Pie Ridge.  An excellent vantage point for understanding this phase exists just south of the intersection of rtes. 522 and 679.\nThe area south of Stephenson's Depot, site of the massive US surrender, is by far the best preserved parcel of Second Winchester.  Except for power lines and towers, the land retains its Civil War appearance.  This parcel covers much of the ground where the battle culminated, where the most desperate fighting occurred, and where nearly 3,000 Union soldiers surrendered; its significance should not be underestimated.  The parcel is owned by a local developer, but is not currently serviced by sewage lines.", "Identified Sites and Features Associated with the Battlefield": ["Abrams Creek", "Abrams Delight", "Apple Pie Ridge", "Battery Hill", "Battery Heights", "Berryville Pike", "Bower's Hill", "Camp Hill", "Cedar Creek Grade", "Cloverdale*", "Collier Redoubt", "Entrenchments", "Fort Milroy", "Front Royal Pike", "Jonathan Smith House", "Jordan Springs", "Keckley Mills", "Kernstown", "Louisiana Heights", "Middle Road", "Milburn Cemetery", "Milburn Road", "Milltown", "National Cemetery", "Northwestern Pike", "Old Charles Town Road", "Old Town Winchester", "Parkin's Mill", "Pritchard's Hill", "Star Fort", "Stephenson's Depot", "Stine's Chapel (site of)", "Stone Houses", "Stonewall Cemetery", "Taylor's Hotel", "Tidball's Spring", "Tollgate (site of)", "Valley Pike", "West Fort", "Walnut Grove*", "Willow Lawn*", "Winchester & Potomac Railroad"], "url": "http://www.nps.gov/abpp/shenandoah/svs3-7.html"}, {"Number": 6, "CWSAC": "VA106", "Battle": "Port Republic", "Start Date": "9 June 1862", "County": [{"name": "Rockingham", "state": "VA"}], "General Location": "N. of rte. 659, S. of rte. 708, between South Fork Shenandoah and state rte. 340. Village of Port Republic", "Size of Study/Core Areas": "4,936/2,145 acres", "GIS Integrity of Study/Core Areas": "94/98 percent; Good/Good", "Field Assessment of Study Area Integrity": "Good", "USGS Quadrants": ["Grottoes"], "Campaign": "Jackson's Valley Campaign", "Principal Commanders": {"C": [{"rank": "Maj. Gen.", "first_name": "T.", "middle_name": "J.", "last_name": "Jackson"}], "U": [{"rank": "Brig. Gen.", "first_name": "E.", "middle_name": "B.", "last_name": "Tyler"}]}, "Forces Engaged": {"C": {"text": "Jackson's and Ewell's divisions, about 6,000 engaged", "strength": 6000}, "U": {"text": "Two brigades of Shields's division (Tyler and Carroll), about 3,500", "strength": 3500}}, "Casualties": {"C": {"text": "816 (88k/535w/34m)", "casualties": 816, "killed": 88, "wounded": 535, "missing_captured": 34}, "U": {"text": "1,002 (67k/361w/574mc)", "casualties": 1002, "killed": 67, "wounded": 361, "missing_captured": 574}}, "Significance": "The battles of Cross Keys and Port Republic were the culmination of ``Stonewall'' Jackson's Valley Campaign in which Jackson maneuvered to defeat superior Union forces by surprise, swift marching, and concentration of force.  In May and June, Jackson's Army of the Valley, which never exceeded 17,000 men, inflicted more than 7,000 casualties on his opponents at a cost of only 2,500 of his own men, and tied up Union forces three times its strength.  Jackson's victories infused new hope in the Confederate cause and contributed to the defeat of McClellan's campaign against Richmond.   The battle of Port Republic was a fierce contest between two equally determined foes and was the most costly battle fought by the Army of the Valley during its campaign.  At its conclusion, Union forces withdrew down the Valley, freeing Jackson's command to go to the aid of the CS army facing Maj. Gen. George McClellan's army in front of Richmond.", "Description of the Battle": "\nPhase One.  Dispositions of the Armies: During the night of 8-9 June 1862, Winder's ``Stonewall'' Brigade was withdrawn from its forward position near Bogota and rejoined Jackson's division at Port Republic.  CS pioneers built a bridge of wagons across the South River at Port Republic.  Winder's brigade was assigned the task of spearheading the assault against US forces south of the river.  Trimble's brigade and elements of Patton's were left to delay Fremont's forces at Cross Keys, while the rest of Ewell's division marched to Port Republic to be in position to support Winder's attack. \nPhase Two.  US Deployment: Brig. Gen. E. B. Tyler's brigade joined Col. Samuel Carroll's brigade north of Lewiston on the Luray Road. The rest of Shields's division was strung out along the muddy roads back to Luray.  General Tyler, in command on the field, advanced at dawn of 9 June to the vicinity of Lewiston.  He anchored the left of his line on a battery positioned on the Lewiston Coaling, extending his infantry west along Lewiston Lane (present day rte. 708) to the South Fork near the site of Lewis' Mill.  The right and center were supported by artillery (16 guns in all).\nPhase Three.  CS Advance on the Left and Center: Winder's brigade crossed the river by 0500 hours and deployed to attack east across the bottomland.  Winder sent two regiments (2VA and 4VA) into the woods to flank the US line and assault the Coaling. When the main CS battle line advanced, it came under heavy fire from the US artillery and was soon pinned down.  CS batteries were brought forward onto the plain but were outgunned and forced to seek safer positions.  Ewell's brigades were hurried forward to cross the river.  Seeing the strength of the US artillery at the Coaling, Jackson sent Taylor's brigade to the right into the woods to support the flanking column that was attempting to advance through the thick underbrush.\nPhase Four.  US Counterattack: Winder's brigade renewed its assault on the US right and center, taking heavy casualties.  General Tyler moved two regiments from the Coaling to his right and launched a counterattack, driving CS forces back nearly half a mile.  While this was occurring, the first CS regiments probed the defenses of the Coaling but were repulsed.\nPhase Five.  Fighting at the Coaling: Finding resistance more fierce than anticipated, Jackson ordered the last of Ewell's forces still north of Port Republic to cross the rivers and burn the North Fork bridge.  These reinforcements began to reach Winder, strengthening his line and stopping the US counterattack.\nTaylor's brigade reached a position in the woods across from the Coaling and launched a fierce attack, which carried the hill, capturing five guns.  Tyler immediately responded with a counterattack, using his reserves.  These regiments, in hand-to- hand fighting, retook the position.  Taylor shifted a regiment to the far right to outflank the US battle line.  The CS attack again surged forward to capture the Coaling.  Five captured guns were turned against the rest of the Union line.  With the loss of the Coaling, the Union position along Lewiston Lane became untenable, and Tyler ordered a withdrawal about 1030 hours.  Jackson ordered a general advance.\nPhase Six.  Tyler's Retreat/Fremont's Advance: Taliaferro's fresh CS brigade arrived from Port Republic and pressed the retreating Federals for several miles north along the Luray Road, taking several hundred prisoners.  The Confederate army was left in possession of the field.  Shortly after noon, Fremont's army began to deploy on the north bank of the South Fork, too late to aid Tyler's defeated command.  Fremont deployed artillery on the high bluffs to harass the CS forces.  Jackson gradually withdrew along a narrow road through the woods and concentrated his army in the vicinity of Mt. Vernon Furnace.  Jackson expected Fremont to cross the river and attack him on the following day, but during the night Fremont withdrew toward Harrisonburg.", "Current Condition of the Battlefield": "\nThe setting of Port Republic battlefield, along the South Fork Shenandoah River at the base of the forested Blue Ridge, is very scenic.  From some locations the base of Massanutten Mountain can be seen to the north.  The core of the battlefield of Port Republic extends from the village of Port Republic east to rte. 708, which approximately traces the main US battle line.  The old Luray-Port Republic Road followed rte. 955 north from the village until joining present day US 340.  (US 340 south of this intersection is not historic.) The ford over South River where Jackson built his ``wagon bridge'' is located just west of the confluence of the South and North rivers and can be reached by a dirt road off rte. 955.  The North River bridge was at the end of rte. 1601.  Fremont's batteries were deployed along the north bank of the South Fork, south of Lawyer's Road, in the battle's last phase.\nThe main CS assaults of General Winder were carried out on the bottomland between rtes. 955, 708, and the river.  The land remains agricultural and retains a strong similarity to its Civil War appearance, except for the railroad which was not there at the time of the battle (built 1892).  The railroad artificially divides the battlefield but does not particularly intrude upon most viewsheds.\nThe Coaling, which was the key to the US defense, is located just northeast of the intersection of US 340 and rte. 708.  The Association for the Preservation of Civil War Sites (APCWS) owns about 8 acres of the Coaling, acquired from the Lee-Jackson Foundation.  An 1880s house sits atop the Coaling where US batteries were deployed.  Access to this property is encouraged but unmarked.\nThe village of Port Republic is listed as a historic district in the National Register.  Several historic structures remain in the area, including Lynnwood, Bogota, Frank Kemper House in Port Republic, and others.  The Dr. Kemper house at the west edge of town, which served as Jackson's headquarters, is no longer extant.  The ruin of Mt. Vernon Furnace in the area where Jackson's army bivouacked after the battle is situated in Shenandoah National Park along rte. 659.  A driving tour of Port Republic could be laid out to view the battlefield with stops at the village, at the railroad (rte. 708), and the Coaling.  Because of the terrain, Port Republic can be interpreted from public roads.  The portion of the Coaling preserved by APCWS allows an expanded interpretation of the battle.  The areas of major infantry fighting along the river are in private hands, but the logic of the respective positions can be understood for the most part from public roads.", "Perception of Threats to the Battlefield": "\nThe bottomland south of the South Fork in the core area of the battlefield is owned by two or three large landowners.  Several years ago the county denied one of the landowners a petition to establish a gravel quarry, partly because of concerns for maintaining battlefield integrity.  Continuing integrity of the landscape is dependent upon landowners continuing to farm their properties. ", "Identified Sites and Features Associated with the Battlefield": ["Baugher House (site of*)", "Bogota", "Brown's Gap Road", "Coaling", "Deep Run", "Dr. Kemper House (site of)", "Frank Kemper House", "Jackson's Prayer Tree", "John Lewis House (site of)", "Lawyer's Road", "Lewis' Mill (site of)", "Lewiston (site of)", "Luray Road", "Lynwood", "Mt. Vernon Furnace (ruin)", "New Haven", "Pirky's Ford", "Port Republic Battle Monument", "Port Republic", "South Fork Bridge Site ", "South River", "Wagon Bridge Site", "Yost House (site of*)"], "url": "http://www.nps.gov/abpp/shenandoah/svs3-6.html"}, {"Number": 9, "CWSAC": "VA111", "Battle": "Piedmont", "Start Date": "5 June 1864", "County": [{"name": "Augusta", "state": "VA"}], "General Location": "Near village of Piedmont, crossing of rtes. 608 & 778; Piedmont is four miles east of the Valley pike, and seven miles southwest of Port Republic", "Size of Study/Core Areas": "9,340/2,693 acres", "GIS Integrity of Study/Core Areas": "97/98 percent; Good/Good", "Field Assessment of Study Area Integrity": "Good", "USGS Quadrants": ["Grottoes", "Crimora", "Fort Defiance"], "Campaign": "Lynchburg Campaign (Hunter)", "Principal Commanders": {"C": [{"rank": "Brig. Gen.", "first_name": "William", "middle_name": "E.", "last_name": "Jones"}], "U": [{"rank": "Maj. Gen.", "first_name": "David", "last_name": "Hunter"}]}, "Forces Engaged": {"C": {"text": "Two infantry brigades (Jones and Browne), home guards, and cavalry under Imboden and Vaughn, about 5,500", "strength": 5500}, "U": {"text": "Sullivan's division (two brigades under Moor and Thoburn), Stahel's cavalry division, and artillery under DuPont, about 8,500", "strength": 8500}}, "Casualties": {"C": {"text": "about 1,500 (100k/500w/900mc)", "casualties": 1500, "killed": 100, "wounded": 500, "missing_captured": 900}, "U": {"text": "875 (150k/650w/75m)", "casualties": 875, "killed": 150, "wounded": 650, "missing_captured": 75}}, "Significance": "\nOn 5 June 1864, the US army of General David Hunter crushed the smaller Confederate army at Piedmont, killing the CS commander (General ``Grumble'' Jones) and taking nearly 1,000 prisoners.  Piedmont was an unmitigated disaster for CS arms in the Valley.  The disorganized Confederates could do nothing to delay Hunter's advance to Staunton, where he was reinforced by Brig. Gen. George Crook's Army of West Virginia marching from the west.  United, the US forces moved on Lynchburg.  Hearing of Jones' defeat, Gen. Robert E. Lee first rushed J. C. Breckinridge's division back to Rockfish Gap (7 June) and then detached the Second Corps of the Army of Northern Virginia under Lt. Gen. Jubal Early to confront Hunter at Lynchburg (12 June).  This detachment severely limited Lee's ability to undertake defensive-offensive operations on the Richmond-Petersburg lines and served to open up the Shenandoah Valley as a second front in the 1864 fighting in Virginia.", "Description of the Battle": "\nPhase One.  Cavalry Action at Mt. Meridian: Shortly after dawn, 5 June 1864, US cavalry advanced on the Staunton Road and met CS cavalry under Brig. Gen. John D. Imboden at Mt. Meridian.  The US troopers were driven back until reinforced and again advanced to Mt. Meridian, supporting their attack with ten field pieces.  The Confederates responded with two guns.  Imboden continued to delay the US advance, while gradually retiring.  US cavalry incurred about 100 casualties in the morning's action.  Fighting occurred around Bonny Doon.  In the wake of the cavalry, US infantry marched south from Port Republic.\nPhase Two.  CS Deployment at Piedmont: General ``Grumble'' Jones deployed his army in an ``L'' anchored on a bend of Middle River facing north and bending south along the ridge line.  He placed his two veteran brigades (under Col. Beuhring Jones and Col. William H. Browne) on the left and center behind barricades of fence rails.  His reserves, which consisted of home guards, were drawn up in the woods just south and west of Piedmont.  Vaughn's cavalry brigade was in position along the Cross Road (present day rte. 778) east of Piedmont.  His line was supported by artillery.  Jones made his headquarters in a tent in the yard of the modern McDonald House.  (Imboden's cavalry brigade after the morning's delaying action withdrew behind Polecat Draft near Round Hill.)\nPhase Three.  US Advance to Piedmont: About 1000 hours, US cavalry drove the CS troopers back to the main infantry line at Piedmont and then withdrew out of cannon range to await the arrival of their infantry and artillery.  Moor's brigade arrived first and deployed to the right of the road into the river bend.  They were fired on by CS skirmishers.  Thoburn's brigade deployed to the left of the road in the vicinity of the Shaver House.  DuPont arrayed his artillery battalion on the heights confronting the CS position.  Hunter made his headquarters in the Shaver House.  One brigade of US cavalry was held in reserve.\nPhase Four.  US Attacks on the Right: DuPont massed 22 guns against the angle in the CS line, eventually forcing two batteries to retire and take up a position closer to Piedmont village.  Shortly after noon, elements of Moor's brigade (18CT) assaulted the hill to their right front, driving out the CS skirmishers.  Supported by a regiment of Thoburn's brigade, Moor's entire line advanced, driving back the advanced CS line on the northern brow of the ridge.  Jones withdrew his infantry to barricades along Walker's Lane, reinforced his left to meet the US charges, and launched a counterattack.  Fighting swayed back and forth across the fields.  Hunter now reinforced Moor with Wynkoop's cavalry brigade, fighting dismounted, and renewed his attack.\nPhase Five.  US Attack on the Left: While fighting raged on the right, Col. Thoburn led three regiments through a ravine and woods on the left and attacked across the Givens Run Valley.  Mid-afternoon, he charged directly into a gap in the CS line that was opened when Jones reinforced his left flank.  CS reserves were advancing to fill the gap but Thoburn's regiment reached the crest first, and a savage, hand-to-hand mele erupted.  About this time, Gen. Jones was killed, and the CS defense came unraveled.  Inexplicably, the CS cavalry (Vaughn) witnessed Thoburn's attack but did not advance.\nPhase Six.  CS Rout: Pressed on the front and rear, Confederate soldiers went streaming over the steep bluffs behind to wade and swim the river.  All order was lost.  A nasty skirmish was fought over possession of the ford to the rear of the Col. Crawford House.  Stahel's US cavalry division advanced on the far left to close in on the village by the Cross Road.  They were met by Vaughn's and Imboden's cavalry who at last came into play to act as rear guard.  Some CS units attempted to stand near the Middle River Church and at New Hope, and US pursuit gradually slackened.  The CS army lost about 900 captured.", "Current Condition of the Battlefield": "\nPiedmont battlefield is located on the Middle River in an area of great scenic beauty.  The battle is readily interpreted from public roads with minimal access to private lanes and farm roads.\nThe landscape in much of the area is similar to its appearance at the time of the battle with some intrusions, most notably the Wampler-Longacre experimental poultry farm.  This farm, with about a dozen very large barns, is situated just behind a major US artillery position and is visible from several parts of the field.  One of the best views of the CS position is from this farm, although access is restricted.  The site of the major US attacks on the right is in very good condition.  Site of Thoburn's attack on the left along Givens Run is in good condition.  There are considerably fewer trees along the river now than at the time of the battle.  Round Hill was a CS signal station and anchored the far right flank of the CS cavalry.\nThe Shaver House, which was General Hunter's headquarters, is owned by the same family as at the time of the battle.  Various other historic structures remain, including the Finley House, Crawford House, David Beard House (Belmont), Mt. Horeb Church, and the old Garber barn; Bonnie Doon and Givens House in Mt. Meridian.  Grand Caverns (Weyer's Cave) is nearby at Grottoes.  ``Jackson's Prayer Tree'' is located just north of Mt. Meridian.  Local landowners say that Jackson conducted a prayer meeting here in June 1862.  Jackson's headquarters were in the woods near here. There is strong anecdotal evidence among local landowners that burials have been unearthed on Piedmont battlefield.", "Perception of Threats to the Battlefield": "\nMuch of the northern half of the battlefield, scene of the most severe fighting, has been placed in a county agricultural preservation district, which restricts non-agricultural development for seven years.  Several property owners in the core area refused to participate in the voluntary district.  Long-time residents state that they desire to ``keep farming forever'' and express concern that the government might take their land to make a national park.  The agricultural district allows intensive poultry farming similar to the Wampler-Longacre farm, although densities of these barns are limited by disease considerations and may already be close to maximum density.  The southern end of the field around the villages of Piedmont and New Hope has attracted some new residential construction and is served by county sewage lines.  New construction along rte. 778 east of Piedmont or on rte. 608 between Mt. Meridian and Piedmont would tend to degrade the battlefield's high integrity. Round Hill is a distinctive feature of the area, dominating views from many parts of the battlefield.", "Identified Sites and Features Associated with the Battlefield": ["Beard House*", "Bonnie Doon", "Col. Crawford House", "Crawford's Ford", "Cross Road", "East Road", "Garber House (site of*)", "Garber's Hill", "Given's Run Valley", "Givens Mill (site of*)", "Humbert House (site of*)", "Jackson's Prayer Tree", "Jacob Miller House", "McColley House (site of*)", "Middle River", "Mt. Meridian", "New Hope", "Piedmont", "Rockfish Road", "Round Hill", "S. B. Finley House", "Shaver House", "Sheep Hill", "US Battery Heights", "W. L. Finley House (ruin)"], "url": "http://www.nps.gov/abpp/shenandoah/svs3-9.html"}, {"Number": 14, "CWSAC": "VA121", "Battle": "Tom's Brook", "Start Date": "9 October 1864", "County": [{"name": "Shenandoah", "state": "VA"}], "General Location": "\nValley Pike (US11) at Tom's Brook and Jordon Run, I-81, Back Road (rte. 623) at Tom's Brook.", "Size of Study/Core Areas": "6,644/2,018 acres", "GIS Integrity of Study/Core Areas": "83/83 percent; Good/Good", "Field Assessment of Study Area Integrity": "Fair", "USGS Quadrants": ["Tom's Brook", "Woodstock"], "Campaign": "Sheridan's Valley Campaign", "Principal Commanders": {"C": [{"rank": "Maj. Gen.", "first_name": "Thomas", "last_name": "Rosser"}, {"rank": "Maj. Gen.", "first_name": "Lunsford", "last_name": "Lomax"}], "U": [{"rank": "Brig. Gen.", "first_name": "Alfred", "last_name": "Torbert"}]}, "Forces Engaged": {"C": {"text": "Two cavalry divisions (Rosser and Lomax) about 3,500", "strength": 3500}, "U": {"text": "Two cavalry divisions  (Wesley Merritt and  George A. Custer), about 6,300", "strength": 6300}}, "Casualties": {"C": {"text": "350 (20k/50w/280mc)", "casualties": 350, "killed": 20, "wounded": 50, "missing_captured": 280}, "U": {"text": "57 (10k/47w)", "casualties": 57, "killed": 10, "wounded": 47, "missing_captured": 0}}, "Significance": "\nTom's Brook was a battle of strategy and maneuver that pitted cavalry against cavalry.  The CS cavalry were eager for revenge against the US cavalry, which had been burning barns and mills in the Valley for the previous week.  On 9 October 1864, however, Sheridan ordered his cavalry to ``whip'' the enemy or get whipped themselves.  In the resulting conflict, the US troopers routed the CS cavalry, impairing its morale and efficiency for the remainder of the campaign.  The CS flight was referred to by Valley residents and victorious Union troopers as the ``Woodstock Races.'' The fighting on the Back Road at Spiker's Hill pitted two former West Point roommates against one another--Tom Rosser and George Armstrong Custer.  Maj. Gen. Philip H. Sheridan watched the battle unfold, reputedly from the summit of Round Hill.", "Description of the Battle": "\nPhase One.  Disposition of Forces: On 8 October 1864, the Confederate Cavalry under overall command of Maj. Gen. Thomas Rosser harried the withdrawing US cavalry on the Valley Pike and the Back Road, fighting a brisk skirmish along Tom's Brook near the Back Road.  The CS cavalry were enraged by the destruction of the Valley they had witnessed in the last week and were attempting to arrest further destruction.  Rosser had been dispatched to the Valley from Petersburg to command the CS cavalry and had generally been hailed by the local populace as the ``Savior of the Valley.'' At dark, Rosser halted his division of three brigades (about 2,500 men) on the Back Road in the vicinity of Spiker's Hill and pushed skirmishers beyond Tom's Brook to Mt. Olive.  The Middle Road was covered by a force of observation of unknown size.  Maj. Gen. Lunsford Lomax's Division of two brigades and a battery of horse artillery (about 1,000 men) bivouacked on both sides of the Valley Pike behind Jordon Run just south of the hamlet of Tom's Brook. \nBrig. Gen. Wesley Merritt's US cavalry division (about 3,500 men) under overall command of Brig. Gen. Alfred Torbert encamped at the base of Round Hill. Brig. Gen. George Armstrong Custer's division of two brigades (about 2,500), bivouacked ``behind Tumbling Run'' northeast of Mt. Olive on the Back Road.  Upset by Rosser's aggressive tactics of the previous days, army commander Maj. Gen. Philip H. Sheridan ordered Torbert to move at daylight of 9 October and ``whip the rebel cavalry or get whipped himself.'' \nPhase Two.  US Advance on Valley Pike: Torbert planned to bring an overwhelming force against Rosser's division on the Back Road while holding Lomax's division at bay with a reinforced brigade on the Valley Pike.  Lomax's main battle line was deployed behind Jordon Run on both sides of the Valley Pike, supported by six guns.  His front line was dismounted, while he maintained a strong mounted reserve on the pike.\nAt dawn, Lowell's brigade (Merritt) advanced to Tom's Brook on the Pike, deployed, and pushed forward ``one-quarter of a mile'' where it found Lomax's main line, dismounted behind Jordon Run.  The CS line was supported by six guns placed on either side of the Valley Pike and a strong mounted reserve.  While Lowell was engaged, Kidd's brigade rode north along Tom's Brook to connect and cooperate with Custer.  Devin's brigade followed but veered off on the Harrisville Road (or overland) and advanced to the vicinity of St. Johns Church, maintaining a connection with the force on the Valley Pike and at the same time extending a skirmish line to connect with the Kidd's brigade on the right.\nPhase Three.  Custer's Advance/ Fighting on Back Road: Rosser dismounted most of his troopers behind Tom's Brook at the base of Spiker's Hill behind stone fences and rudimentary fieldworks (his brigades from left to right, Munford, Payne, and the Laurel brigade).  Rosser's six guns unlimbered along the crest of Spiker's Hill slightly behind a second line of barricades.  A mounted reserve was maintained on the ridge; the right was extended toward the Middle Road with mounted skirmishers.\nAdvancing beyond Mt. Olive, Custer pushed forward three regiments of dismounted skirmishers against the main CS position. Three other regiments and Wells' brigade were kept mounted and maneuvered for position behind the skirmish line.  A battery of artillery unlimbered on the hill in front of present-day St. Matthews (or Sand Ridge) Church and engaged the Confederate artillery on Spiker's Hill.  When Kidd's brigade made contact with Custer's left, Custer extended his right flank along the shoulder of Little North Mountain, supporting the movement with a battery.  Kidd deployed over the hill, driving Rosser's skirmishers before him, and unlimbered another battery to enfilade the CS position.  The Confederate line was gradually forced back into a horseshoe around the front of Spiker's Hill.  A regiment of US cavalry (probably of Devin's brigade), moving on the Middle Road from Harrisville arrived on a hill overlooking Sand Ridge Road (intersection of Middle Road) and to the right and rear of Rosser's main force.  Reacting to this threat, Rosser ordered a withdrawal.  His men raced to mount their horses.  At this point, Wells brigade attacked Spiker's Hill up the Back Road, taking few casualties.  At the crest, Wells encountered Munford's brigade and a mounted mele ensued.  Rosser's force retreated, partly down Back Road to Pugh's Run, partly on Sand Ridge and Middle roads toward Woodstock.  Custer's and Kidd's troopers pursued.  General Sheridan is said to have watched the action from Round Hill, where there was a US signal station during the battle.\nPhase Four.  Fighting on the Valley Pike: In the meantime, fighting continued along the Valley Pike.  Lowell's brigade drove CS pickets back to Jordon Run and deployed on both sides of the pike.  The 1st Michigan (Kidd's brigade) supported Lowell's right flank, while Devin's brigade moved farther to the right along the Middle Road beyond St. Johns Church.  As Devin maneuvered, Lomax counterattacked down the Valley Pike, driving the Reserve brigade back to Tom's Brook.  Lowell, in turn, attacked until stopped by artillery, At last, Devin reached a position from which to operate against the flanks of both Lomax and Rosser.  He advanced the 9NY and other elements against Lomax's left and rear (probably down current rte. 657), making Lomax's position untenable.  The Confederates began to retreat up the pike toward Woodstock.\nPhase Five.  Rear Guard Action at Pugh's Run: Rosser retreated, losing at least two of his guns at Spiker's Hill.  Munford's brigade attempted a stand behind Pugh's Run on the Back Road, but this position was quickly breached.  The CS cavalry continued to retreat to Columbia Furnace, losing the rest of its artillery and all of its wagons.  Perhaps 150 CS prisoners were captured during this phase of the retreat.\nPhase Six.  Rear Guard Action at Woodstock: Lomax retreated up the Valley Pike to Woodstock, where he was joined by a confused portion of Rosser's command.  The forces attempted to stand behind Pugh's Run but were soon scattered.  Union troopers pressed forward, driving the CS cavalry to Mt. Jackson.  Lomax lost five pieces of artillery and his rolling stock during this rout--two pieces at Woodstock, two at Edinburg, and the fifth beyond Stony Creek.  The Union cavalry retired to the vicinity of Woodstock where it bivouacked for the night.", "Current Condition of the Battlefield": "\nThe focal points of action were Spiker's Hill where the Back Road crosses Tom's Brook, and the area southwest of the village of Tom's Brook along US 11 (Valley Pike) between Tom's Brook and Jordon Run.  The network of roads between US 11 and Spiker's Hill played a shaping role in the unfolding Union strategy.\nSeveral vantage points and viewsheds are essential for interpreting the battle: a) view from Round Hill where there was a US signal station at the time of the battle; b) Sand Ridge Church Hill, which allows interpretation from Custer's line and provides a panorama from Round Hill to Little North Mountain; and c) from Spiker's Hill where Rosser concentrated his command.  If viewsheds from these three points could be preserved, the battlefield could be interpreted and would retain a high degree of historic integrity and rural setting.  Many historic structures remain in the vicinity, including the Peter Muhlenburg Farm (County Alms House) at Maurertown and the Thornton house which served as a stage stop on the Back Road.  A 21-acre parcel of Lomax's position across the Valley Turnpike (US 11) has been preserved as a county recreation park.  The park offers no interpretation of the battle.", "Perception of Threats to Battlefield": "\nAlmost all of the battlefield of Tom's Brook is privately owned.  There are several immediate threats to the integrity of the above-mentioned viewsheds.  A parcel on the summit of Spiker's Hill may be subdivided; survey work has been conducted but as of this writing construction has not begun.  Construction of more houses on Spiker's Hill would degrade the viewshed's current high integrity.  The area where the Reserve brigade attempted to turn Lomax's left flank was recently threatened by possible subdivision of the Heischmann property (about 150 acres).  This property was auctioned in parcels but a local resident acquired the entire property and plans to continue farming. \nThe viewshed from Round Hill may be threatened by development adjacent to the I-81 interchange where there is currently a truck stop complex with peripheral commercial enterprises.  The interchange has spurred residential development along rte. 642, south of the truck stop.  A portion of land is currently being developed as a subdivision where the Middle Road (rte. 642) crosses Tom's Brook.  The I-81 interchange will certainly continue to stimulate further residential development in this area.\nAn L-shaped section of property south of the Truck Stop and I-81 along rte. 651 (about 250 acres) is owned by a local developer who has sought to rezone the property for industrial/commercial/business.  Initial requests for rezoning were denied because of concerns over water quality.  The impact of development of this section of land on the viewshed from Round Hill should be evaluated; the property near the intersection of rte. 651 and US 11 was part of Merritt's division bivouac area the night before the battle.\nThe strip along US 11 south of the village of Tom's Brook has been developed for a trailer court and other residential housing; a commercial/residential strip runs the rest of the way into the town of Tom's Brook.  The right flank of Lomax's line along rte. 650 is lined with trailers and houses, making interpretation difficult.  Lomax's bivouac and HQ area in the vicinity of the Peter Muhlenburg Farm (County Alms House) is managed by the county.  Efforts to preserve the rural character of the cross roads between Back Road and the Valley Pike (rtes. 653, 655, 657, and 642), which were used as routes of maneuver by the US cavalry, would enhance the battlefield setting.", "Identified Sites and Features Associated with the Battlefield": ["Back Road", "Baker's Store", "Crabill House*", "Frieden Church (site of)", "Harrisville", "Heischmann Farm", "Jordon Run", "Locke House*", "Middle Road", "Mt. Hebron Church", "Mt. Olive", "Muhlenburg Farm", "Old Mill Sites", "Old Town Tom's Brook", "Pugh's Run", "Round Hill", "Sand Ridge Road", "Sawmill Valley", "Spiker's Ridge", "St. Johns Church (site)", "St. Matthews Church Hill", "Thornton Farm (Stage Road Inn)", "Tom's Brook", "Turnpike Toll House (Maurertown)", "Valley Pike", "Woodstock Road"], "url": "http://www.nps.gov/abpp/shenandoah/svs3-14.html"}, {"Number": 5, "CWSAC": "VA105", "Battle": "Cross Keys", "Start Date": "8 June 1862", "County": [{"name": "Rockingham", "state": "VA"}], "General Location": "South of rtes. 659 and 276, crossroads of Cross Keys, including the village of Port Republic", "Size of Study/Core Areas": "5,450/2,153 acres", "GIS Integrity of Study/Core Areas": "94/94 percent; Good/Good", "Field Assessment of Study Area Integrity": "Good", "USGS Quadrants": ["Harrisonburg", "Grottoes"], "Campaign": "Jackson's Valley Campaign", "Principal Commanders": {"C": [{"rank": "Maj. Gen.", "first_name": "Thomas", "middle_name": "J.", "last_name": "Jackson"}, {"rank": "Brig. Gen.", "first_name": "Richard", "last_name": "Ewell"}, {"rank": "Brig. Gen.", "first_name": "Isaac", "last_name": "Trimble"}], "U": [{"rank": "Maj. Gen.", "first_name": "John", "middle_name": "C.", "last_name": "Fremont"}]}, "Forces Engaged": {"C": {"text": "Three of four brigades of Ewell's division (Trimble, Elzey, Steuart) and Patton's brigade, about 8,500 engaged", "strength": 8500}, "U": {"text": "Blenker's infantry division (three brigades), three attached brigades (Cluseret, Milroy, Schenck), Bayard's cavalry, and nine batteries, about 11,500 men", "strength": 11500}}, "Casualties": {"C": {"text": "287 (42k/230w/15m)", "casualties": 287, "killed": 42, "wounded": 230, "missing_captured": 15}, "U": {"text": "664 (114k/443w/127m)", "casualties": 664, "killed": 114, "wounded": 443, "missing_captured": 127}}, "Significance": "\nThe battles of Cross Keys and Port Republic were the decisive victories of Maj. Gen. Thomas J. ``Stonewall'' Jackson's 1862 Valley Campaign.  At Cross Keys, one of Jackson's divisions beat back the army of Maj. Gen. John C. Fremont approaching from Harrisonburg, while elements of a second division held back the vanguard of Brig. Gen. James Shields' division advancing toward Port Republic on the Luray Road.  During the night of 8-9 June, Jackson withdrew from in front of Fremont and at dawn attacked two of Shields's four brigades (commanded by Brig. Gen. E. B. Tyler), precipitating the battle of Port Republic.  Fremont reached the vicinity too late to aid Tyler, who was badly beaten.  With the retreat of both US armies, Jackson was freed to join the CS army commanded by General Robert E. Lee in the Seven Days' Battles against McClellan's army before Richmond.\nIn addition to its importance in Jackson's overall strategy of defeating two separated armies in detail, Cross Keys provides interesting lessons at the tactical level.  By deft maneuver and clever use of the terrain, Confederate Brig. Gen. Isaac Trimble shattered a larger US force and stalled Fremont's attack.  The ground where this tactical action occurred is pristine and enables understanding of this phase of the conflict.", "Description of the Battle": "\nPrelude: The hamlet of Port Republic lies on a neck of land between the North and South rivers at the point where they conjoin.  On 6-7 June 1862, the army of Maj. Gen. Thomas J. Jackson, numbering about 16,000, bivouacked north of Port Republic, Ewell's division along the banks of Mill Creek near Goods Mill, and Winder's division on the north bank of North River near the bridge.  One regiment (15AL) was left to block the roads at Union Church.  Jackson's headquarters were in Madison Hall, the home of Dr. Kemper, at Port Republic.  The army trains were parked nearby.\nTwo US columns converged on Jackson's position.  The army of Maj. Gen. John C. Fremont, about 15,000 strong, moved south on the Valley Pike and reached the vicinity of Harrisonburg on 6 June.  The division of General Shields, about 10,000 strong, advanced south from Front Royal in the Luray (Page) Valley, but was badly strung out because of the muddy Luray Road.  At Port Republic, Jackson possessed the last intact bridge on the North River and the fords on the South River by which Fremont and Shields could unite.  Jackson determined to check Fremont's advance at Mill Creek, while meeting Shields on the east bank of the North Fork.  A CS signal station on Massanutten monitored US progress.\nPhase One.  Skirmishing at Cross Keys Tavern: Late in the day on 7 June, Fremont's advance guard encountered Jackson's pickets near Cross Keys Tavern.  A few shots were fired and the US cavalry fell back onto their main body, which was approaching. Darkness prevented further developments.\nPhase Two.  Surprise Raid on Port Republic: Colonel Samuel Carroll at the head of a regiment of cavalry, supported by a battery and a brigade of infantry, was sent ahead by Shields to secure the North River Bridge at Port Republic.  Shortly after dawn (8 June), Carroll scattered the CS pickets, forded the South River, and dashed into Port Republic.  Jackson and his staff raced down the main street from headquarters and across the bridge, narrowly eluding capture (two members of his staff were captured).  Carroll deployed one gun aimed at the bridge and brought up another.  Jackson directed the defense, ordering Poague's battery to unlimber on the north bank.  Carrington brought up a gun from the vicinity of Madison Hall to rake the Main St.  The 37VA Infantry charged across the bridge to drive the US cavalry out of the town.  Carroll retreated in confusion, losing his two guns, before his infantry could come within range.\nThree CS batteries unlimbered on the bluffs east of Port Republic on the north bank of the South Fork and fired on the retreating Federals.  Carroll retired several miles north on the Luray Road. Jackson stationed Taliaferro's brigade in Port Republic and positioned the Stonewall Brigade near Bogota with the artillery to prevent any further surprises.\nPhase Three.  US Deployment: Meanwhile, Fremont, with Cluseret's brigade in the lead, renewed his advance from the vicinity of Harrisonburg.  After driving away the CS skirmishers, Cluseret reached and deployed his right flank along the Keezletown Road near Union Church.  One by one, the US brigades came into line: Schenck on Cluseret's right, Milroy on his left, and Stahel on the far left, his left flank near Congers Creek.  Bohlen's and Koltes' brigades were held in reserve near the center of the line.  A regiment of US cavalry moved south on the road to secure the right flank.  Batteries were brought to the front.\nPhase Four.  CS Deployment: Gen. Richard Ewell deployed his infantry division (CS) behind Mill Creek, Trimble's brigade on the right across the Port Republic Road, Elzey's in the center along the high bluffs.  Ewell concentrated his artillery (4 batteries) at the center of the line.  As US troops deployed along Keezletown Road, Trimble advanced his brigade a quarter of a mile to Victory Hill and deployed Courtenay's (Latimer's) battery on a hill to his left supported by the 21NC Regiment.  The 15AL, which had been skirmishing near Union Church, rejoined the brigade.  Trimble held his regiments out of sight behind the crest of the hill.\nPhase Five.  US Attack and Repulse: Fremont determined to advance his battle line with the evident intention of developing the CS position, assumed to be behind Mill Creek.  This maneuver required an elaborate right wheel.  Stahel's brigade on the far left had the farthest distance to cover and advanced first.  Milroy moved forward on Stahel's right and rear.  US batteries were advanced with infantry lines south of Keezletown Road and engaged CS batteries.  Stahel appeared oblivious to Trimble's advanced position.  His battle line passed down into the valley, crossed the run, and began climbing Victory Hill.  At a distance of ``sixty paces,'' Trimble's infantry stood up and delivered a devastating volley.  Stahel's brigade recoiled in confusion with heavy casualties.  The Union brigade regrouped on the height opposite Victory Hill but made no effort to renew their assault.\nPhase Six.  Trimble's Flanking Attacks: Stahel did not renew his attack but brought up a battery (Buell's) to support his position.  Trimble moved the 15AL by the right flank and up a ravine to get on the battery's left.  In the meantime, Ewell sent two regiments (13VA and 25VA) along the ridge to Trimble's right, attracting a severe fire from the US battery.  With a shout, the 15AL emerged from their ravine and began to climb the hill toward the battery, precipitating a mele.  Trimble advanced his other two regiments (16MS on left and 21GA on right) from their position on Victory Hill, forcing back the US line.  The US battery limbered hastily and withdrew, saving its guns.  A US regiment counter-attacked briefly striking the left flank of the 16MS but was forced back in desperate fighting.\nPhase Seven.  US Withdrawal to Keezletown Road: Trimble continued advancing up the ravine on the CS right, outflanking successive US positions.  In the meantime, Milroy advanced on Stahel's right supported by artillery.  Milroy's line came within rifle-musket range of the CS center behind Mill Creek and opened fire.  US batteries continued to engage CS batteries in an artillery duel.  Bohlen advanced on the far US left to stiffen Stahel's crumbling defense.  Milroy's left flank was endangered by Stahel's retreat, and Fremont ordered him to withdraw.  Jackson brought Taylor's brigade forward to support Ewell if needed, but Taylor remained in reserve on the Port Republic Road near the Dunker Church.\nPhase Eight.  US Attacks on the Right: Seemingly paralyzed by the decimation of Stahel's brigade on his left, Fremont was unable to mount a coordinated attack.  He ordered Schenck's brigade forward to find the CS left flank south of Union Church.  Ewell reinforced his left with elements of Elzey's brigade.  Severe firing erupted along the line but quickly died down.  CS brigadiers Elzey and Steuart were wounded in this exchange.  Fremont withdrew his force to Keezletown Road, placing his artillery on the heights to his rear (Oak Ridge).  Artillery firing continued.  At dusk, Trimble pushed his battle line forward to within a quarter mile of the US position, anticipating a night assault.  CS accounts describe the US soldiers going into camp, lighting fires and making coffee.  Ewell ordered Trimble to withdraw without making the attack.", "Current Condition of the Battlefield": "\nThe battlefield of Cross Keys is largely intact, and the landscape retains a marked similarity to its Civil War-era appearance.  Land use is primarily agricultural with some residential housing along the main roads.  New houses on large lots have been built along the CS defensive line behind Mill (Black Anchor) Creek.  Several historic structures in the vicinity remain: the Union Church (Ruritan Hall) and cemetery, an antebellum house adjacent to the cemetery, and the old Cross Keys Tavern behind the farm bureau co-op, an old house across from the farm bureau, and the Widow Haugh House adjacent to Lee-Jackson parcel.  The Widow Haugh House resident points out repaired damage to the roof and interior walls of the house caused by a US solid shot.\nThe Lee-Jackson Foundation owns 100 acres on Victory Hill, scene of Trimble's maneuvers and some of the most severe fighting.  The road network appears to have been altered somewhat but historic maps are not accurate enough to allow reconstruction.  The landscape is very hilly and cut with deep ravines making further assessment of small-scale features difficult without gaining access to perhaps a dozen private farms.\nThe town of Port Republic is listed in the National Register as a historic district.  The UDC has erected a small monument near the intersection of rtes. 679 and 659. Circle Tour markers were erected along rte. 276 south of rte. 659.  One small section of the original road bed of the Port Republic Road may be seen just south of Victory Hill School along rte. 659. Several old structures remain in the hamlet of Goods Mill, which played a peripheral role in the battle.", "Perception of Threats to Battlefield": "\nDevelopmental pressures from the vicinity of Harrisonburg have spread south into the vicinity of Cross Keys in recent years, although the study area has not yet been impacted.  Several large parcels of land are or will soon be for sale.  Although the market is currently soft (1991), there is some fear, according to a local landowner, that these tracts will be bought by developers and subdivided.  A county planning official stated that the dramatic growth of the City of Harrisonburg during the 1980s has slowed, thus easing developmental pressures south of the city.  The growth rate for the City of Harrisonburg is expected to stabilize for the 1990s. Several very large poultry sheds have been built in the immediate vicinity, and although these are not technically ``permanent,'' they can quickly overwhelm a viewshed if prominently placed.", "Identified Sites and Features Associated with the Battlefield": ["Black Anchor Creek and Heights", "Brick House*", "Cross Keys Battle Monument", "Cross Keys Tavern", "Keezletown Road", "Kempers or Kyle's Mill (site of*)", "Longs Hill", "Massanutten Peak", "Mill Creek", "Oak Ridge", "Port Republic", "Port Republic Road", "Trimble's Ravine", "Union Church Cemetery", "Union Church (site of)", "Victory Hill", "Widow Haugh House"], "url": "http://www.nps.gov/abpp/shenandoah/svs3-5.html"}, {"Number": 4, "CWSAC": "VA104", "Battle": "First Winchester", "Start Date": "25 May 1862", "County": [{"name": "Frederick", "state": "VA"}, {"name": "City of Winchester", "state": "VA"}], "General Location": "US forces held heights S of town, including Bower's and Camp Hill; CS forces advanced N along US 11 and along rte. 522", "Size of Study/Core Areas": "4,041/1,393 acres", "GIS Integrity of Study/Core Areas": "28/22 percent; Poor/Lost", "Field Assessment of Study Area Integrity": "Lost", "USGS Quadrants": ["Winchester"], "Campaign": "Jackson's Valley Campaign", "Principal Commanders": {"C": [{"rank": "Maj. Gen.", "first_name": "T.", "middle_name": "J.", "last_name": "Jackson"}], "U": [{"rank": "Maj. Gen.", "first_name": "Nathaniel", "last_name": "Banks"}]}, "Forces Engaged": {"C": {"text": "Jackson's division of three brigades (Winder, Campbell, Taliaferro) and Ewell's division of four brigades (Taylor, Trimble, Elzey, Scott), three regiments of cavalry, and 11 batteries (48 guns), about 16,000", "strength": 16000}, "U": {"text": "Banks's command of two brigades of infantry (Donelly, Gordon), two regiments of mixed cavalry, and three batteries (16 guns), about 6,500.", "strength": 6500}}, "Casualties": {"C": {"text": "400 (68k/329w/3m)", "casualties": 400, "killed": 68, "wounded": 329, "missing_captured": 3}, "U": {"text": "2,019 (62k/243w/1,714mc)", "casualties": 2019, "killed": 62, "wounded": 243, "missing_captured": 1714}}, "Significance": "\nFirst Winchester was a major victory in General Jackson's 1862 Valley Campaign.  On the tactical level, the battle displays considerable finesse, particularly on the part of Ewell's division on the Front Royal Pike.  Brig. Gen. Taylor's attack on Bower's Hill is considered a model brigade maneuver by military historians.  The ultimate significance of Jackson's victory at Winchester was its strategic impact.  Union plans for a convergence on Richmond were disrupted by Jackson's audacity, and thousands of Union reinforcements were diverted to the Valley and the defense of Washington.", "Description of the Battle": "\nPrelude: May 24, 1862, was a disastrous day for Maj. Gen. Nathaniel Banks.  Learning that the Confederates had taken Front Royal and were closing on Winchester, Banks ordered a hasty retreat down the Valley Pike from Strasburg.  His columns were attacked at Middletown and again at Newtown (Stephens City) by the converging forces of Maj. Gen. Thomas J. Jackson.  The Confederates took many US prisoners and captured so many wagons and stores that they later nicknamed the Union general ``Commissary Banks.'' Jackson pressed the pursuit for most of the night and allowed his exhausted soldiers but a few hours sleep before dawn.\nPhase One.  US Deployment at Winchester: Banks now deployed at Winchester to slow the CS pursuit.  He had two brigades of infantry under Donelly and Gordon, a mixed brigade of cavalry under Hatch, and 16 guns.  Gordon's brigade was placed on the US right on Bower's Hill with its left flank at the Valley Pike, supported by a battery of artillery.  The center of the line (Camp Hill) was held by the cavalry supported by two guns.  Donelly's brigade was placed in a crescent on the left to cover the Front Royal and Millwood roads with the rest of the artillery.  At earliest light the CS skirmish line advanced in force driving the US pickets back to their main line of battle.\nPhase Two.  CS Advance on Front Royal Pike: During the night, the advance of Maj. Gen. Richard Ewell's division (four brigades) reached Buffalo Lick.  At dawn, he deployed his brigades astride the Front Royal Pike and advanced against the Union left flank.  His leading regiments (in particular the 21st North Carolina) came under heavy fire from US forces deployed behind stone fences and were repulsed.  CS forces regrouped and brought up artillery.  After about an hour, they again advanced, this time sending regiments to either side of the high ground to enfilade the Union position.  Donelly (US) withdrew his brigade to a position closer to town with his right flank anchored on Camp Hill.  Trimble's brigade (CS) then attempted a flanking movement to the right beyond the Millwood Road.  This movement threatened the US left and rear.  This movement, in conjunction with Confederate maneuvers on the left beyond the Valley Pike, caused the Union line to collapse in this sector.\nPhase Three.  CS Advance on Valley Pike: In conjunction with Ewell's advance on the Front Royal Pike, Jackson advanced the Stonewall Brigade on the Valley Pike at early dawn in a heavy fog.  At Jackson's command, the brigade swept over a hill to the left of the pike, driving off the US skirmishers who held it.  Jackson quickly placed a section of artillery on the hill to engage US artillery on Bower's Hill at a range of less than half a mile.  Union sharpshooters along Abrams Creek began picking off the cannoneers.  In response, Banks moved his artillery farther to the right to enfilade the CS artillery and heavily reinforced his right flank with infantry.  Jackson brought up the rest of his artillery and a duel ensued with the Union guns on Bower's Hill.  It now appeared that the Union forces were preparing to turn the Confederate left.\nTo counter this threat, Jackson deployed Taylor's Louisiana brigade, reinforced by two regiments of Taliaferro's, to the left along Abrams Creek.  Taylor marched under fire to a position overlapping the Union right and then attacked Bower's Hill.  The Confederate assault swept irresistibly forward over the crest in the face of determined resistance.  The Union right flank collapsed, even as the left flank was being pressured by Ewell.  Union soldiers began streaming back into town.\nPhase Four.  US Retreat: With the collapse of both flanks, Union forces retreated through the streets of Winchester and north on the Valley Pike.  Confederate pursuit was lethargic, as the troops were exhausted from the non-stop marching of the previous week.  Nevertheless, many Union prisoners fell into Confederate hands.  Ashby's cavalry was disorganized from the actions of 24 May and did not pursue until Banks had already reached the Potomac River.", "Current Condition of the Battlefield": "\nThe battlefield of First Winchester has been lost as a coherent landscape to the growth of the city of Winchester.  Most of the core area has been developed for residences on Bower's Hill, along US 11, and around the intersection of I-81 and rte. 50. US Artillery positions have been built upon and vantage points lost.\nAccording to a county planning official 1,600 new residences have been approved for construction at the base of Bower's Hill along Abrams Creek.  Access to Battery Hill (Hill 819) north of Cedar Creek Grade, west of US 11 and south of railroad tracks, would offer an interesting vantage point, although access is restricted.  This site overlooks the field over which Taylor's Louisiana brigade marched to assault Bower's Hill, just south of the water tower.  This same ground was fought over during the first day's fighting at Second Winchester when this hill served as a CS artillery position.\nWillow Lawn, circa 1765, is set back from the road behind an industrial building, west of US 11 and north of the railroad.  Parkins Mill on US 11 at Abrams Creek (burned in 1864 and rebuilt after the war).  All historic structures are surrounded by modern buildings.  The Winchester Historic District protects many buildings of Civil War vintage and offers a focal point for visitors.  Beck and Grunder's ``Three Battles of Winchester'' provides a driving tour of the battlefield with stops at Camp Hill, Milltown, Williamsburg Heights, and Bower's Hill.", "Perception of Threats to Battlefield": "\nThe core area of the First Winchester battlefield has largely been lost and, according to a county planning official, 1600 additional houses are planned for this area in the immediate future.  This will eliminate the remaining core area of First Winchester and decrease the size of the remaining core area of Second Winchester. ", "Identified Sites and Features Associated with the Battlefield": ["Abram's Creek", "Abram's Delight", "Battery Hill", "Bower's Hill", "Camp Hill", "Cedar Creek Grade", "Jonathan Smith House", "Keckley Mills", "Middle Road", "Milltown", "Old Town Winchester", "Parkin's Mill", "Pritchard's Hill", "Tollgate (site of)", "Valley Pike", "Willow Lawn*"], "url": "http://www.nps.gov/abpp/shenandoah/svs3-4.html"}, {"Number": 15, "CWSAC": "VA122", "Battle": "Cedar Creek", "Start Date": "19 October 1864", "County": [{"name": "Frederick", "state": "VA"}, {"name": "Warren", "state": "VA"}, {"name": "Shenandoah", "state": "VA"}], "General Location": "\nAlong US 11, Cedar Creek to Middletown; Belle Grove is a focal point. CS march began from Fisher's Hill", "Size of Study/Core Areas": "15,607/6,252 acres", "GIS Integrity of Study/Core Areas": "89/89 percent; Good/Good", "Field Assessment of Study Area Integrity": "Fair", "USGS Quadrants": ["Tom's Brook", "Strasburg", "Mountain Falls", "Middletown"], "Campaign": "Sheridan's Valley Campaign", "Principal Commanders": {"C": [{"rank": "Lt. Gen.", "first_name": "Jubal", "middle_name": "A.", "last_name": "Early"}], "U": [{"rank": "Maj. Gen.", "first_name": "Philip", "last_name": "Sheridan"}, {"rank": "Maj. Gen.", "first_name": "Horatio", "last_name": "Wright"}]}, "Forces Engaged": {"C": {"text": "Five infantry divisions (Gordon, Wharton, Ramseur, Pegram, Kershaw), two cavalry divisions, about 15,265", "strength": 15265}, "U": {"text": "Three infantry corps (Wright, Emory, Crook), two cavalry divisions (Merritt and Custer), numbering 31,944.", "strength": 31944}}, "Casualties": {"C": {"text": "2,910 (320k/1,540w/1,050m);", "casualties": 2910, "killed": 320, "wounded": 1540, "missing_captured": 1050}, "U": {"text": "5,665 (644k/3,430w/1,591m)", "casualties": 5665, "killed": 644, "wounded": 3430, "missing_captured": 1591}}, "Significance": "\nThe battle of Cedar Creek dealt the crushing blow to the Confederacy in the Shenandoah Valley and, together with William T. Sherman's successes in the Atlanta Campaign, spurred the reelection of President Abraham Lincoln.  The battle can be ranked in size and intensity with the battle of Opequon (Third Winchester) and both are included among the major battles of the Civil War.  The Confederate surprise attack at Cedar Creek is considered one of the most daring and successful maneuvers of its kind and is studied by military theorists today.  It was a feat ``unduplicated'' during the Civil War.  General Sheridan's arrival on the field of battle to rally his broken troops passed into American verse and folklore as ``Sheridan's Ride,'' and offers a dramatic example of the effect of charismatic leadership.  Rarely have the scales of victory and disaster swung to such extremes during battle: the morning's brilliant Confederate success was transformed into a Union victory by day's end.", "Description of the Battle": "\nPhase One.  US Dispositions Behind Cedar Creek: The Union Army of the Shenandoah, about 32,000 men under Maj. Gen. Philip H. Sheridan, encamped on the heights above Cedar Creek from near Middle Marsh Brook to south of the Valley Turnpike.  On the night of October 18-19, General Sheridan was at Winchester, returning from a conference in Washington, D.C.  In his absence, Maj. Gen. Horatio Wright, commander of the VI Corps, was left in command of the army, his headquarters at Belle Grove, south of Middletown.  The army comprised three infantry corps (Wright's VI, Maj. Gen. William Emory's XIX, and Brig. Gen. George Crook's Army of West Virginia), and a cavalry corps commanded by Maj. Gen. Alfred Torbert.  The VI Corps was on the far right of the Union infantry on the hills north of Meadow Brook.  Torbert's cavalry (Brig. Gen. Wesley Merritt's Division), encamped near Nieswander's Fort.\nBrig. Gen. George A. Custer's division covered the Back Road and the Cedar Creek crossings in the vicinity of Hite's Chapel.  The XIX Corps occupied the bluffs above Cedar Creek, extending from Meadow Brook to the Valley Pike bridge.  Crook's corps and an attached ``provisional'' division under Brig. Gen. John Howard Kitching were bivouacked south and east of the Valley Pike.  The vast trains of the army were parked on level ground west of Belle Grove near the pike.  Two of the three corps erected entrenchments.  The Union left flank was considered protected by the North Fork Shenandoah River and the rough ground in front of the Massanutten and was lightly picketed by cavalry.  Other elements of US cavalry covered Buckton Ford and the roads from Front Royal.\nPhase Two.  CS Approach and Preparations for Battle: On 17 October 1864, Maj. Gen. John Gordon and topographical engineer Jedediah Hotchkiss climbed to Signal Knob on the Massanutten to survey the Union position behind Cedar Creek.  While there, they formulated a daring plan to turn the Union left flank, which Lt. Gen. Jubal A. Early approved.  After dark on 18 October, the plan was set in motion.  Gordon's, Ramseur's, and Pegram's divisions, (Second Corps, Army of Northern Virginia) under overall command of Gordon, marched from their entrenchments and crossed the North Fork east of Fisher's Hill.  They followed a narrow path along the face of the Massanutten, often in single file, and along the Manassas Gap railroad to a spot opposite McInturff's and Colonel Bowman's fords.  After surprising and capturing the pickets, the divisions recrossed the North Fork, passing north on a farm lane, past Col. Bowman's House ``Long Meadow,'' to the vicinity of the Cooley House, where they faced to the left to form a line of battle beyond the left flank of Crook's corps.  Gordon's column was in position by 0400 hours.\nIn the meantime, Kershaw's and Wharton's divisions accompanied by the army's artillery, advanced down the pike, by Spangler's Mill and through Strasburg.  Kershaw's column, accompanied by Gen. Early, diverged to the right on the road to Bowman's Mill Ford, where it prepared for the dawn attack.  Wharton continued on the pike past the George Hupp House to Hupp's Hill, where he deployed.  The CS artillery massed on the Valley Pike south of Strasburg to await developments at the front.  In conjunction with these maneuvers, Brig. Gen. Thomas Rosser's cavalry division advanced on the Back Road to Cupp's Ford. Brig. Gen. Lunsford Lomax's cavalry division was ordered to advance on the Front Royal-Winchester Road and then cross over to the Valley Pike in the vicinity of Newtown (Stephens City).  Lomax did not advance as directed.\nPhase Three.  Surprise Attack on US Left Flank: Before dawn a heavy fog descended on the area.  At precisely 0500, Kershaw's division fired a thunderous volley and rushed the entrenchments of Thoburn's division (Crook), overrunning them.  Gordon's force began to advance and a few minutes later smashed into Brig. Gen. Rutherford B. Hayes' division (Crook) and Kitching's provisional division.  Hayes' veterans attempted a stand which soon evaporated as Confederates closed in on both flanks of the disorganized units.  Union soldiers, surprised in their camps, streamed rearward.  At the sound of firing, Wharton's division advanced to the creek and deployed, awaiting further developments.  The CS artillery raced to the front and opened fire on the XIX Corps from the heights overlooking Cedar Creek.  A detachment of CS cavalry with Gordon attempted to reach Belle Grove, where they expected to capture Sheridan.\nBy 0530, mobs of stragglers from Crook's and Kitching's commands streamed west across the Valley Pike, confirming the scope of the disaster.  Emory withdrew the units that covered the turnpike bridge and attempted to form a defensive line parallel with the pike.  As he did so, Wharton's division crossed Cedar Creek at Stickley's Mill and rushed the heights, capturing 7 guns.  Only desperate action enabled the rest of the US artillery to escape.  Colonel Thomas Wilde's brigade (Crook's corps) went into line just east of the pike to contest the CS attack.  General Wright directed their advance personally and was painfully wounded in the chin.  A second US brigade under Col. Stephen Thomas (XIX Corps) advanced to high ground about 200 yards east of the pike and fired volley after volley into the fog, suffering heavy casualties.  The stand of these brigades bought time for the Union trains parked near Belle Grove to escape to the north.  The advanced US units were steadily driven back to Belle Grove.  Crook's corps and Kitching's command were shattered and out of the fighting for the rest of the day.\nPhase Four.  VI Corps and XIX Corps Resistance: The VI Corps deployed to meet the approaching assault.  While elements of the XIX Corps reorganized on Red Hill, Ricketts's Division (VI Corps) formed a line of battle anchored on Cedar Creek and fought an isolated battle against Kershaw's division which furiously attacked their line.  Wheaton's Division (VI Corps) advanced to high ground in the fields north of Belle Grove Mansion, where they were assaulted by Gordon.  The fog burned off and for the first time the opposing forces could see one another clearly.  CS batteries were brought to bear against the US line.  Kershaw assaulted repeatedly but was repulsed.  Gradually, all US forces in the area withdrew and retreated northeast along Middle Marsh Brook.\nPhase Five.  Getty's Defense of Cemetery Hill: While fighting raged to his right, Maj. Gen. George Getty maneuvered his division (VI Corps) toward Middletown, seeking to extend the Union line to cover the Valley Pike.  When US forces on the right began to withdraw, however, Getty established a defensive salient on Cemetery Hill, supported by artillery.  General Early concentrated against Getty's position, launching disjointed attacks with elements of four different divisions which were successively repulsed with heavy casualties in the area near the Sperry House and the Ridings House.  The CS artillery massed along the Valley Pike and concentrated a deadly fire on Cemetery Hill.  After about an hour, Getty withdrew to join the rest of the army which was rallying, first along the Old Forge Road and then in a salient across the Valley Pike.  Getty's stand broke the momentum of the CS assaults and enabled other US units to withdraw north of the cemetery to regroup.\nIn the meantime, Custer's division, after throwing back Rosser's feeble attempt to gain the US rear, joined Merritt on the far left of the Union line, east of the pike and north of Middletown.\nThis concentration of cavalry threatened Early's right flank and forced him to redeploy heavy force in this area.\nPhase Six.  Sheridan Arrives/ US Army Regroups: About 1030, Sheridan arrived on the field after riding from Winchester.\nHe established his command post near the Valley Pike (vicinity of the Dinges Farm) and began to reorganize his forces.  The VI Corps was deployed on the left, adjacent to the Valley Pike, with the XIX Corps on the right.  Crook's disorganized command was placed in reserve along the pike.  In a dramatic moment, Sheridan rode along the front of the reestablished battle line.  The men responded with a tremendous cheer.  As skirmishing continued, Sheridan placed a cavalry division on each of his flanks, Merritt on the left and Custer on the right.  About 1500, he prepared to launch a counterattack.\nPhase Seven.  CS Line Advances to Miller's Mill Road: After the US withdrawal from Cemetery Hill, Early advanced to occupy the hill and called a halt to regroup.  He placed his divisions in a line about two and a half miles long, just north of Middletown, and pushed Ramseur and Kershaw forward to Miller's Mill Road.  The CS divisions from left to right were: Gordon, Kershaw, Ramseur, Pegram, Wharton.  As the afternoon wore on, skirmishing continued and several probes were made of the newly reestablished US line, but no serious fighting developed.  Early appeared convinced that he had won the battle and that US forces would retreat after dark.\nPhase Eight.  Cavalry Maneuvers/Collapse of CS Left: About 1500 hours, Merritt advanced on the Union left, putting pressure on the CS right flank north of Middletown.  Heavy US skirmish lines forced CS skirmishers back on their main line along the Miller's Mill Road and west.  Custer maneuvered into position on the US right flank, confronting Gordon's men near Middle Marsh Brook.  About 1530 Custer's division of cavalry and elements of the XIX Corps advanced against the CS left flank (Gordon and Kershaw), which was hanging in the air.  Custer continued extending west beyond Middle Marsh Brook, thinning the CS line.  He then launched a powerful attack that overran and scattered Gordon's division.  The Confederate line now began to unravel from west to east, putting additional pressure on Ramseur's command at the center.\nPhase Nine.  Union Counterattack: At 1600 Sheridan ordered a general advance which led to fierce fighting along the front.  Ramseur's division at the Confederate center near Miller's Mill bore the brunt of the attacks and repulsed several, in spite of the withdrawal of Kershaw and Gordon on his left.  Fighting raged around the D. J. Miller House and mill until Ramseur fell mortally wounded.  Then CS resistance in this area began to collapse.  CS forces along the pike retreated hastily, although in fairly good order, up the Valley Pike toward the Union camps they had captured in the morning.  Delaying actions fought by artillery and infantry units kept pursuing Union forces at bay.  Merritt pressed forward with his division, pursuing closely as Confederates retreated across Cedar Creek.\nPhase Ten.  CS Retreat to Fisher's Hill: Custer's division advanced south along Middle Marsh Brook, gaining the rear of the Confederate army.  As the CS rout continued, Custer crossed Cedar Creek at Hottel's Mill Ford and joined Merritt's division on Hupp's Hill at dusk about 1830.  The cavalry advanced, pursuing the Confederates back along the Valley Pike.  The bridge near Spangler's Mill collapsed causing Early to lose most of his artillery and many wagons.  The cavalry pursuit continued after dark, ending at Fisher's Hill.  The US cavalry captured 43 cannons, more than 200 wagons, and many prisoners.  The Confederates lost at least ten battle flags, which symbolized the progressive disintegration of the army.", "Current Condition of the Battlefield": "\nIn spite of the damage wrought by interstate highway construction, encroaching development in the vicinity of Middletown, and a large-scale quarry along Middle Marsh Brook, the integrity of Cedar Creek battlefield is high.  The battlefield core is very large, extending from Hupp's Hill to rte. 633 north of Middletown, and from the North Fork Shenandoah to Middle Marsh Brook.  The study area encompasses the initial Confederate position at Fisher's Hill.\nBeginning with surviving entrenchments on Fisher's Hill, the line of Gordon's flank march can be traced along the base of Massanutten through a pristine natural landscape.  The fords where Confederate infantry crossed the North Fork can be located and waded.  The Col. Bowman and Cooley houses, which figured prominently in the Confederate deployment, are there and in good condition.  Union entrenchments remain on Hupp's Hill and along Cedar Creek.  Belle Grove (Sheridan's headquarters) is preserved by the National Trust.  Two hundred-fifty-eight acres of the surrounding fields are held by the National Trust and the Cedar Creek Battlefield Foundation (CCBF).  An additional 100 acres adjacent to Cedar Creek in the vicinity of Bowman's Fort has recently been donated to the National Trust/CCBF.  Cedar Creek Battlefield is registered as a National Historic Landmark. The acreage included within the landmark boundaries fairly accurately reflects the size of the battlefield's core area.  The CCBF is currently raising funds to renovate the historic Heater House.\nThe view from Getty's position on Cemetery Hill remains scenic in spite of new townhouse construction at the base of the hill.  The Historic District of Middletown is a contributing resource.  The D. J. Miller House and the McDaniel House, where Ramseur was mortally wounded, stand.  Undisturbed fields to the north and east witnessed the counterattack directed by Sheridan late in the day, although new construction has begun that may impact upon this area.  These and related parcels allow in-depth interpretation of the battle.", "Perception of Threats to the Battlefield": "\nIn recent years, the pace of subdivision and new construction in the area has stepped up.  An industrial/business park was built along US 11 south of Middletown (ironically, on the very ground labelled ``Cedar Creek Battlefield'' on the USGS quadrant).  This industrial park currently consists of three large, but low- profile buildings, south of the Victorian house called Montvue.  On this crest Confederate artillery massed against Cemetery Hill and General Early established his command post, during the battle.  These buildings are visible from many parts of the battlefield.  Construction northeast of Belle Grove along rte. 624 would tend to degrade the viewshed of the land preserved by the National Trust and CCBF.  A modern house is currently under construction in this area.\nThe area between Cemetery Hill and Old Town Middletown has filled in with townhouses and apartments in the past few years.  Residential development has also occurred and continues adjacent to the I-81 interchange (#77).  New construction of several large homes on 3-5 acre lots began in early 1991 and is ongoing south of rte. 634 and west of the Miller-McDaniel Farm (ground has being recontoured).  This area saw severe fighting in later phases of the battle.  Of all residential construction, this new development is potentially the most damaging to battlefield integrity, because it establishes a foothold in the rural landscape west of town.  Other construction has been more or less associated with the existing town.  Lord Fairfax College and the new elementary school were built north of town, along US 11, on ground separating the two final battle lines of the armies and fought over by Wesley Merritt's cavalrymen and Gabriel Wharton's, John Pegram's, and William Wofford's infantrymen.\nThe quarries along Cedar Creek and Middle Marsh Brook are large- scale operations that are gradually working northeast along the valley.  It appears that the quarry company owns land all the way to rte. 627 and possibly beyond.  If continued north another half mile, this quarrying will eradicate the ruins of 18th-century Nieswander's Fort, site of Merritt's bivouac and George A. Custer's decisive flanking attack against John B. Gordon. The quarry works are visually intrusive from various parts of the battlefield.\nThe battlefield south of the junction of interstate highways I-66 and I-81 does not seem immediately in jeopardy because there is no interchange and access to the area is restricted to four county roads.  This block of land retains very high rural/historic integrity and contains the Colonel Bowman and Cooley houses.", "Identified Sites and Features Associated with the Battlefield": ["8th Vermont Monument", "19th Corps Entrenchments", "128th New York Monument", "Belle Grove", "Bowman's Fort", "Bowman's Mill (site of)", "Bowman's Mill Ford", "Buckton Ford", "Cedar Creek", "Cedar Creek Crossing", "Clover House at Mine Bank Ford*", "Col. Bowman's Ford", "Collapsed Bridge Site", "Cooley House", "Crook's Entrenchments (traces)", "Cupp's Ford", "Wm. Dinges Farm*", "Entrenchments", "Fisher's Hill", "Fisher's Mill*", "G. A. Hupp House (site of*)", "George Hupp House", "Heater House", "Hottel's Mill (site of*)", "Hupp's Ford", "Hupp's Hill", "Long Meadow (Col. Bowman House)", "Lowell Monument", "Manassas Gap Railroad", "McInturff House (ruin)", "McInturff's Ford", "Meadow Brook", "Middle Marsh Brook", "Middletown Cemetery", "Miller House", "Miller's Mill (ruin)", "Miller-Kendricks Structures", "Nieswander's Fort", "North Fork Shenandoah River", "Old Front Royal Road", "Old Town Strasburg", "Old Town Middletown", "Ramseur Monument", "Red Hill", "Signal Knob", "Fort Banks (site of)", "Spangler's Mill", "Sperry House (site of*)", "Stickley House", "Stickley's Mill (ruin)", "Stone Bridge (ruin)", "Stone House", "Sunnyside", "Thoburn's Redoubt", "Valley Turnpike", "Walton House", "Widow Funkhouser House (site of)"], "url": "http://www.nps.gov/abpp/shenandoah/svs3-15.html"}, {"Number": 8, "CWSAC": "VA110", "Battle": "New Market", "Start Date": "15 May 1864", "County": [{"name": "Shenandoah", "state": "VA"}], "General Location": "\nVicinity of town of New Market, near intersection of I-81 and rte. 211. Battle lines extended from Shenandoah on west to Smith Creek on east.  Action extended from Shirley's Hill in the south to Rude's Hill in the north", "Size of Study/Core Areas": "5,611/2,261 acres", "GIS Integrity of Study/Core Areas": "74/67 percent; Fair/Fair", "Field Assessment of Study Area Integrity": "Poor", "USGS Quadrants": ["New Market"], "Campaign": "Lynchburg Campaign (Sigel)", "Principal Commanders": {"C": [{"rank": "Maj. Gen.", "first_name": "John", "middle_name": "C.", "last_name": "Breckinridge"}], "U": [{"rank": "Maj. Gen.", "first_name": "Franz", "last_name": "Sigel"}]}, "Forces Engaged": {"C": {"text": "Two infantry brigades (Echols and Wharton), VMI cadet battalion, Imboden's cavalry brigade, and several batteries, totaling about 5,335, 4,087 of which were engaged\"", "strength": 5335}, "U": {"text": "\nOne infantry division under Sullivan (two brigades: Moor and Thoburn), cavalry division under Stahel (two brigades: Tibbits and Wynkoop), and five batteries of artillery, totaling 8,940 of which 6,275 were engaged", "strength": 8940}}, "Casualties": {"C": {"text": "540 (50k/480w/10m)", "casualties": 540, "killed": 50, "wounded": 480, "missing_captured": 10}, "U": {"text": "841 (96k/520w/225m)", "casualties": 841, "killed": 96, "wounded": 520, "missing_captured": 225}}, "Significance": "\nAs part of his 1864 spring offensive, Lt. Gen. Ulysses S. Grant ordered Maj. Gen. Franz Sigel to advance south along the Valley Pike to destroy the railroad at Staunton and then to move on the rail complex at Lynchburg.  Although outnumbered, Maj. Gen. John C. Breckinridge, former senator and vice president of the US, was able to concentrate scattered CS forces to meet Sigel's army near New Market.  Sigel was decisively defeated on 15 May 1864, and the Valley remained in Confederate hands until Maj. Gen. David Hunter renewed the US offensive on 26 May.  The battle of New Market is noted for the participation of a battalion of VMI cadets, who distinguished themselves in combat beside veteran troops.", "Description of the Battle": "\nPhase One.  Cavalry Actions: On 14 May 1864, Union cavalry under Quinn (mainly 1st NY Cav Lincoln) advanced south on the Valley Pike from Mt. Jackson, driving CS cavalry (18VA) under Imboden across Meem's Bottom and beyond Rude's Hill, where defense stiffened.  Reinforced by a brigade of infantry under Moor, and Wynkoop's cavalry brigade, US forces again advanced with Imboden withdrawing to New Market.  CS cavalry, fighting dismounted supported Imboden and established a line south of New Market behind Shirley's Hill.  The CS line stretched thinly from Shirley's Hill to Smith Creek.  Federals continued to advance, launching two attacks about 2000 and 2200 hours, both of which were repulsed.  After dark, Imboden withdrew farther to the south, after successfully retarding Sigel's advance.\nPhase Two.  CS Advance: After midnight, Breckinridge brought most of his command north along the Valley Pike from near Lacey Spring.  By 0600 hours, 15 May, Breckinridge reached the Shenandoah County line.  He halted near here to reconnoiter and about 0800 hours sent his cavalry and artillery forward to harass the US force under Moor at New Market.  CS artillery unlimbered and fired from Shirley's Hill.  Moor established his line along the old River Road with artillery on Manor's Hill and in St. Matthews (currently the Lutheran) cemetery.  The rest of Sigel's infantry was spread out along the pike as far north as Edinburg.  Brig. Gen. Julius Stahel arrived about 0830 and ordered Moor to withdraw some of his troops to Bushong's Hill.  While Breckinridge waited on the rest of his infantry to reach the field, US guns at the cemetery and CS guns on Shirley's Hill exchanged fire.\nPhase Three.  US Deployment/ Initial CS Attacks: About 1100 hours, Sigel arrived on the battlefield and established temporary headquarters at the Rice House.  After reviewing Moor's dispositions he ordered his line withdrawn to a stronger position on Bushong's Hill, stretching between a bend in the North Fork and Smith's Creek.  Sigel brought up 14 guns to support his position, leaving DuPont's battery at Rude's Hill awaiting orders.  He placed cavalry on his left flank between the Valley Pike and Smith's Creek.  Breckinridge deployed on both sides of the Pike and advanced his infantry in force, driving back US skirmishers.  Imboden crossed Smith's Creek with his cavalry and attempted to outflank Sigel by moving north along the east bank.  By 1230, Sigel had withdrawn entirely from the town of New Market.  The 18CT and 123OH resisted the CS advance on Manor's Hill before joining the main battle line at Bushong's.\nPhase Four.  Bushong's Hill: About 1400 hours, Breckinridge launched an all-out assault against the US position on Bushong's Hill, using the 26VA, 30VA, 51VA, and 62VA.  The 62nd Virginia suffered more than 50 percent casualties.  When the CS attack stalled under heavy small arms and artillery fire, the VMI battalion was ordered to fill the gap in the line near the Bushong House.  About 1445 hours, the US cavalry under Stahel attacked up the Valley Pike, riding into massed artillery which Breckinridge had shifted east from Shirley's Hill.  Stahel was repulsed with heavy casualties.  About 1500 hours, Sigel directed a confused counterattack, which was soon repulsed.  CS sharpshooters began picking off Union gunners on Bushong's Hill north of the farm, and Sigel ordered the batteries withdrawn.  When the artillery fire slackened, Breckinridge ordered a general advance and swept the Union line off Bushong's Hill.  In this assault, the VMI cadets captured a gun and many men of the 34MA.  To the east near the Valley Pike, elements of the 34MA and 54PA continued to resist, covering the Union retreat.  These regiments were eventually driven back, and the Union forces began a general retreat.\nPhase Five.  Rear Guard Actions: On his own initiative, Capt. Henry DuPont (US) brought up his battery to cover the retreat.  He unlimbered first near the Harshburger House, then withdrew his pieces rearward en echelon as the Confederates advanced.  Sigel fell back to his supports at the Cedar Grove Dunker Church and cemetery and organized a holding action, while his confused troops reorganized.  DuPont's artillery continued to slow the pursuit.  About 1630 hours, Breckinridge ordered a halt to regroup confronting the US line at Cedar Grove Church.  Imboden's cavalry returned from their fruitless effort to get in rear of Sigel's army to burn the Meem's Bottom Bridge across the North Fork (the creeks were swollen with rainfall).  An artillery duel continued until about 1700 hours.  Breckinridge was unable to organize another attack and, by 1900 hours, the Union army escaped across the North Fork and burned the bridge.  Sigel retreated down the Valley Pike rapidly, leaving his badly wounded at Mt. Jackson.  He arrived at Strasburg on the following day.", "Current Condition of the Battlefield": "\nThe Virginia Military Institute owns battlefield land and operates a museum and visitor center.  New Market is one of two Valley battlefields that currently has facilities for visitors, the other being Cedar Creek.\n# The New Market Battlefield Historical Park was established by VMI # in 1967.  The Hall of Valor was constructed on the battlefield # and opened in 1970.  The park contains about 280 acres: 24 acres # of Shirley's Hill (recently acquired), about 40 acres east of I- # 81 around the Pennsylvania monument, and about 215 acres at the # Hall of Valor parcel adjacent to the steep bluffs overlooking the # North Fork Shenandoah River.  The park protects and preserves # about ten percent of the core area of the New Market battlefield, # but this includes several areas of the most severe infantry # fighting.  The cavalry field, east of US 11 to Smith's Creek, # remains farmland.  The village of New Market is listed in the # National Register as a historic district.\n# In spite a degree of the protection afforded by the battlefield # park, the field survey integrity of the battlefield was rated # low, due to the fragmented nature of the park and the prominent # positioning of I-81, which is the most obtrusive feature.  I-81 # bisects the battlefield and battlefield park, and interchange 67 # of I-81 empties at the base of Manor's and Shirley's Hill.  The # park is limited in its ability to interpret its separate parcels # at Shirley's Hill, Bushong's Hill, and at the Pennsylvania # monument.\n# Two monuments were erected by veterans on the New Market # battlefield and these are contained within the VMI battlefield # park.  The Missouri (Woodson) monument near the Bushong House # commemorates the role of Co. A, 1st Missouri cavalry that fought # in the battle.  The second monument commemorates the role of the # 54th Regiment Pennsylvania infantry, located directly east of # Bushong's Hill but separated from the main park by I-81.\n# North on US 11 between New Market and the Pennsylvania Monument # parcel there is light commercial and residential development, # although this strip development is less dense than that south of # town.  New construction has occurred on Manor's Hill on ground # associated with the opening phases of the battle along the access # road to the battlefield park (rte. 619) north of rte. 211.  This # includes a large Day's Inn Motel and the New Market Battlefield # Military Museum.  The exhibits of the Military Museum cover all # American wars with special emphasis on the Civil War.  Monuments # on the grounds were erected by the museum.\n# The vicinity of Rude's Hill, Meem's Bottom, Mt. Airy, and the # Cedar Grove Church is prime agricultural land that preserves the # rural-historic integrity of this area.  Meem's Bottom and Rude's # Hill were the scene of many armed encounters during the war # because these features formed a ``choke point'' on the Valley # Turnpike.  Confederate cavalry defended the North Fork Shenandoah # River crossing and used Rude's Hill as an observation post.  The # well preserved estate, Mt. Airy, served as a way station for # Confederate staff officers and partisans, including Henry Kyd # Douglas and Harry Gilmor.  Although not included directly in the # battlefield study area, Meem's Bottom and Mt. Airy should be # considered supporting resources.", "Perception of Threats to Battlefield": "\nThe battlefield park is divided into at least four separate parcels.  The I-81 interchange has spawned a commercial strip that physically and visually separates the northern and southern portions of the main field of action.  The interstate itself divides the battlefield east and west.  The view from Shirley's Hill to the Lutheran (St. Matthews) Cemetery looks directly over a commercial strip and the large signs that are typical along interstates.  A large motel complex has been constructed between St. Matthews Cemetery and the interstate highway.  Two parcels of land at the base of Shirley's Hill along rte. 211 (about 5 acres) are zoned commercial.  New construction at these sites would further degrade the important view from Shirley's Hill.  New residential construction north of town along US 11 in the vicinity of the Pennsylvania momument has continued the process of fragmentation.", "Identified Sites and Features Associated with the Battlefield": ["54th PA Monument", "Bushong Farm and Orchard", "Bushong's Mill (site of)", "Cedar Grove Church and Cemetery", "Harper-Rice House (site of*)", "Harshburger House (site of*)", "Indian Hollow", "J. B. Strayer House (site of*)", "Manor's Hill", "Meem's Bottom", "Mt. Airy", "Neff's Mill (mill race)", "North Fork Bridge Site", "Old Church Road", "Old Town New Market", "Rice House", "Rude House", "Rude's Hill", "Shirley's Hill", "Sigel's Hill", "Smith Creek Crossing", "St. Matthews Church (site of)", "St. Matthews Cemetery", "Valley Pike", "Williamson's Hill", "Woodson Monument", "Zirkle's Mill (site of*)"], "url": "http://www.nps.gov/abpp/shenandoah/svs3-8.html"}, {"Number": 12, "CWSAC": "VA119", "Battle": "Opequon", "Start Date": "19 September 1864", "County": [{"name": "Frederick", "state": "VA"}, {"name": "City of Winchester", "state": "VA"}], "General Location": "\nArea east of Winchester from I-81 along Berryville Pike (VA 7) to Opequon Creek.  Also combat north of Red Bud Run W to US11. Stephenson's Depot. Star Fort. Collier Redoubt.", "Size of Study/Core Areas": "11,670/4,914 acres", "GIS Integrity of Study/Core Areas": "54/47 percent; Fair/Poor", "Field Assessment of Study Area Integrity": "Poor", "USGS Quadrants": ["Winchester", "Stephenson"], "Campaign": "Sheridan's Valley Campaign", "Principal Commanders": {"C": [{"rank": "Lt. Gen.", "first_name": "Jubal", "last_name": "Early"}], "U": [{"rank": "Maj. Gen.", "first_name": "Philip", "last_name": "Sheridan"}]}, "Forces Engaged": {"C": {"text": "Four divisions (Gordon, Rodes, Ramseur, Breckinridge/Wharton), two cavalry divisions (Fitz Lee, Lomax), about 15,200", "strength": 15200}, "U": {"text": "Three infantry corps (Wright, Emory, Crook), cavalry corps (Torbert), about 39,236.", "strength": 39236}}, "Casualties": {"C": {"text": "3,611 (226k/1,567w/1,818mc)", "casualties": 3611, "killed": 226, "wounded": 1567, "missing_captured": 1818}, "U": {"text": "5,018 (697k/3,983w/338m)", "casualties": 5018, "killed": 697, "wounded": 3983, "missing_captured": 338}}, "Significance": "\nOpequon or Third Winchester (fought 19 September 1864) was the largest and most desperately contested battle of the Civil War in the Shenandoah Valley, resulting in more than 9,000 casualties.  The battle was a turning point of the war in the Valley, marking the rise of Sheridan and the decline of Confederate power.  Sheridan defeated the Confederate army again three days later at Fisher's Hill (22 September), forcing it to retreat up the Valley to near Waynesboro.  The CS army of Lt. Gen. Jubal A. Early suffered about 23 percent casualties.  Casualties for the larger Union army under Maj. Gen. Philip Sheridan exceeded 5,000, nearly 20 percent.  The Union XIX Corps sustained 40 percent casualties (2,074 men) and lost every regimental commander during its assaults on the Middle Field and Second Woods.  The most severe fighting and casualties occurred in the large parcel east of I-81, north of rte. 7, west of rte. 656, and south of rte. 661.  The Middle Field ranks with some of the most sanguinary fields of the Civil War, witnessing more than 3,000 casualties.  CS general Robert E. Rodes and US general D. A. Russell were both killed within a few hundred yards of the Dinkle Barn site at the entrance to Winchester Mall.", "Description of the Battle": "\nPhase One.  US Advance (19 September): Maj. Gen. Philip Sheridan's army advanced from the vicinity of Berryville on the Winchester-Berryville Pike about 0200 hours, 19 September 1864.  At earliest light, Brig. Gen. James Wilson's cavalry division crossed the Opequon at Spout Spring and advanced through a defile known as Berryville Canyon, followed by the US infantry (VI Corps, XIX Corps, and Crook's corps).  At the canyon's mouth the cavalry met the first elements of Maj. Gen. Stephen Ramseur's CS division and drove them back on their supports.  Johnston's brigade deployed across the pike and held back the Union advance, while the rest of the division came into line to cover the Berryville Pike and Senseny Road farther to the south.  The US cavalry launched several mounted and dismounted charges, driving the CS infantry back about 150 yards to the vicinity of the Dinkle Barn.  Here Ramseur stiffened his defense with artillery, and the US cavalry withdrew as its infantry began to deploy.  Wilson's division moved to cover the US left flank where it remained for the rest of the battle.\nPhase Two.  Cavalry Action: About 0200 hours Brig. Gen. Wesley Merritt's cavalry division of three brigades (Custer, Devin, Lowell) advanced toward Seiver's and Locke's fords from the vicinity of Berryville.  Their crossings were resisted by Brig. Gen. John McCausland's cavalry brigade dismounted behind barricades.  The Reserve brigade (Lowell) pushed across at Seiver's Ford against fitful opposition.  Custer's brigade met heavier resistance at Locke's Ford and made several mounted charges before securing a foothold on the western bank.  By 0800 hours both wings were across the creek, but the cavalry did not advance for several hours.  About 1030 hours, McCausland's skirmishers withdrew, and Merritt's division moved cautiously forward.  Waiting for them was Wharton's infantry division about a mile west of the fords, deployed across the roads in woods and behind stone fences.  About 1100 hours, the US cavalry began testing the CS defenses with skirmishers and artillery.  Custer launched one mounted attack but was quickly repulsed.  About noon, Sheridan's main infantry attack was underway, and Wharton's division withdrew to cover the CS left flank on the Valley Pike north of Winchester.  Merritt continued forward along Charles Town Road.  Custer followed the line of the Winchester & Potomac Railroad.  About 1400 hours Merritt's division converged with Averell's cavalry division on the Valley Pike near Stephenson's Depot.  (See phase seven.)\nPhase Three.  Deployment of US Infantry: In the meantime, the Union infantry bogged down in the narrow confines of Berryville Canyon, dashing Sheridan's hopes of quickly taking Winchester and defeating the CS army in detail.  Maj. Gen. Horatio Wright's VI Corps of three divisions (Getty, Ricketts, Russell) emerged from the canyon in order.  Getty's division deployed south of the pike with its left flank resting on Abrams Creek.  Ricketts' division formed north of the pike on Getty's right and extending to Redbud Run.  Russell's division was held in reserve.  The XIX Corps of two divisions (Dwight and Grover) did not begin crossing until after 0900 hours and eventually deployed north of the pike into the First Woods, connecting with Ricketts' right.  Sheridan established his headquarters near the Berryville Pike, probably south of the road on the Eversole Farm.\nAs the US infantry deployed, the CS batteries opened a furious fire from behind the Dinkle Barn.  Union batteries swung into action on both sides of the pike to engage the CS guns.\nIn the meantime, Lt. Gen. Jubal Early concentrated his scattered divisions.  Rodes' division, marching from near Stephenson's Depot, deployed to the left and rear of Ramseur's division in the West Woods.  Gordon's division extended the line across the Hackwood Farm to Redbud Run.  Wharton's infantry and Fitz Lee's cavalry division drew a line across the Valley Pike north of town near Stephenson's Depot.  CS batteries deployed on high ground along Baker Lane north and south of the West Woods, and north of Redbud Run.  Skirmishing continued along Ramseur's front.\nPhase Four.  Fighting in Middle Field: At 1140 hours, a US signal gun boomed and Grover's division of four brigades (Birge, Molineux, Sharpe, and Shunk) launched its attack from the First Woods across Middle Field toward the Second Woods behind which Gordon's division waited.  CS horse artillery north of Redbud Run played havoc with the flanks of Grover's attacking line.  Birge's brigade reached the woods, driving back skirmishers, but then came up against Gordon's main line and were staggered.  Sharpe's brigade came up on Birge's left, and the fighting became desperate.  The Confederate line broke, falling back across the Hackwood property.  Seven CS cannon in the Hackwood Lane fired canister pointblank into the US attackers, throwing them back.  Gordon now launched a counterattack with two brigades, driving Birge and Sharpe out of the Second Woods and back across Middle Field.  Grover ordered Molineux to advance and plug the gap that had opened between Birge and Sharpe.  The firing was so intense that Molineux's flanks seemed to ``melt away.'' Shunk's brigade was thrown forward to bolster the wavering Union line, coming in on Molineux's right rear.  Shunk closed to within sixty yards of the CS line in the Second Woods.  The two lines delivered pointblank volleys into each others' ranks.  Gordon again counterattacked, and the Union attack collapsed.  The wreckage of Grover's division went streaming back across the Middle Field to the safety of the First Woods.  The CS horse battery (Breathed) north of Redbud Run again worked execution among the retreating division.  Every regimental commander in Grover's division was killed or wounded; casualties totaled nearly 1,500.  Beal's brigade of Dwight's division deployed in the treeline at the east end of the Middle Field and advanced into ``that basin of Hell'' to stem the retreat.  Gordon's men waiting along the treeline of the Second Woods laid down a murderous fire.  The Union brigade did not reach within 200 yards of the Second Woods before being pinned down.  They expended all of their ammunition before retreating back to the First Woods.  The 114th New York suffered casualties of 60 percent (188 of 350 effectives).  McMillan's brigade, personally directed by Corps commander Maj. Gen. William Emory, advanced.  They reached a shallow ravine about 200 yards from the Second Woods, where two regiments (8VT and 12CT) clung on for nearly two hours.  By 1300 hours, the main thrust of the XIX Corps attack was blunted and its ranks decimated.  By 1400 hours, firing on this end of the field sputtered out from sheer exhaustion.\nPhase Five.  Fighting Near Dinkle Barn: At 1140 in conjunction with the XIX Corps' advance on the right, Getty's and Ricketts's divisions of the VI Corps launched their attack against Ramseur's line, which was positioned on high ground, stretching from the Dinkle Barn south behind Abrams Creek.  Ricketts' division on the right was ordered to guide its attack on the Berryville Pike, which takes a sharp jog to the left in front of the Dinkle Barn.  As they advanced, a gap widened between the VI Corps and the XIX Corps on the far right.  Keifer's and Emerson's brigades ruptured the Confederate center at the Dinkle Barn and moved to capture a battery of artillery in front of the West Woods.  Ramseur's left flank now gave way and Confederates began to drift back toward Winchester.\nPhase Six.  Rodes's Counterattack: Just as Ramseur's left flank gave way from the Union attacks, Maj. Gen. Robert E. Rodes brought his division forward from its protected position in the West Woods.  About 1330 he launched a devastating counterattack into the gap that had opened between the VI and XIX Corps.  Battle's Alabama brigade ``came out of the woods like a whirlwind,'' crushing Ricketts's division, which formed the right flank of the VI Corps.  About this time, General Rodes was killed by shrapnel.  He fell somewhere along the woods line.  Union soldiers streamed back along the Berryville Pike, while two US batteries astride the pike tried to slow the CS assault.  From his command post on Eversole's Hill, Sheridan and Wright witnessed the disaster.  Sheridan immediately committed his reserves to stave off certain defeat; this was David A. Russell's division of three brigades (Campbell, Upton, and Edwards).  Campbell advanced his brigade astride the Berryville Pike with Edwards' brigade to his right.  General Russell, directing these maneuvers, was mortally wounded.  The two brigades struck Battle's attackers head-on and stalled them in the ravine from which they had emerged and drove them back on their supports at the edge of the West Woods--the rest of Rodes' division.  Upton's brigade came in on Edwards' right advancing from the edge of the Second Woods.  The two divisions--Rodes' and Russell's--closed, exchanging murderous volleys.  Upton's impetuous charge stopped the CS counterattack and drove it back into the West Woods.  Russell's division was then withdrawn out of range to regroup.  Wright called Upton's attack the turning point of the battle.\nPhase Seven.  Cavalry Action: Concurrent with the above events, there was cavalry fighting along the Valley Pike north of Winchester.  About 0500 hrs. the Union cavalry division of William Averell crossed the Opequon near Darkesville and moved to the Valley Pike, steadily pushing back the 23rd Virginia Cavalry, which fought a delaying action back to Bunker Hill.  There the 23VA were reinforced by the 62nd Virginia mounted infantry.\nAbout 10 o'clock, Union cavalry attacked at Bunker Hill, forcing the CS cavalry to retire.  Averell continued pushing south on the pike to link up with Merritt's division about 1400 hours, near Stephenson's Depot.  South of the old Charles Town road, the Confederate cavalry units were stiffened by Smith's infantry brigade (Wharton's Division).  About 1330, Devin's brigade arrived on the road to the depot.  About one mile south of the depot, it encountered McCausland's brigade drawn up in line of battle and attacked, driving the Confederates back in confusion.  The 23VA cavalry and the 62VA mounted infantry attacked the Union flank disrupting the charge.  McCausland and Smith retired one mile to the lightly entrenched line at near Collier Redoubt where they were reinforced by Fitz Lee's two brigades (Wickham and Payne) and Wharton's infantry division.  Maj. Gen. Fitzhugh Lee fell wounded, during the fighting south of Stephenson's Depot.  The Union cavalry deployed five brigades in line of battle, stretching from the railroad west toward the ridge near the intersection of the Valley Pike and Welltown Road.\nPhase Eight.  Crook's Flank Attack: About 1300 hours, Sheridan directed Crook's corps of two divisions (Thoburn and Duval) to advance from its reserve position near Spout Spring.  The divisions marched to near the ``Factory'' on Redbud Run, where they split up.  Thoburn's division moved west on the south bank of Redbud into the First Woods to relieve the XIX Corps.  Duval's division crossed the run and turned west accompanied by the artillery of Capt. Henry DuPont.  Duval's division deployed near the Huntsberry House.  DuPont unlimbered 18 guns on what has been named DuPont Hill, opposite Gordon's flank in the Second Woods and opened fire.  Crook now ordered Duval's division forward into a ``wall of flame.'' They swept across Redbud Run at the Hackwood House, turning Gordon's flank and advancing against Wharton's line, stretching from Collier Redoubt east.  About this time, Thoburn's division charged out of the First Woods into the Middle Field.  This two-pronged assault forced Gordon to abandon the Second Woods and align himself with Breckinridge to his left rear.  The CS line was now drawn into a compact L-shape, anchored by cavalry at Star Fort.  Wharton's division faced north.  Gordon's division made the turn of the L and Rodes' and Ramseur's divisions extended the line south to Abrams Creek.\nPhase Nine.  Collapse of CS Line: With the success of Crook's attack on the right, Sheridan ordered a general advance against the constricted CS position on the plateau just north and east of the town.  The Confederates were posted behind stone fences, rail barricades, and in shallow earthworks constructed in 1862.  They could retreat no farther without losing organization in the streets of Winchester.  As the Union advance closed from east and north, firing became fierce and desperate.  The massed artillery of both sides fired case shot and canister.  General Sheridan rode forward to the battle lines to urge his troops forward.  About 1530 hours, as the infantry fighting reached a crescendo, Averell and Merritt advanced their cavalry divisions astride the Valley Pike, first at a walk and then at a thundering gallop.  They swept over the CS line at Collier Redoubt driving back the CS cavalry on the low ground below Star Fort.  Schoonmaker's brigade of Averell's division repeatedly attacked Munford's cavalry at Star Fort, eventually overrunning the work.  The CS infantry withdrew to another line about 150 yards to the rear but the damage was done.  The sound of Union cavalry pounding in their rear spread panic all along the Confederate line, and soldiers began streaming to the rear and ``whirling through Winchester.'' Wharton's and Gordon's divisions seemed to disintegrate.  Seven Federal horseman captured Confederate battle flags, each earning a Medal of Honor.  Rodes's division (commanded now by Grimes) performed the difficult maneuver of ``changing front'' to the north to stop the onrushing US cavalry. Early's army retreated in disorder.\nPhase Ten.  Rear Guard Actions: General Early fashioned a defensive line at Kernstown (probably at Pritchard's Hill and behind Hoge's Run) which saved his wagons and most of his artillery.  Cavalry and elements of the VI Corps probed this makeshift CS defense as night fell, but the US forces were too disorganized by success to mount an effective pursuit.  After dark, the CS army withdrew up the Valley Pike to Fisher's Hill south of Strasburg.  Gen. Sheridan established his headquarters in Winchester at the home of Lloyd Logan.  Casualties were so severe that nearly every sizeable structure in Winchester served as a hospital after the battle.", "Current Condition of the Battlefield": "\nThe Opequon battlefield is large and sprawling, covering thousands of acres east and north of Winchester.  In general, much of the battlefield has been greatly degraded or destroyed by the expanding urban environs of Winchester, but several significant parcels currently remain, perhaps 800-900 acres: these include the Cavalry Field north of Collier Redoubt, the Hackwood Estate, northern half of Middle Field and First Woods adjacent to Redbud Run, and the heights (including DuPont's Hill) north of Redbud Run.  Together, these parcels form a block of battlefield core that retains a high degree of integrity. \nMany historic structures remain in the vicinity, including Hackwood; Spout Spring (Wood House) on rte. 7 adjacent to a sewage treatment plant; an old house, mill site, and a dye house where rte. 656 crosses Redbud Run; an old log house where rte. 659 crosses Redbud Run; Brumley House; Valley Mill Farm; Jordan Springs; Tanquary House; and others.  The Hackwood Estate dates from 1777 and is a historic treasure in its own right.  Preservation of this house and parcel alone would allow substantial interpretation of the battle of Opequon.\nOther parcels, such as the Opequon Crossing and Spout Spring, Seiver's and Locke's fords, and the Second Winchester parcel at Stephenson's Depot (which was scene of cavalry actions during this battle) would expand interpretation.  Star Fort and Collier Redoubt appear protected, although without sufficient buffers.\nAlthough hemmed in by development and severely degraded, the Dinkle Barn site adjacent to the I-81 entrance ramp off rte. 7 is key to understanding the attack of the VI Corps and Rodes' counterattack.  A portion of the ravine down which Rodes attacked is intact northeast of I-81 interchange in front of the Dinkle Barn site at the entrance of Winchester Mall.  The battery heights west of I-81 are being developed for business, industrial, and residential uses.  The last surviving parcel of West Woods (adjacent to I-81) is currently being bulldozed for townhouses.\nThe Hastings marker is the only monument erected on the battlefield that remains.  It is enclosed by an iron fence and sits next to the road in the midst of Fort Collier Business/Industrial Park east of Collier Redoubt.  Nearby are the remains of old stone fences and an old farm lane defended by CS troops in the battle's later phases.  ", "Perception of Threats to Battlefield": "\nThreats are immediate and of large order.  If continued as planned, the residential development of Caleb Heights and associated development would destroy the last remaining intact parcels of the infantry fighting at the battle of Opequon.  According to county-approved plans, construction would occupy most of the area south of Redbud Run with more than 600 single family homes, townhouses, and a commercial strip.  A connector road would be pushed through from the north, separating Hackwood and DuPont's Hill.  As of this writing, construction has not begun and has been held up by financial transactions.\nThe Hackwood House and property (144 acres) was recently offered for auction but the sale was postponed.  This property could potentially be subdivided.  Regency Lakes subdivision was built several years ago on southern portions of Middle Field and First Woods.  Further phases of housing development, if constructed, would cover the last portion of Second Woods, ``Rodes' Ravine,'' and another segment of the First Woods.  Star Fort itself is owned by a Civil War reenactment group but the surrounding 50-acres is for sale and zoned commercial/industrial.\nThe Shenandoah Valley Civil War Foundation, a local preservation group, has negotiated to preserve a small portion of the Second Woods area as a park if development proceeds.  The developer, Top of Virginia Corporation, has agreed to set aside 63 acres in the area adjacent to Hackwood as a commemorative park.  A forty-acre parcel of Middle Field next to Redbud Run is privately owned; the owner has stated in the past that he will not develop it.", "Identified Sites and Features Associated with the Battlefield": ["Baker House (site of)", "Berryville Canyon", "Berryville Pike", "Brumley House", "Burnt Factory Farm", "C. Wood's Mill (site of*)", "Carter House", "Cleridge Farm (Opequon Inn)", "Collier Redoubt", "Dinkle Barn (site of)", "DuPont's Hill", "Eversole House (site of)", "First Woods", "Greenwood Church", "Hackwood", "Hackwood Lane", "Hasting's Monument", "Hoffmann House (site of*)", "Huntsberry House (site of)", "I. Wood House", "Jordan Springs", "Locke's Ford", "Milburn Cemetery", "Middle Field", "Morgan's Mill (ruin)", "National Cemetery", "Old Town Winchester", "Opequon Crossing", "Ravine up which Rodes attacked", "Red Bud Mill (site of*)", "Rutherford House (site of)", "Second Woods", "Seiver's Ford", "Spout Spring (Wood House)", "Star Fort", "Stephenson's Depot (site of)", "Stonewall Cemetery", "Tanquery's Ford", "Thomas McCann House", "Valley Mill Farm", "Valley Pike", "West Woods", "Wood's Mill (site of*)", "Wright's Ford"], "url": "http://www.nps.gov/abpp/shenandoah/svs3-12.html"}, {"Number": 3, "CWSAC": "VA103", "Battle": "Front Royal", "Start Date": "23 May 1862", "County": [{"name": "Warren", "state": "VA"}], "General Location": "\nAlong US 340/522 from Limeton through Front Royal, Guard Hill, and Cedarville. Old Buckton Depot", "Size of Study/Core Areas": "3,082/944 acres", "GIS Integrity of Study/Core Areas": "48/33 percent; Poor/Poor", "Field Assessment of Study Area Integrity": "Poor", "USGS Quadrants": ["Bentonville", "Front Royal", "Strasburg"], "Campaign": "Jackson's Valley Campaign", "Principal Commanders": {"C": [{"rank": "Maj. Gen.", "first_name": "T.", "middle_name": "J.", "last_name": "Jackson"}], "U": [{"rank": "Col.", "first_name": "J.", "middle_name": "R.", "last_name": "Kenly"}]}, "Forces Engaged": {"C": {"text": "Jackson's and Ewell's divisions and three regiments of cavalry, about 16,500, 48 guns; only about 3,000 were actively engaged at Front Royal", "strength": 3000}, "U": {"text": "Reinforced regiment under Col. J. R. Kenly, about 1,063 and two guns", "strength": 1063}}, "Casualties": {"C": {"text": "50 k/w/m", "casualties": 50, "killed": null, "wounded": null, "missing_captured": null}, "U": {"text": "904 (32k/122w/750 captured)", "casualties": 904, "killed": 32, "wounded": 122, "missing_captured": 750}}, "Significance": "\nMaj. Gen. T. J. Jackson's decisive victory over a small Union force at Front Royal on 23 May 1862, forced the main Union Army at Strasburg under Maj. Gen. Nathaniel P. Banks into abrupt retreat.  Jackson deceived Banks into believing that the CS army was in the main Valley near Harrisonburg; instead he had marched swiftly north to New Market and crossed Massanutten via New Market Gap to Luray.  The advance to Front Royal placed Jackson in position to move directly on Winchester in the rear of the Union army.  On 24 May, Banks retreated down the Valley Pike to Winchester, harassed by CS cavalry and artillery at Middletown and Newtown (Stephens City), setting the stage for the battle of First Winchester the following day.\nThe action at Front Royal demonstrated Jackson's use of Valley topography and mobility to unite his own forces while dividing those of his enemies.  At a minimal cost, he forced the withdrawal of a large Union army by striking at its flank and threatening its rear.  The confusion engendered by Jackson's appearance at Front Royal and the hasty Union retreat from Strasburg to Winchester contributed materially to the defeat of Banks' army at First Winchester on 25 May.  Jackson used his cavalry to good advantage at Front Royal, to sever US communications east and west, and to strike the final blow at Cedarville.", "Description of the Battle": "\nPrelude: On 21 May 1862, the US army under Maj. Gen. Nathaniel P. Banks, numbering about 9,000 men, was concentrated in the vicinity of Strasburg with two companies of infantry at Buckton Depot.  Col. J. R. Kenly commanded 1,063 men and two guns at Front Royal.  CS cavalry under Col. Turner Ashby confronted Banks near Strasburg, but then withdrew to join the main army which crossed Massanutten Mountain via New Market Gap to reach Luray.\nOn 22 May, Maj. Gen. Thomas J. Jackson's Army of the Valley (about 16,500 men) advanced along the muddy Luray Road to within ten miles of Front Royal.  Jackson's headquarters were at Cedar Point.  Colonel Thomas Munford's cavalry regiment was sent east to close off Manassas Gap and cut communication between Front Royal and Washington.\nPhase One.  CS Advance: On the morning of 23 May, the vanguard of Jackson's army reached Spangler's crossroads (present day Limeton).  Here the CS cavalry under colonels Ashby and Flournoy diverged west to cross the South Fork Shenandoah at McCoy's Ford.  The infantry continued to Asbury Chapel and right onto a cross road to reach Gooney Manor Road.  Following this road, they approached Front Royal from the south, bypassing Federal pickets stationed near the river on the Luray Road one mile south of the courthouse.  After minor skirmishing the Federals withdrew.\nPhase Two.  Deployment of Forces: Jackson's leading brigade, Taylor's, deployed on Prospect Hill and along the ridge to the east.  The 1st Maryland and Wheat's Louisiana battalion were thrown out in advance, entering the town and clearing it of US skirmishers.  Col. J. R. Kenly, in command of US forces, withdrew his force to Camp (Richards') Hill, supported by a section of artillery.  The US line extended in an arc from the South Fork to Happy Creek, defending the South Fork bridge.  Kenly's artillery opened fire and slowed the CS advance.  Kenly's headquarters were in the Vanoort House.\nPhase Three.  US Defense of Camp Hill: The Confederate infantry advanced through town, deploying into line of battle under an accurate artillery fire.  A CS flanking column moved to the east, crossing Happy Creek in an attempt to force US withdrawal without a frontal assault.  After a long delay because of the muddy roads, a battery of rifled artillery was deployed on or near Prospect Hill to counter the Union guns on Camp Hill.\nPhase Four.  Skirmish at Buckton Depot: In the meantime, after crossing the South Fork at McCoy's Ford, Ashby's and Lt. Col. Flournoy's (6VA) cavalry rode via Bell's Mill and Waterlick Station to reach the US outpost at Buckton Depot.  Ashby made a mounted assault, which cost him several of his best officers before the US defenders surrendered.  Ashby cut the telegraph lines, severing communication between the main US army at Strasburg and the detached force at Front Royal.  He then divided the cavalry, sending Flournoy's regiment east toward Riverton to threaten Kenly's rear.  Ashby remained at Buckton Depot astride the railroad to prevent reinforcements from being sent to Front Royal.\nPhase Five.  US Retreat: On discovering that Confederate cavalry was approaching from the west, Col. Kenly abandoned his position on Camp Hill, retreated across the South and North Fork bridges, and attempted to burn them.  He positioned part of his command at Guard Hill, while the Confederates ran forward to douse the flames, saving the bridges.  While CS infantry repaired the bridges for a crossing, Flournoy's cavalry arrived at Riverton and forded the river, pressing Kenly's forces closely.  As soon as the CS infantry crossed, the US position could be flanked by a column moving along the river.  Kenly chose to continue his withdrawal, his outmatched cavalry fighting a rear guard action against Flournoy's 6th Virginia Cavalry.\nPhase Six.  US Surrender: Kenly withdrew along the Winchester turnpike beyond Cedarville with Flournoy's cavalry in close pursuit.  General Jackson rode ahead with the cavalry, as CS infantry began to cross the rivers.  At the Thomas McKay House, one mile north of Cedarville, Kenly turned to make a stand, deploying on the heights on both sides of the pike.  Flournoy's cavalry swept around the US flanks, causing panic.  Kenly fell wounded, and the US defense collapsed.  More than 700 US soldiers threw down their weapons and surrendered.", "Current Condition of the Battlefield": "\nMany terrain features associated with this battle have been overwhelmed by the growth of the City of Front Royal.  At the time of the battle, Front Royal was a small village of several streets clustered around the courthouse.  Troops maneuvered among the buildings and on open ground, south, east, and north of the village, areas which have now been urbanized.  Loss of integrity is most obvious when attempting to understand maneuvers in and around Camp (Richardson's) Hill.  It is difficult to find a vantage point to understand the terrain advantage of the US position there.  Camp Hill itself, site of Kenly's defense, is densely residential (Warren Park subdivision).  Open ground east of Camp Hill and Happy Creek would enable some understanding of CS flanking maneuvers although access is restricted.\nThe massive reshaping of Guard Hill, due to road-widening and quarrying, and heavy construction north to I-66 is an obvious loss.  The current ``gap'' in Guard Hill for US 340/522 is largely a modern cut.  Large industrial structures, including the DuPont Automotive plant, have been constructed in the vicinity of Cedarville on ground maneuvered over in the closing phase of the battle.\nIn spite of these losses, several features, primarily architectural, remain by which the flow of the battle may be interpreted.  The hamlet of Spangler's Crossroads (Limeton) and the road to McCoy's Ford enable an understanding of CS cavalry movements, preparatory to the battle.  The roads from McCoy's Ford to Buckton Depot taken by the CS cavalry pass through a scenic rural countryside.  The site of Buckton Depot (and a depot building, vintage uncertain), the site of Ashby's skirmish, can be located.  Asbury Chapel marks where the CS infantry diverged from Luray Road to reach Gooney Manor Road.  Gooney Manor Road passes through a scenic landscape until near the entrance to Skyline Drive at Front Royal, where there is dense development.\nIn the town of Front Royal, Prospect Hill Cemetery maintains open ground where the CS left flank first deployed and where artillery was positioned.  The cemetery offers a good vantage point for understanding the terrain and tactical movements.  Monuments to Mosby's men and to the Warren Rifles are in Prospect Hill Cemetery.  In a general sense, the Front Royal old town can be considered a supporting resource, although the district is not listed in the National Register.  The Warren Rifles museum interprets the role of Warren County residents in the Civil War.  A historic marker and a Confederate monument stand in front of the courthouse.  The estate of Rose Hill, a beautiful old home, is specifically mentioned in several battle accounts.\nThe South and North Fork bridge sites can be located.  Riverside Farm (c. 1850) at Riverton preserves about 150 acres of open farmland and a segment of the original alignment of the Front Royal-Winchester turnpike.  (Stonewall Jackson is said to have slept on the porch here on the night after the battle.) The hamlet of Riverton dates primarily from the 1880s.  The old Guard House stands on the hill to the west of the new road cut.  The Robert and Jacob McKay houses (late 1700s) and the old store (c. 1860) at Cedarville provide some sense of historic character in spite of encroaching residential development.  The Thomas McKay House where US forces surrendered stands one mile north of Cedarville (currently an antique store).  A large industrial building adjacent to the house degrades the setting.", "Perception of Threats to Battlefield": "\nIn terms of terrain, battlefield ground within the city limits of Front Royal has been lost.  The Riverton Corporation controls access to Guard Hill along the river.  Heavy quarrying is occurring on the northern and eastern slopes of the hill and on land adjacent to the river.  Highway widening has increased the size of the Guard Hill gap and is reshaping the ground.  Plans being discussed to build a second span over the North Fork would further degrade this area of low integrity.  Riverside Farm is the last area of open farmland at Riverton.  The flood plain of the North Fork is currently agricultural land.  An I-66 interchange has spurred commercial and industrial development north of Guard Hill on the road to Cedarville.  The area north of Cedarville and east of US 340 is an expanding industrial park, currently encroaching on the US surrender area.  Adjacent to this industrial park is an ``Inland Port'' complex centered on a railroad terminal.", "Identified Sites and Features Associated with the Battlefield": ["Asbury Chapel", "Bell's Mill (site of)", "Belle Boyd House", "Buckton Depot (site of)", "Carson's Ford", "Cedarville", "Cedarville Baptist Church", "Cedarville Store", "County Courthouse", "Crooked Run", "Gooney Manor Road", "Guard Hill", "Guard House", "Happy Creek", "Jacob McKay House", "Limeton (Spangler's Crossroads)", "Manassas Gap Railroad", "McCoy's Ford", "Mrs. King House (site of*)", "North Fork Bridge Site", "Old Luray Road", "Old Town Front Royal", "Old Winchester Pike", "Prospect Hill Cemetery", "Richardson's (Camp) Hill", "Riverside Farm", "Robert McKay House", "Rose Hill", "South Fork Bridge Site", "Thomas McKay House", "Vanoort House (site of)", "Waterlick Station (site of)"], "url": "http://www.nps.gov/abpp/shenandoah/svs3-3.html"}, {"Number": 2, "CWSAC": "VA102", "Battle": "McDowell", "Start Date": "8 May 1862", "County": [{"name": "Highland", "state": "VA"}], "General Location": "\nRte. 250 east of McDowell, between Bull Pasture River and Sitlington's Hill.", "Size of Study/Core Areas": "4,539/2,258 acres", "GIS Integrity of Study/Core Areas": "100/100 percent; Good/Good", "Field Assessment of Study Area Integrity": "Good", "USGS Quadrants": ["McDowell", "Monterey SE", "West Augusta"], "Campaign": "Jackson's Valley Campaign", "Principal Commanders": {"C": [{"rank": "Maj. Gen.", "first_name": "T.", "middle_name": "J.", "last_name": "Jackson"}, {"rank": "Brig. Gen.", "first_name": "Edward", "last_name": "Johnson"}], "U": [{"rank": "Brig. Gen.", "first_name": "R.", "middle_name": "C.", "last_name": "Schenck"}, {"rank": "Brig. Gen.", "first_name": "R.", "last_name": "Milroy"}]}, "Forces Engaged": {"C": {"text": "Johnson's brigade (six regts.) and Taliaferro's (3 regts.), about 6,000 engaged.", "strength": 6000}, "U": {"text": "Two brigades (Milroy and Schenck), about 6,500.  Milroy attacked Sitlington's Hill with 2,250.", "strength": 6500}}, "Casualties": {"C": {"text": "about 500 k/w/m (12GA suffered about 175 k/w/m)", "casualties": 500, "killed": null, "wounded": null, "missing_captured": null}, "U": {"text": "about 260 k/w/m.", "casualties": 360, "killed": null, "wounded": null, "missing_captured": null}}, "Significance": "\nSome historians consider the battle of McDowell the beginning of ``Stonewall'' Jackson's 1862 Valley Campaign, while others prefer to include First Kernstown, Stonewall's only defeat.  The battle of McDowell is studied today by military historians for several reasons.  At the tactical level, it can be argued that the US forces achieved a draw.  Milroy's ``spoiling attack'' surprised Jackson, seized the initiative, and inflicted heavier casualties, but did not drive the Confederates from their position.  Historians derive lessons about use of terrain, small unit tactics and leadership, and overexuberance under fire (12th Georgia).  At the strategic level, the battle of McDowell and the resultant withdrawal of the US army was an important victory for the South.  The battle demonstrated Jackson's strategy of concentrating his forces against a numerically inferior foe, while denying his enemies the chance to concentrate against him.  Jackson rode the momentum of his strategic win at McDowell to victory at Front Royal (23 May) and First Winchester (25 May).", "Description of the Battle": "\nPhase One.  CS Advance on Parkersburg Turnpike (7 May): Maj. Gen. Thomas J. Jackson's columns departed West View and Staunton on the morning of 7 May, marching west along the Parkersburg turnpike.  Elements of Brig. Gen. Edward Johnson's brigade composed the vanguard.  At mid-afternoon, Union pickets were encountered at Rodgers' tollgate, where the pike crosses Ramsey's Draft.  The Union force, which consisted of portions of three regiments (3WV, 32OH, 75OH) under overall command of Brig. Gen. Robert Milroy, withdrew hastily, abandoning their baggage at the tollgate and retreating to the crest of Shenandoah Mountain.\nAt Rodgers', Johnson and Jackson conferred.  The Confederate force split into two columns to envelope the US holding position on Shenandoah Mountain.  Milroy ordered his force to withdraw and concentrate at McDowell, where he hoped to receive reinforcements.  Milroy also positioned a section of artillery on Shaw's Ridge to impede Johnson's descent from the crest of Shenandoah Mountain.  These guns were soon withdrawn with their supports to McDowell.  By dusk, Johnson's advance regiments reached Shaw's Fork where they encamped.  Because of the narrow roads and few camp sites, Jackson's army was stretched 8-10 miles back along the pike with its rear guard at Dry Branch Gap.  Jackson established his headquarters at Rodgers' tollgate.  During the night, Milroy withdrew behind the Bullpasture River to McDowell, establishing headquarters in the Hull House.\nPhase Two.  CS Advance to Sitlington's Hill (8 May): Starting at dawn of 8 May, the Confederate advance crossed Shaw's Ridge, descended to the Cowpasture River at Wilson's House, and ascended Bullpasture Mountain.  The advance was unopposed.  Reaching the crest of the ridge, Jackson and Jedediah Hotchkiss conducted a reconnaissance of the Union position at McDowell from a rocky spur right of the road.  Johnson continued with the advance to the base of Sitlington's Hill.  Expecting a roadblock ahead, he diverged from the road into a steep narrow ravine that leads to the top of the hill.  After driving away Union skirmishers, Johnson deployed his infantry along the long, sinuous crest of the hill.  Jackson asked his staff to find a way to place artillery on the hill and to search for a way to flank the Union position to the north.\nPhase Three.  Deployment of US Forces: About 1000 hours, Brig. Gen. Robert Schenck arrived after a forced march from Franklin.  Being senior to Milroy, Schenck assumed overall command of the Union force at McDowell with headquarters at the Hull House.  He deployed his artillery, consisting of 18 guns on Cemetery Hill and near the McDowell Presbyterian Church to defend the bridge over the Bullpasture River.  He deployed his infantry in line from McDowell south along the river for about 800 yards.  He placed one regiment (2WV) on Hull's Hill, west of the river and overlooking the pike.  Three companies of cavalry covered the left flank on the road to the north of the village.\nPhase Four.  US Attack on Sitlington's Hill: Schenck and Milroy sent out skirmishers to contest the base of Sitlington's Hill along the river.  As CS forces on the crest of the hill increased in numbers, Schenck and Milroy conferred.  Union scouts reported that the Confederates were attempting to bring artillery to the crest of the hill which would make the US position on the bottomland at McDowell untenable.  In absence of an aggressive CS advance, Schenck and Milroy attempted a spoiling attack.  Milroy advanced his brigade (25OH, 32OH, 75OH, 3WV) and the 82nd Ohio of Schenck's brigade, about 2,300 men.  About 1500 hours Milroy personally led the attacking force, which crossed the bridge and proceeded up the ravines that cut the western slope of the hill.\nIn the meantime, Jackson had been content to hold the crest of the hill while searching for a route for a flanking movement to the north.  He declined to send artillery up the hill because of the difficulty of withdrawing the pieces in the face of an attack.  Union artillerymen on Cemetery Hill elevated their pieces by digging deep trenches in the ground for the gun trails and began firing at the Confederates in support of the advancing infantry.  Schenck also had a six-pounder hauled by hand to the crest of Hull's Hill to fire on the CS right flank above the turnpike (some accounts say a section of guns, another says a whole battery).  The Union line advanced resolutely up the steep slopes and closed on the Confederate position.  The conflict became ``fierce and sanguinary.''\nThe 3rd West Virginia advanced along the turnpike in an attempt to turn the CS right.  Jackson reinforced his right on the hill with two regiments and covered the turnpike with the 21st Virginia.  The 12th Georgia at the center and slightly in advance of the main CS line on the hill crest bore the brunt of the Union attack and suffered heavy casualties.  The fighting continued for four hours as the Union attackers attempted to pierce the center of the CS line and then to envelope its left flank.  Nine CS regiments were engaged, opposing five US regiments in the fight for Sitlington's Hill.  At dusk the Union attackers withdrew to McDowell.\nPhase Five.  Union Withdrawal (9 May): At dark US forces withdrew from Sitlington's Hill and recrossed to McDowell, carrying their wounded from the field.  About 0200 hours of 9 May, Schenck and Milroy ordered a general retreat along the turnpike toward Franklin.  The 73rd Ohio held their skirmish line along the river until near dawn when they withdrew and acted as rear guard for the retreating column.  Ten men of the regiment were inadvertently left behind and captured.  Shortly after the Federals retired, the Confederates entered McDowell.  Schenck established a holding position on 9 May (north of modern intersection of rte. 629 and US 220) but only minor skirmishing resulted.  For nearly a week, Jackson pursued the retreating Union army almost to Franklin before commencing a return march to the Valley on 15 May.\nCurrent Condition of the Battlefield\nThe battlefield of McDowell retains the highest integrity of all of the Shenandoah Valley battlefields surveyed; this is due to its location and the rugged nature of the ground, which precludes almost any land use other than agriculture or woodland.  Highland County retains a low population density (fewer residents now than at the time of the battle) and a distinct rural character.  In general, the landscape consists of narrow river valleys which are farmed and high ridge lines which are mostly forested with interspersed pastureland.  The line of Jackson's advance along rte. 250 passes through the George Washington National Forest, which ends at the Cowpasture River.  The core of the battlefield on Sitlington's Hill is owned and preserved by the Association for the Preservation of Civil War Sites (APCWS) and the Lee- Jackson Foundation.  Together the two groups own more than 200 acres bounded by rte. 250 on the east and north, including the ravine used by CS troops to reach the summit and main areas of attack and defense.  A single individual owns the remaining portions of Sitlington's Hill.  A hiking trail on APCWS property leads to the crest of Sitlington's Hill, providing unmarked access for visitors.\nThe village of McDowell retains much character, including many historic structures: a renovated mill next to the bridge, Presbyterian Church (used as a field hospital by both sides), and the Hull House (Federal headquarters).  The general store and other structures appear to date from about 1900.  Hull's Hill north of rte. 250 is privately owned; its crest is maintained as pastureland as at the time of the battle, while its slopes and base are heavily wooded.\nPerception of Threats to Battlefield The general perception is that the battlefield of McDowell was substantially preserved by the recent APCWS acquisition of about 100 acres on Sitlington's Hill.  The county's economy is sluggish, compared with that of the Shenandoah Valley proper, and little development of any kind is present.  The county prides itself on its annual Highland Maple Festival, which attracts thousands of visitors every spring.  Local residents are content that ``their battlefield'' is in one piece, and many expressed the desire that more tourists could be attracted to McDowell to visit it.  The Hull House is currently occupied seasonally and the structure appears in good condition.", "Identified Sites and Features Associated with the Battlefield": ["Bullpasture River", "Cedar Knob", "Cemetery Hill", "Crab Run", "Fort Johnson", "Hull House", "Hull's Hill", "Mill Site", "Old Town McDowell", "Parkersburg Road", "Presbyterian Church", "Rodger's Tollgate (site of)", "Shaws Ridge", "Shenandoah Mountain", "Sitlington Hill", "UDC Battle Monument", "Warm Springs Road", "Wilson House (site of)"], "url": "http://www.nps.gov/abpp/shenandoah/svs3-2.html"}, {"Number": 13, "CWSAC": "VA120", "Battle": "Fisher's Hill", "Start Date": "21 September 1864", "End Date": "22 September 1864", "County": [{"name": "Shenandoah", "state": "VA"}], "General Location": "\nOn heights north and south of rte. 601 and Tumbling Run from the river to the Back Road; hamlet of Fisher's Hill is marked on contemporary maps.", "Size of Study/Core Areas": "9,644/2,751 acres", "GIS Integrity of Study/Core Areas": "89/85 percent; Good/Good", "Field Assessment of Study Area Integrity": "Fair", "USGS Quadrants": ["Tom's Brook", "Strasburg", "Mountain Falls", "Middletown"], "Campaign": "Sheridan's Valley Campaign", "Principal Commanders": {"C": [{"rank": "Lt. Gen.", "first_name": "Jubal", "middle_name": "A.", "last_name": "Early"}], "U": [{"rank": "Maj. Gen.", "first_name": "Philip", "middle_name": "H.", "last_name": "Sheridan"}]}, "Forces Engaged": {"C": {"text": "Four infantry divisions (Wharton, Gordon, Pegram, Ramseur), one cavalry division (Lomax), about 9,500", "strength": 9500}, "U": {"text": "Three infantry corps (Wright, Emory, Crook), Averell's cavalry division, about 29,444.", "strength": 29444}}, "Casualties": {"C": {"text": "1,235 (30k/210w/995mc)", "casualties": 1235, "killed": 30, "wounded": 210, "missing_captured": 995}, "U": {"text": "528 (52k/457w/19m)", "casualties": 528, "killed": 52, "wounded": 457, "missing_captured": 19}}, "Significance": "\nLt. Gen. Jubal Early was ``outgeneraled'' by Maj. Gen. Philip Sheridan at Fisher's Hill.  Although the casualty figures were not high, this battle was a masterpiece of maneuver and surprise.  Sheridan's flanking attack brought Crook's corps to the left rear of Early's position on Fisher's Hill and threw the CS army into a panic.  Confederate defeat at Fisher's Hill (on the heels of defeat at Opequon) opened the Shenandoah Valley to a US advance that reached beyond Staunton.  When Sheridan withdrew during the first part of October, his army systematically burned mills, barns, crops, and forage, and ran off livestock.  By implementing this strategy of ``total warfare,'' Sheridan felt that he accomplished the primary objective of his campaign--to deprive the Confederacy of the agricultural abundance of the Valley.", "Description of the Battle": "\nPhase One.  CS Dispositions (19-20 September): After its crushing defeat at Winchester on 19 September 1864, the CS army withdrew to Fisher's Hill.  The US army pursued as far as Hupp's Hill on 20 September and massed near Strasburg.  The Confederate position at Fisher's Hill was a strong one, particularly at the center and on the right flank.  Wharton's division, on the Confederate right flank, entrenched along the high bluff overlooking Miller's bottom extended to the left to cover the Valley Pike (old alignment).  Gordon's division deployed from the Valley Pike across Manassas Gap Railroad to near the Middle Road above the hamlet of Fisher's Hill.  Pegram's division (formerly Ramseur's) was to Gordon's left, and Ramseur's division (formerly Rodes's) extended the line west to a high hill south of Tumbling Run South Fork (referred to a ``Ramseur's Hill'' in this report).\nThe CS cavalry under Lomax extended the main line northwest to and beyond the Back Road.  Lomax's position was held with little more than a skirmish line.\nTo mask these deployments, Lt. Gen. Jubal A. Early placed a strong skirmish line on the hills north of Tumbling Run (Quarry Hill, Flint Hill, School House Hill).  General Early had his headquarters at the Widow Funkhouser house on the Valley Pike.  Confederate signal stations on Massanutten (Signal Knob) and Round Hill offered wide-ranging views of any Union moves against this line.  Early's artillery commanded all approaches along the pike, the railroad, and the Middle Road.  The advanced CS positions north of Tumbling Run were not supported by artillery.  A brigade of CS cavalry and a battery of horse artillery were placed on Sandy Hook east of the North Fork Shenandoah.\nPhase Two.  US Advance (21 September): About noon, 21 September, Sheridan advanced his army south and west from Strasburg, massing the bulk of the VI Corps in a horseshoe opposite the CS right center on the plateau north of Flint Hill, its left at the Manassas Gap railroad.  The XIX Corps, weakened from the battle of Opequon, was placed on the US left east of the railroad with a skirmish line extending back through Strasburg to cover the fords over the Shenandoah North Fork and the road to Front Royal.  The line of these two corps was entrenched.  Crook's corps (nominally the Army of West Virginia) was held in reserve and out of sight of Signal Knob ``in the timber near Strasburg.'' Wright (VI Corps) established his headquarters in the Amos Stickley House (near the intersection of rte. 757 and I- 81). Averell's cavalry division covered the Back Road.  The rest of Sheridan's cavalry was sent via Buckton Ford and Front Royal to advance up the Luray (Page) Valley.  Sheridan established headquarters at the George Hupp House just north of Strasburg.\nPhase Three.  Capture of Flint Hill (21 September): As US soldiers entrenched their new position, skirmishing heated up.  Sheridan and Wright surveyed the land but could see little of the main CS line because of two intervening hills, called ``Flint Hill.'' These hills were defended by a reinforced skirmish line barricaded behind ``hog'' or ``bull pens'' (U-shaped barricades made of fence rails that sheltered three men).  Sheridan ordered Wright to take the hills so that he would have an ``unobstructed view.'' Two regiments (126OH and 139PA) advanced but were thrown back.  Reinforced by a third regiment, they tried again without success.  The First Brigade/Second Division (five New York and Pennsylvania regiments) was brought into battle line and swept forward under command of Col. J. M. Warner (formerly commander of the Vermont brigade).  The hills fell quickly.  General Wright described this movement as ``of the greatest importance to the operations of the next day, as it gave us a view of the enemy's line and afforded excellent positions for artillery, of which we availed ourselves in the more important struggle of the 22nd.'' Warner's men threw up rifle pits and bivouacked on the hills within rifle-musket range of the main CS line south of Tumbling Run.\nPhase Four.  US Battle Line Advanced (21-22 September): During the night, Sheridan extended his line westward with Ricketts division on the far right, Getty next, and Wheaton connecting with the XIX Corps at the railroad.  After sunrise, Crook's corps was brought forward, following ravines and staying in timber to be out of sight of the CS signal stations.  Shortly before noon, Ricketts division (VI Corps) moved to possess the heights overlooking the North Fork of Tumbling Run, while Averell's cavalry division advanced on the Back Road to establish a connection with Ricketts's right flank.  Keifer's brigade assaulted and carried the two hills south of the run (School House Ridge), driving CS skirmishers back on their main line.  Union skirmishers were pushed to within range of the CS works and began laying down a steady fire.  Ricketts formed his division behind the crest of the hills and awaited Crook's attack.\n     In the meantime, about 1215 hours, Emory (XIX Corps) rushed\nQuarry Hill on the left with a brigade and seized the CS rifle- pits there.  His men immediately reversed the entrenchments, giving the Union army an unbroken line of rifle pits, extending from Quarry Hill across Flint Hill, confronting the main CS line on Fisher's Hill at a range of about 500 yards; skirmishing erupted along the line.  US batteries were brought up, and an artillery duel erupted in the vicinity of the village of Fisher's Hill.  Skirmishing continued until about 1600 hours.\nPhase Five.  Crook's Flank Attack (22 September): During the morning Gen. George Crook moved his two divisions (about 5,000 men) to the base of Little North Mountain beyond St. Stephens Church, unseen by the Confederate signal station on Massanutten Mountain.  About 1400 hours, Sheridan directed him to commence a flanking movement along the shoulder of the mountain.  Crook formed his corps in two parallel columns and marched south until more than half of the command was beyond the Confederate left flank, which was held by Lomax's cavalry division.  Crook encountered only scattered fire from a few surprised pickets.\nAbout 1600 hours, Crook ordered his columns to face left and to charge.  The soldiers charged down the side of the mountain, shouting at the tops of their lungs.  The CS cavalry took to their horses and scattered.  In their rush down the hill, Crook's divisions lost all order; a mass of men funneled through the ravine of the Middle Fork of Tumbling Run past the Barbe House and closed on the Confederate infantry on ``Ramseur's Hill.'' A second mass funneled to the right along an old road that penetrated to the rear of the Confederate positions.  Grimes's brigade of North Carolinians held out against Crook's onslaught until Ricketts ordered his division forward.  Hearing, more than seeing, that they were flanked, CS defenders along the remainder of the line began abandoning their entrenchments.  Battle's CS brigade was sent to the left to confront Crook but was misdirected into a ravine and missed the fighting altogether.  Sheridan advanced his other divisions, the men attacking generally up the ravines.  Early's army was soon in full flight, abandoning equipment and 14 artillery pieces that could not be extricated from the works.\nPhase Six.  Rear Guard Action at Prospect Hill (22 September): The CS army was a shambles but attempted to collect itself at the base of Round Hill on the Valley Pike.  Generals Gordon, Ramseur, and Pegram and staff officers established a rear guard of artillery and infantry at Prospect Hill and held off the disorganized Union pursuit.  During this action, Col. Alexander ``Sandie'' Pendleton, Stonewall Jackson's favorite staff officer, was wounded; he died the following day in Woodstock.  The CS army retreated to Narrow Passage, and the wagon train went on to Mt. Jackson.  Darkness and confusion among the Union victors prevented effective pursuit.\nDuring the fighting at Fisher's Hill, a CS cavalry division turned back the Union cavalry at Milford (present day Overall) in the Luray Valley, preventing an attempt to gain Early's rear by crossing the gap to New Market.  Sheridan remarked that if his cavalry had been successful, he could have captured Early's army.\n\nCurrent Condition of the Battlefield\nThe excellent state of preservation and the existing rural character make the study of this battlefield pleasant as well as informative.  The battlefield can be interpreted mostly from public roads using about four vantage points, although the best- preserved Confederate entrenchments are on private property.  The hamlet of Fisher's Hill retains a historic appearance that includes an old mill (Keller's Mill) and other structures of Civil War vintage.  Rte. 601 from rte. 623 (Back Road) to US 11 (Valley Pike) is a pristine rural landscape, except for a short stretch of trailers and a few modern houses west of but out of sight of ``Ramseur's Hill.'' I-81 is conducted over rte. 623 with no interchange and is not intrusive at ground level but becomes intrusive if one climbs the hills adjacent to it. \nIn 1990, the Association for Preservation of Civil War Sites (APCWS) acquired about 195 acres of land west of and adjacent to I-81 and north and south of rte. 601.  (The parcel of land south of rte. 601 is referred to as ``Ramseur's Hill'' in this report.) This was where the Confederate infantry met Crook's flank attack from the west and the assault of Ricketts' division from the north.  The parcel of APCWS land north of rte. 601 was the scene of preparatory skirmishing and a staging area for Ricketts' division.  Access to Ramseur's Hill provides an important vantage point for understanding and interpreting the battle.  Traces of Confederate entrenchments remain on the hill.  This area, although critically important in understanding the action, is visually degraded by I-81.\nA vantage point slightly north of the intersection of rtes. 639 and 757 allows interpretation of opening phases of the battle and offers views of Flint Hill (actually two hills, separated by rte. 757) assaulted on 21 September.  The Emanuel Evangelical Church above the hamlet of Fisher's Hill offers a sweeping panorama of the CS positions south of Tumbling Run. \nMany historic structures, including the Eastep and Barbe houses, a brick house (S. Funkhouser house) at the base of Ramseur's Hill, Keller's Mill, Stickley's Mill, and the Miller House are along rte. 601 in Tumbling Run valley.  The Widow Funkhouser House site, Early's headquarters, is on US 11 (vintage of current house was not determined).  Stone fences remain near the shell of the Jacob Funk house and barn, built by one of the county's first residents in the mid-1700s.\nSections of the fieldworks on Fisher's Hill are extant with some segments in a good state of preservation.  Portions were bulldozed years ago where the entrenchments extended across pastureland, although in some cases shallow traces remain.  Works overlooking the old bed of the Valley Pike are in good condition.\nThe line of entrenchments should be professionally surveyed.  Near the intersection of rtes. 11 and 601 the abutments of the old stone Valley Pike bridge remain. The old road trace climbs the face of the hill and in places is supported by stone retaining walls.\nPerception of Threats to Battlefield\nNew construction activity in the area has been slight.  Several local landowners have erected modern houses for themselves or their families along rte. 601.  There is a large trailer park along US 11 but behind Fisher's Hill, where it is not particularly intrusive.  Several new homes have been built at the base of Flint Hill and in the vicinity of the intersection of rtes. 639 and 757, degrading the ability to interpret the battle's initial phases.  There is a short strip of modern housing along rte. 757 south of Fisher's Hill.  Based on interviews with several local landowners, there was general approval of the recent APCWS acquisition and a strong consensus that new development in the area should be excluded.  The major visual intrusion in the battlefield is I-81, which prompted the field surveyor to lower the integrity rating from good to fair.  Any future move to widen I-81 or to provide an interchange would severely impact the battlefield's integrity.", "Identified Sites and Features Associated with the Battlefield": ["A. Funkhouser House (site of*)", "Back Road", "Barbe House", "Eastep House", "Entrenchments", "Fisher's Hill", "Fisher's Mill*", "Flint Hill", "Fort Banks (site of)", "Hupp House", "I. Piper House (site of*)", "Jacob Funk House and Barn (ruin)", "Keller's Mill", "Locust Grove School (site of)", "Manassas Gap Railroad", "Middle Road", "Miller House", "Miller's Bottom", "Mt. Hebron Church", "Newell House (site of*)", "Old Town Strasburg", "Old Picnic Ground (Site of Civil War Veterans' Reunions)", "Prospect Hill", "Quarry Hill", "Ramseur's Hill", "Round Hill", "S. Funkhouser House", "Signal Knob", "Spangler's Mill", "St. Stephens Church", "Stage Road", "Stone Bridge Site (ruin)", "Tumbling Run", "Valley Pike", "Widow Funkhouser House (site of)"], "url": "http://www.nps.gov/abpp/shenandoah/svs3-13.html"}]