{
  "dates": "July 11-12, 1864",
  "operation": false,
  "url": "http://www.nps.gov/hps/abpp/battles/dc001.htm",
  "results_text": "Union victory",
  "casualties_text": "874 total",
  "description": "On July 11, Lt. Gen. Jubal A. Early's exhausted Confederates reached the outskirts of Washington near Silver Spring. Skirmishers advanced to feel the fortifications which at the time were manned only by Home Guards, clerks, and convalescent troops. During the night, veteran units from the Union VI Corps disembarked from troop transports and marched north through the streets of Washington to bolster the defenses. On July 12, Early was finally in position to make a strong demonstration, which was repulsed by the veteran Union troops. In the afternoon, VI Corps units sortied against the Confederate skirmishers, driving them back from their advanced positions in front of Forts Stevens and DeRussy. President Lincoln watched the action from Fort Stevens and came under fire from Confederate sharpshooters. Recognizing that the Union Capitol was now defended by veterans, Early abandoned any thought of taking the city. Early withdrew during the night, marching toward White's Ford on the Potomac, ending his invasion of Maryland. \"We didn't take Washington,\" Early told his staff officers, \"but we scared Abe Lincoln like Hell.\"",
  "start_date": "1864-07-11",
  "forces_text": "Divisions",
  "belligerents": {
    "CS": {
      "commanders": [
        {
          "navy": false,
          "last_name": "Early",
          "middle_name": "A.",
          "rank": "Lieutenant General",
          "suffix": "",
          "fullname": "Jubal A. Early",
          "first_name": "Jubal"
        }
      ]
    },
    "US": {
      "commanders": [
        {
          "navy": false,
          "last_name": "Wright",
          "middle_name": "G.",
          "rank": "Major General",
          "suffix": "",
          "fullname": "Horatio G. Wright",
          "first_name": "Horatio"
        },
        {
          "navy": false,
          "last_name": "McCook",
          "middle_name": "McDowell",
          "rank": "Major General",
          "suffix": "",
          "fullname": "Alexander McDowell McCook",
          "first_name": "Alexander"
        }
      ]
    }
  },
  "campaign": "Early's Raid and Operations Against the B&O Railroad [June-August 1864]",
  "battle": "DC001",
  "result": "Union",
  "significance": "B",
  "other_names": [
    "Washington"
  ],
  "state": "DC",
  "preservation": "IV.2",
  "principal_commanders": "Maj. Gen. Horatio G. Wright and Maj. Gen. Alexander McDowell McCook [US]; Lt. Gen. Jubal A. Early [CS]",
  "end_date": "1864-07-12",
  "cwsac_reference": "DC001",
  "casualties": 874,
  "location": [
    {
      "place": "District of Columbia",
      "state": "DC"
    }
  ],
  "battle_name": "Fort Stevens"
}