{
  "dates": "September 10-11, 1863",
  "operation": false,
  "url": "http://www.nps.gov/hps/abpp/battles/ga003.htm",
  "results_text": "Union strategic victory",
  "casualties_text": "Unknown",
  "description": "After the Tullahoma Campaign, Rosecrans renewed his offensive, aiming to force the Rebels out of Chattanooga. The three corps comprising Rosecrans's army split and set out for Chattanooga by separate routes. Hearing of the Union advance, Braxton Bragg concentrated troops around Chattanooga. While Col. John T. Wilder's artillery fired on Chattanooga, Rosecrans attempted to take advantage of Bragg's situation and ordered other troops into Georgia. They raced forward, seized the important gaps, and moved out into McLemore's Cove. Negley's XIV Army Corps division, supported by Brig. Gen. Absalom Baird's division, was moving across the mouth of the cove on the Dug Gap road when Negley learned that Rebels were concentrating around Dug Gap. Moving through determined resistance, he closed on the gap, withdrawing to Davis' Cross Roads in the evening of September 10 to await the supporting division. Bragg had ordered General Hindman with his division to assault Negley at Davis' Cross Roads in the flank, while Maj. Gen. Patrick R. Cleburne's division forced its way through Dug Gap to strike Negley in front. Hindman was to receive reinforcements for this movement, but most of them did not arrive. The Rebel officers, therefore, met and decided that they could not attack in their present condition. The next morning, however, fresh troops did arrive, and the Rebels began to move on the Union line. The supporting Union division had, by now, joined Negley, and, hearing of a Confederate attack, the Union forces determined that a strategic withdrawal to Stevens Gap was in order. Negley first moved his division to the ridge east of West Chickamauga Creek where it established a defensive line. The other division then moved through them to Stevens Gap and established a defensive line there. Both divisions awaited the rest of Maj. Gen. George Thomas's corps. All of this was accomplished under constant pursuit and fire from the Confederates.",
  "start_date": "1863-09-10",
  "forces_text": "Two divisions [US]; unknown [CS]",
  "belligerents": {
    "CS": {
      "commanders": [
        {
          "navy": false,
          "last_name": "Hindman",
          "middle_name": "C.",
          "rank": "Major General",
          "suffix": "",
          "fullname": "Thomas C. Hindman",
          "first_name": "Thomas"
        },
        {
          "navy": false,
          "last_name": "Breckinridge",
          "middle_name": "C.",
          "rank": "Major General",
          "suffix": "",
          "fullname": "John C. Breckinridge",
          "first_name": "John"
        }
      ],
      "description": "unknown"
    },
    "US": {
      "commanders": [
        {
          "navy": false,
          "last_name": "Negley",
          "middle_name": "",
          "rank": "Major General",
          "suffix": "",
          "fullname": "James Negley",
          "first_name": "James"
        }
      ],
      "divisions": 2,
      "description": "Two divisions"
    }
  },
  "campaign": "Chickamauga Campaign [August-September 1863]",
  "battle": "GA003",
  "result": "Union",
  "significance": "C",
  "other_names": [
    "Dug Gap"
  ],
  "state": "GA",
  "preservation": "II.3",
  "principal_commanders": "Maj. Gen. James Negley [US]; Maj. Gen. Thomas C. Hindman and Maj. Gen. John C. Breckinridge [CS]",
  "end_date": "1863-09-11",
  "cwsac_reference": "GA003",
  "casualties": null,
  "location": [
    {
      "place": "Dade County",
      "state": "GA"
    },
    {
      "place": "Walker County",
      "state": "GA"
    }
  ],
  "battle_name": "Davis' Cross Roads"
}