{
  "dates": "January 10, 1862",
  "operation": false,
  "url": "http://www.nps.gov/hps/abpp/battles/ky005.htm",
  "results_text": "Union victory (indecisive)",
  "casualties_text": "92 total (US 27; CS 65)",
  "description": "More than a month after Confederate Col. John S. Williams left Kentucky, following the fight at Ivy Mountain, Brig. Gen. Humphrey Marshall led another force into southeast Kentucky to continue recruiting activities. From his headquarters in Paintsville, on the Big Sandy River, northwest of Prestonsburg, Marshall recruited volunteers and had a force of more than 2,000 men by early January, but could only partially equip them. Union Brig. Gen. Don Carlos Buell directed Col. James Garfield to force Marshall to retreat back into Virginia. Leaving Louisa, Garfield took command of the 18th Brigade and began his march south on Paintsville. He compelled the Confederates to abandon Paintsville and retreat to the vicinity of Prestonsburg. Garfield slowly headed south, but swampy areas and numerous streams slowed his movements, and he arrived in the vicinity of Marshall on the 9th. Heading out at 4:00 am on January 10, Garfield marched a mile south to the mouth of Middle Creek, fought off some Rebel cavalry and turned west to attack Marshall. Marshall had put his men in line of battle west and south of the creek near its forks. Garfield attacked shortly after noon, and the fighting continued for most of the afternoon until Union reinforcements arrived in time to dissuade the Confederates from assailing the Federal left. Instead, the Rebels retired south and were ordered back to Virginia on the 24th. Garfield's force moved to Prestonsburg after the fight and then retired to Paintsville. Union forces had halted the Confederate 1861 offensive in Kentucky, and Middle Creek demonstrated that their strength had not diminished. This victory, along with Mill Springs a little more than a week later, cemented Union control of eastern Kentucky until Confederate Gen. Braxton Bragg launched his offensive in the summer and fall. Following these two January victories in Kentucky, the Federals carried the war into Tennessee in February.",
  "start_date": "1862-01-10",
  "forces_text": "18th Brigade [US]; brigade [CS]",
  "belligerents": {
    "CS": {
      "commanders": [
        {
          "navy": false,
          "last_name": "Marshall",
          "middle_name": "",
          "rank": "Brigadier General",
          "suffix": "",
          "fullname": "Humphrey Marshall",
          "first_name": "Humphrey"
        }
      ],
      "description": "brigade",
      "brigades": 1,
      "casualties": 65
    },
    "US": {
      "commanders": [
        {
          "navy": false,
          "last_name": "Garfield",
          "middle_name": "",
          "rank": "Colonel",
          "suffix": "",
          "fullname": "James Garfield",
          "first_name": "James"
        }
      ],
      "description": "18th Brigade",
      "brigades": 1,
      "casualties": 27
    }
  },
  "campaign": "Offensive in Eastern Kentucky [January 1862]",
  "battle": "KY005",
  "result": "Union",
  "significance": "C",
  "other_names": null,
  "state": "KY",
  "preservation": "III.3",
  "principal_commanders": "Col. James Garfield [US]; Brig. Gen. Humphrey Marshall [CS]",
  "end_date": "1862-01-10",
  "cwsac_reference": "KY005",
  "casualties": 92,
  "location": [
    {
      "place": "Floyd County",
      "state": "KY"
    }
  ],
  "battle_name": "Middle Creek"
}