{
  "battle": "KY007",
  "operation": false,
  "cwsac_reference": "KY007",
  "forces": {
    "Confederate": {
      "casualties": 750,
      "commanders": [
        {
          "middle_name": "Kirby",
          "last_name": "Smith",
          "suffix": "",
          "first_name": "E.",
          "rank": "Major General",
          "fullname": "E. Kirby Smith",
          "navy": false
        }
      ],
      "description": "Army of Kentucky",
      "armies": 1
    },
    "US": {
      "casualties": 4900,
      "commanders": [
        {
          "middle_name": "",
          "last_name": "Nelson",
          "suffix": "",
          "first_name": "William",
          "rank": "Major General",
          "fullname": "William Nelson",
          "navy": false
        }
      ],
      "brigades": 2,
      "description": "1st and 2nd Brigades, Army of Kentucky"
    }
  },
  "url": "http://www.nps.gov/abpp/battles/ky007.htm",
  "forces_text": "1st and 2nd Brigades, Army of Kentucky [US]; Army of Kentucky [CS]",
  "casualties_text": "5,650 total (US 4,900; CS 750)",
  "results_text": "Confederate victory",
  "dates": "August 29-30, 1862",
  "result": "Confederate",
  "other_names": null,
  "significance": "B",
  "preservation": "II.2",
  "state": "KY",
  "campaign": "Confederate Heartland Offensive [June-October 1862]",
  "end_date": "1862-08-30",
  "description": "In Maj. Gen. Kirby Smith's 1862 Confederate offensive into Kentucky, Brig. Gen. Patrick R. Cleburne led the advance with Col. John S. Scott's cavalry out in front. The Rebel cavalry, while moving north from Big Hill on the road to Richmond, Kentucky, on August 29, encountered Union troopers and began skirmishing. After noon, Union artillery and infantry joined the fray, forcing the Confederate cavalry to retreat to Big Hill. At that time, Brig. Gen. Mahlon D. Manson, who commanded Union forces in the area, ordered a brigade to march to Rogersville, toward the Rebels. Fighting for the day stopped after pursuing Union forces briefly skirmished with Cleburne's men in late afternoon. That night, Manson informed his superior, Maj. Gen. William Nelson, of his situation, and he ordered another brigade to be ready to march in support, when required. Kirby Smith ordered Cleburne to attack in the morning and promised to hurry reinforcements (Churchill's division). Cleburne started early, marching north, passed through Kinston, dispersed Union skirmishers, and approached Manson's battle line near Zion Church. As the day progressed, additional troops joined both sides. Following an artillery duel, the battle began, and after a concerted Rebel attack on the Union right, the Yankees gave way. Retreating into Rogersville, the Yankees made another futile stand at their old bivouac. By now, Smith and Nelson had arrived and taken command of their respective armies. Nelson rallied some troops in the cemetery outside Richmond, but they were routed. Nelson and some men escaped but the Rebels captured approximately 4,000 Yankees. The way north was open.",
  "location": [
    {
      "state": "KY",
      "place": "Madison County"
    }
  ],
  "battle_name": "Richmond",
  "start_date": "1862-08-29",
  "casualties": 5650,
  "principal_commanders": "Maj. Gen. William Nelson [US]; Maj. Gen. E. Kirby Smith [CS]"
}