{
  "battle": "KY004",
  "operation": false,
  "cwsac_reference": "KY004",
  "forces": {
    "Confederate": {
      "casualties": 91,
      "strength_min": 1350,
      "commanders": [
        {
          "middle_name": "C.",
          "last_name": "Hindman",
          "suffix": "",
          "first_name": "Thomas",
          "rank": "Brigadier General",
          "fullname": "Thomas C. Hindman",
          "navy": false
        }
      ],
      "description": "Terry's Texas Rangers, 7th Texas Cavalry and 1st Arkansas Battalion (approx. 1,350 men)",
      "strength_max": 1350
    },
    "US": {
      "casualties": 40,
      "commanders": [
        {
          "middle_name": "",
          "last_name": "Willich",
          "suffix": "",
          "first_name": "August",
          "rank": "Colonel",
          "fullname": "August Willich",
          "navy": false
        }
      ],
      "regiments": 1,
      "description": "32nd Indiana Volunteer Infantry Regiment"
    }
  },
  "url": "http://www.nps.gov/abpp/battles/ky004.htm",
  "forces_text": "32nd Indiana Volunteer Infantry Regiment [US]; Terry's Texas Rangers, 7th Texas Cavalry and 1st Arkansas Battalion (approx. 1,350 men) [CS]",
  "casualties_text": "131 total (US 40; CS 91)",
  "results_text": "Indecisive",
  "dates": "December 17, 1861",
  "result": "Inconclusive",
  "other_names": [
    "Woodsonville",
    "Green River"
  ],
  "significance": "D",
  "preservation": "III.4",
  "state": "KY",
  "campaign": "Operations in Eastern Kentucky [September-December 1861]",
  "end_date": "1861-12-17",
  "description": "After Brig. Gen. Don Carlos Buell took command of the Department of the Ohio in early November, he attempted to consolidate control by organizing and sending troops into the field. He ordered Brig. Gen. Alexander McD. McCook, commanding the 2nd Division, to Nolin, Kentucky. In the meantime, the Confederates had established a defensive line along the Green River near Munfordville. McCook launched a movement towards the enemy lines on December 10, which the Rebels countered by partially destroying the Louisville & Nashville Railroad bridge over the Green River. As a result, the Union sent two companies of the 32nd Indiana Volunteer Infantry Regiment across the river to prevent a surprise and began constructing a pontoon bridge for the passage of trains and artillery. When the bridge was completed on December 17, four more of the 32nd Indiana companies crossed the river. The combined force advanced to a hill south of Woodsonville where, in the afternoon, they spotted enemy troops in the woods fronting them. Two companies advanced toward the enemy in the woods, which fell back until Confederate cavalry attacked. A general engagement ensued as eight Yankee companies fought a much larger Confederate force. Fearing that the enemy might roll up his right flank, Col. August Willich, commanding the regiment, ordered a withdrawal to a stronger position in the rear. Knowing of McCook's approach, the Rebels also withdrew from the field. Although the results of the battle were indecisive, Union troops did occupy the area and insured the movement of their men and supplies on the Louisville & Nashville Railroad.",
  "location": [
    {
      "state": "KY",
      "place": "Hart County"
    }
  ],
  "battle_name": "Rowlett's Station",
  "start_date": "1861-12-17",
  "casualties": 131,
  "principal_commanders": "Col. August Willich [US]; Brig. Gen. Thomas C. Hindman [CS]"
}