{
  "dates": "April 16-28, 1862",
  "operation": false,
  "url": "http://www.nps.gov/hps/abpp/battles/la001.htm",
  "results_text": "Union victory",
  "casualties_text": "1,011 total (US 229; CS 782)",
  "description": "Early Union plans had called for the division of the Confederacy by seizing control of the Mississippi River. One of the first steps in such operations was to enter the mouth of the Mississippi River, ascend to New Orleans and capture the city, closing off the entrance to Rebel ships. In mid-January 1862, Flag-Officer David G. Farragut undertook this enterprise with his West Gulf Blockading Squadron. The way was soon open except for the two forts, Jackson and St. Philip, above the Head of the Passes, approximately seventy miles below New Orleans. In addition to the forts and their armament, the Confederates had placed obstructions in the river and there were a number of ships, including two ironclads, to assist in the defense. Farragut based his operations from Ship Island, Mississippi, and on April 8, he assembled 24 of his vessels and Comdr. David D. Porter's 19 mortar schooners near the Head of the Passes. Starting on the 16th and continuing for seven days, the mortar schooners bombarded Fort Jackson but failed to silence its guns. Some of Farragut's gunboats opened a way through the obstruction on the night of the 22nd. Early on the morning of the 24th, Farragut sent his ships north to pass the forts and head for New Orleans. Although the Rebels attempted to stop the Union ships in various ways, most of the force successfully passed the forts and continued on to New Orleans where Farragut accepted the city's surrender. With the passage of the forts, nothing could stop the Union forces: the fall of New Orleans was inevitable and anti-climatic. Cut off and surrounded, the garrisons of the two forts surrendered on the 28th.",
  "start_date": "1862-04-16",
  "forces_text": "West Gulf Blockading Squadron [US]; Garrisons of Forts Jackson and St. Philip and the crews of various ships [CS]",
  "belligerents": {
    "CS": {
      "commanders": [
        {
          "navy": false,
          "last_name": "Duncan",
          "middle_name": "K.",
          "rank": "Brigadier General",
          "suffix": "",
          "fullname": "Johnson K. Duncan",
          "first_name": "Johnson"
        },
        {
          "navy": true,
          "last_name": "Mitchell",
          "middle_name": "K.",
          "rank": "Commander",
          "suffix": "",
          "fullname": "John K. Mitchell",
          "first_name": "John"
        }
      ],
      "description": "Garrisons of Forts Jackson and St. Philip and the crews of various ships",
      "casualties": 782
    },
    "US": {
      "commanders": [
        {
          "navy": true,
          "last_name": "Farragut",
          "middle_name": "G.",
          "rank": "Flag Officer",
          "suffix": "",
          "fullname": "David G. Farragut",
          "first_name": "David"
        }
      ],
      "description": "West Gulf Blockading Squadron",
      "casualties": 229
    }
  },
  "campaign": "Expedition to, and Capture of, New Orleans [April-May 1862]",
  "battle": "LA001",
  "result": "Union",
  "significance": "A",
  "other_names": null,
  "state": "LA",
  "preservation": "IV.1",
  "principal_commanders": "Flag-Officer David G. Farragut [US]; Brig. Gen. Johnson K. Duncan and Cdr. John K. Mitchell [CS]",
  "end_date": "1862-04-28",
  "cwsac_reference": "LA001",
  "casualties": 1011,
  "location": [
    {
      "place": "Plaquemines Parish",
      "state": "LA"
    }
  ],
  "battle_name": "Forts Jackson and St. Philip"
}