{
  "dates": "October 27, 1862",
  "operation": false,
  "url": "http://www.nps.gov/hps/abpp/battles/la005.htm",
  "results_text": "Union victory",
  "casualties_text": "315 total (US 86; CS 229)",
  "description": "Maj. Gen. Benjamin F. Butler, commanding Union forces in the Department of the Gulf, launched an expedition into the Bayou Lafourche region to eliminate the Rebel threat from that area, to make sure that sugar and cotton products from there would come into Union hands and, in the future, to use it as a base for other military operations. He organized a brigade of about 4,000 men under the command of his protege Brig. Gen. Godfrey Weitzel to accomplish the missions. On October 25, Weitzel and his men arrived at Donaldsonville, where the Lafourche meets the Mississippi, and began an advance up the east bank of the bayou. The Confederates under the command of Brig. Gen. Alfred Mouton attempted to concentrate to meet the threat. By the 27th, the Confederates had occupied a position on the bayou above Labadieville. A little more than half the force was on the east bank while the rest of the men were on the west bank near Georgia Landing, generally without means of concentrating on one side or the other. As the Federal troops continued down the east bank, they encountered the Rebels at about 11:00 am and began skirmishing. The Confederates fell back quickly. Weitzel then began crossing his men to the west bank to attack the Rebel troops there. For some time, these Confederate troops fought resolutely and brought the Union assault to a standstill. The Rebels, however, ran out of artillery ammunition and had to withdraw to Labadieville, opening up this portion of the Lafourche to the Union.",
  "start_date": "1862-10-27",
  "forces_text": "Reserve brigade, Department of the Gulf [US]; 18th Louisiana Infantry Regiment, Crescent Regiment, Ralston's Battery, Detachment of Cavalry, 33rd Louisiana Infantry Regiment, Terre Bonne Regiment Louisiana Militia, Semmes's Battery and 2nd Louisiana Cavalry Regiment (approx. 1,392 men) [CS]",
  "belligerents": {
    "CS": {
      "commanders": [
        {
          "navy": false,
          "last_name": "Mouton",
          "middle_name": "",
          "rank": "Brigadier General",
          "suffix": "",
          "fullname": "Alfred Mouton",
          "first_name": "Alfred"
        }
      ],
      "description": "18th Louisiana Infantry Regiment, Crescent Regiment, Ralston's Battery, Detachment of Cavalry, 33rd Louisiana Infantry Regiment, Terre Bonne Regiment Louisiana Militia, Semmes's Battery and 2nd Louisiana Cavalry Regiment (approx. 1,392 men)",
      "strength_max": 1392,
      "strength_min": 1392,
      "casualties": 229
    },
    "US": {
      "commanders": [
        {
          "navy": false,
          "last_name": "Weitzel",
          "middle_name": "",
          "rank": "Brigadier General",
          "suffix": "",
          "fullname": "Godfrey Weitzel",
          "first_name": "Godfrey"
        }
      ],
      "description": "Reserve brigade, Department of the Gulf",
      "brigades": 1,
      "casualties": 86
    }
  },
  "campaign": "Operations in LaFourche District [October 1862]",
  "battle": "LA005",
  "result": "Union",
  "significance": "C",
  "other_names": [
    "Labadieville",
    "Texana"
  ],
  "state": "LA",
  "preservation": "IV.1",
  "principal_commanders": "Brig. Gen. Godfrey Weitzel [US]; Brig. Gen. Alfred Mouton [CS]",
  "end_date": "1862-10-27",
  "cwsac_reference": "LA005",
  "casualties": 315,
  "location": [
    {
      "place": "Lafourche Parish",
      "state": "LA"
    }
  ],
  "battle_name": "Georgia Landing"
}