{
  "battle": "LA011",
  "operation": false,
  "cwsac_reference": "LA011",
  "forces": {
    "Confederate": {
      "casualties": 185,
      "commanders": [
        {
          "middle_name": "E.",
          "last_name": "McCulloch",
          "suffix": "",
          "first_name": "Henry",
          "rank": "Brigadier General",
          "fullname": "Henry E. McCulloch",
          "navy": false
        }
      ],
      "brigades": 1,
      "description": "McCulloch's Brigade"
    },
    "US": {
      "casualties": 652,
      "commanders": [
        {
          "middle_name": "",
          "last_name": "Lieb",
          "suffix": "",
          "first_name": "Hermann",
          "rank": "Colonel",
          "fullname": "Hermann Lieb",
          "navy": false
        }
      ],
      "regiments": 1,
      "brigades": 1,
      "description": "African Brigade and the 23rd Iowa Volunteer Infantry"
    }
  },
  "url": "http://www.nps.gov/abpp/battles/la011.htm",
  "forces_text": "African Brigade and the 23rd Iowa Volunteer Infantry [US]; McCulloch's Brigade [CS]",
  "casualties_text": "837 total (US 652; CS 185)",
  "results_text": "Union victory",
  "dates": "June 7, 1863",
  "result": "Union",
  "other_names": null,
  "significance": "C",
  "preservation": "IV.2",
  "state": "LA",
  "campaign": "Grant's Operations Against Vicksburg [March-July 1863]",
  "end_date": "1863-06-07",
  "description": "On June 6, Col. Hermann Lieb with the African Brigade and two companies of the 10th Illinois Cavalry made a reconnaissance toward Richmond, Louisiana. About three miles from Richmond, Lieb encountered enemy troops at the Tallulah railroad depot and drove them back but then retired, fearing that many more Rebels might be near. While retiring, a squad of Union cavalry appeared, fleeing from a force of Rebels. Lieb got his men into battle line and helped disperse the pursuing enemy. He then retired to Milliken's Bend and informed his superior by courier of his actions. The 23rd Iowa Infantry and two gunboats came to his assistance. Around 3:00 am on June 7, Rebels appeared in force and drove in the pickets. They continued their movement towards the Union left flank. The Federal forces fired some volleys that caused the Rebel line to pause momentarily, but the Texans soon pushed on to the levee where they received orders to charge. In spite of receiving more volleys, the Rebels came on, and hand-to-hand combat ensued. In this intense fighting, the Confederates succeeded in flanking the Union force and caused tremendous casualties with enfilade fire. The Union force fell bank to the river's bank. About that time Union gunboats Choctaw and Lexington appeared and fired upon the Rebels. The Confederates continued firing and began extending their right to envelop the Federals but failed in their objective. Fighting continued until noon when the Confederates withdrew. The Union pursued, firing many volleys, and the gunboats pounded the Confederates as they retreated to Walnut Bayou.",
  "location": [
    {
      "state": "LA",
      "place": "Madison Parish"
    }
  ],
  "battle_name": "Milliken's Bend",
  "start_date": "1863-06-07",
  "casualties": 837,
  "principal_commanders": "Col. Hermann Lieb [US]; Brig. Gen. Henry E. McCulloch [CS]"
}