{
  "battle": "LA016",
  "operation": false,
  "cwsac_reference": "LA016",
  "forces": {
    "Confederate": {
      "casualties": 121,
      "commanders": [
        {
          "middle_name": "",
          "last_name": "Green",
          "suffix": "",
          "first_name": "Tom",
          "rank": "Brigadier General",
          "fullname": "Tom Green",
          "navy": false
        }
      ],
      "description": "forces on the Atchafalaya River"
    },
    "US": {
      "casualties": 454,
      "divisions": 1,
      "commanders": [
        {
          "middle_name": "J.T.",
          "last_name": "Dana",
          "suffix": "",
          "first_name": "Napoleon",
          "rank": "Major General",
          "fullname": "Napoleon J.T. Dana",
          "navy": false
        }
      ],
      "description": "2nd Division, XIII Army Corps"
    }
  },
  "url": "http://www.nps.gov/abpp/battles/la016.htm",
  "forces_text": "2nd Division, XIII Army Corps [US]; forces on the Atchafalaya River [CS]",
  "casualties_text": "575 total (US 454; CS 121)",
  "results_text": "Confederate victory",
  "dates": "September 29, 1863",
  "result": "Confederate",
  "other_names": [
    "Fordoche Bridge"
  ],
  "significance": "D",
  "preservation": "III.4",
  "state": "LA",
  "campaign": "Taylor's Operations in West Louisiana [June-September 1863]",
  "end_date": "1863-09-29",
  "description": "Following the Union defeat at Sabine Pass earlier in the month, Maj. Gen. Nathaniel P. Banks intended to occupy important locations in Texas. He decided to send troops up the Bayou Teche, disembark them on the plains and march overland to Texas. Maj. Gen. Ulysses S. Grant sent him a division, commanded by Maj. Gen. Napoleon J.T. Dana to garrison Morganza and prevent Rebel troops from operating on the Atchafalaya River. A 1,000-man detachment, under the command of Lt. Col. J.B. Leake, was at Stirling's Plantation to guard the road to the Atchafalaya River and deter any enemy troops from passing by. Brig. Gen. Alfred Mouton, commander of the Sub-District of Southwestern Louisiana, decided that he had a favorable opportunity to defeat the Union forces around Fordoche Bridge. On September 19, he instructed Brig. Gen. Tom Green to prepare for such an attack. Mouton provided Green with reinforcements and gave the order to attack on the 25th. Green's force began crossing the Atchafalaya River on the 28th, and all were over after midnight of the 29th. At dawn on the 29th, Green's men marched out. Confederate cavalry began skirmishing with Union pickets at Fordoche Bridge before noon and continued for about a half hour. Green's other troops then hit the Union force, drove them and captured many, although most of the Federal cavalry found an escape route. Although Dana sent reinforcements, mud and rain slowed their progress and allowed Green to get away. Green had defeated this Union force handily, but it did not deter Banks from his intended movement.",
  "location": [
    {
      "state": "LA",
      "place": "Pointe Coupeé Parish"
    }
  ],
  "battle_name": "Stirling's Plantation",
  "start_date": "1863-09-29",
  "casualties": 575,
  "principal_commanders": "Maj. Gen. Napoleon J.T. Dana [US]; Brig. Gen. Tom Green [CS]"
}