{
  "dates": "October 25, 1861",
  "operation": false,
  "url": "http://www.nps.gov/hps/abpp/battles/mo008.htm",
  "results_text": "Union victory",
  "casualties_text": "218 total (US 85; CS 133)",
  "description": "Having accomplished little since taking command of the Western Department, with headquarters in St. Louis, Missouri, Maj. Gen. John C. Frémont formulated a plan to clear Maj. Gen. Sterling Price's Rebels from the state and then, if possible, carry the war into Arkansas and Louisiana. Leaving St. Louis on October 7, 1861, Frémont's combined force eventually numbered more than 20,000. His accompanying cavalry force, numbering 5,000 men and other mounted troops, included Maj. Frank J. White's Prairie Scouts and Frémont's Body Guards under Maj. Charles Zagonyi. Maj. White became ill and turned his command over to Zagonyi. These two units operated in front of Frémont's army to gather intelligence. As Frémont neared Springfield, the local state guard commander, Col. Julian Frazier, sent out requests to nearby localities for additional troops. Frémont camped on the Pomme de Terre River, about 50 miles from Springfield. Zagonyi's column, though, continued on to Springfield, and Frazier's force of 1,000 to 1,500 prepared to meet it. Frazier set up an ambush along the road that Zagonyi travelled, but the Union force charged the Rebels, sending them fleeing. Zagonyi's men continued into town, hailed Federal sympathizers and released Union prisoners. Leery of a Confederate counterattack, Zagonyi departed Springfield before night, but Frémont's army returned, in force, a few days later and set up camp in the town. In mid-November, after Frémont was sacked and replaced by Maj. Gen. Hunter, the Federals evacuated Springfield and withdrew to Sedalia and Rolla. Federal troops reoccupied Springfield in early 1862 and it was a Union stronghold from then on. This engagement at Springfield was the only Union victory in southwestern Missouri in 1861.",
  "start_date": "1861-10-25",
  "forces_text": "Prairie Scouts and Frémont's Body Guard [US]; Missouri State Guard troops [CS]",
  "belligerents": {
    "CS": {
      "commanders": [
        {
          "navy": false,
          "last_name": "Frazier",
          "middle_name": "",
          "rank": "Colonel",
          "suffix": "",
          "fullname": "James Frazier",
          "first_name": "James"
        }
      ],
      "description": "Missouri State Guard troops",
        "casualties": 133,
        "missouri_state_guard": true
    },
    "US": {
      "commanders": [
        {
          "navy": false,
          "last_name": "Zagonyi",
          "middle_name": "",
          "rank": "Major",
          "suffix": "",
          "fullname": "James Zagonyi",
          "first_name": "James"
        }
      ],
      "description": "Prairie Scouts and Frémont's Body Guard",
      "casualties": 85
    }
  },
  "campaign": "Operations to Control Missouri [June-October 1861]",
  "battle": "MO008",
  "result": "Union",
  "significance": "D",
  "other_names": [
    "Zagonyi's Charge"
  ],
  "state": "MO",
  "preservation": "IV.2",
  "principal_commanders": "Maj. James Zagonyi [US]; Col. James Frazier [CS]",
  "end_date": "1861-10-25",
  "cwsac_reference": "MO008",
  "casualties": 218,
  "location": [
    {
      "place": "Greene County",
      "state": "MO"
    }
  ],
  "battle_name": "Springfield"
}
