{
  "dates": "October 21, 1864",
  "operation": false,
  "url": "http://www.nps.gov/hps/abpp/battles/mo024.htm",
  "results_text": "Confederate victory",
  "casualties_text": "Unknown",
  "description": "Price's march along the Missouri River was slow, providing the Yankees a chance to concentrate. Maj. Gen. William S. Rosecrans, commanding the Department of the Missouri, proposed a pincer movement to trap Price and his army, but he was unable to communicate with Maj. Gen. Samuel R. Curtis, commander of the Department of Kansas, to formalize the plan. Curtis was having problems because many of his troops were Kansas militia and they refused to enter Missouri, but a force of about 2,000 men under the command of Maj. Gen. James G. Blunt did set out for Lexington. He met the Confederate troops at Lexington on the 19th, slowed their progress, but was defeated and retreated. On the 20th, Blunt's troops arrived on the Little Blue River, eight miles east of Independence. The Union force prepared to engage the Confederates again in a strong defensive position on the west bank. Curtis, however, ordered Blunt into Independence while leaving a small force, under Col. Thomas Moonlight, on the Little Blue. The next day, Curtis ordered Blunt to take all of the volunteers and return to the Little Blue. As he neared the stream, he discovered that Moonlight's small force had burned the bridge as ordered, engaged the enemy, and retreated away from the strong defensive position occupied the day before, crossing the river. Blunt entered the fray and attempted to drive the enemy back beyond the defensive position that he wished to reoccupy. The Yankees forced the Confederates to fall back, at first, but their numerical superiority took its toll in the five-hour battle. The Federals retreated to Independence and went into camp there after dark. Once again, the Confederates had been slowed and more Union reinforcements were arriving.",
  "start_date": "1864-10-21",
  "forces_text": "1st Division, Army of the Border [US]; Army of Missouri [CS]",
  "belligerents": {
    "CS": {
      "commanders": [
        {
          "navy": false,
          "last_name": "Price",
          "middle_name": "",
          "rank": "Major General",
          "suffix": "",
          "fullname": "Sterling Price",
          "first_name": "Sterling"
        }
      ],
      "armies": 1,
      "description": "Army of Missouri"
    },
    "US": {
      "commanders": [
        {
          "navy": false,
          "last_name": "Curtis",
          "middle_name": "R.",
          "rank": "Major General",
          "suffix": "",
          "fullname": "Samuel R. Curtis",
          "first_name": "Samuel"
        }
      ],
      "divisions": 1,
      "description": "1st Division, Army of the Border"
    }
  },
  "campaign": "Price's Missouri Expedition [September-October 1864]",
  "battle": "MO024",
  "result": "Confederate",
  "significance": "D",
  "other_names": [
    "Westport"
  ],
  "state": "MO",
  "preservation": "IV.1",
  "principal_commanders": "Maj. Gen. Samuel R. Curtis [US]; Maj. Gen. Sterling Price [CS]",
  "end_date": "1864-10-21",
  "cwsac_reference": "MO024",
  "casualties": null,
  "location": [
    {
      "place": "Jackson County",
      "state": "MO"
    }
  ],
  "battle_name": "Little Blue River"
}