{
  "dates": "September 19, 1862",
  "operation": false,
  "url": "http://www.nps.gov/hps/abpp/battles/ms001.htm",
  "results_text": "Union victory (In addition, it caused Grant to have concern about Rosecrans's abilities and leadership.)",
  "casualties_text": "1,482 total (US 782; CS 700)",
  "description": "Maj. Gen. Sterling Price's Army of the West main column marched into Iuka, Mississippi, on September 14. Price's superior, Gen. Braxton Bragg, the commander of the Confederate Army of the Mississippi, who was leading an offensive deep into Kentucky, ordered him to prevent Maj. Gen. William S. Rosecrans's Army of the Mississippi troops from moving into Middle Tennessee and reinforcing Brig. Gen. James Negley's division of Maj. Gen. Don Carlos Buell's Army of the Ohio, which was garrisoning Nashville. Price had about 14,000 men, and he was informed that, if necessary, he could request assistance from Maj. Gen. Earl Van Dorn, commanding the District of the Mississippi, headquartered at Holly Springs. Maj. Gen. Ulysses S. Grant, commanding the Army of the Tennessee, feared that Price intended to go north to join Bragg against Buell. Grant devised a plan for his left wing commander, Maj. Gen. E.O.C. Ord, and his men to advance on Iuka from the west; Rosecrans's forces were to march from the southwest, arrive at Iuka on the 18th, and make a coordinated attack the next day. Ord arrived on time and skirmishing ensued between his reconnaissance patrol and Confederate pickets, about six miles from Iuka, before nightfall. Rosecrans informed Grant that he would not arrive at Iuka on the 18th but would begin his march at 4:30 am, the next morning. On the 19th, Ord sent Price a message demanding that he surrender, but Price refused. At the same time, Price received dispatches from Van Dorn suggesting that their two armies rendezvous, as soon as possible, at Rienzi for attacks on the Federal forces in the area. Price informed Van Dorn that the military situation had changed so he could not evacuate Iuka immediately. He did, however, issue orders for his men to prepare for a march the next day, to rendezvous with Van Dorn. Rosecrans's army marched early on the 19th, but, instead of using two roads as directed, it followed the Jacinto (Bay Springs) Road. After considering the amount of time that Rosecrans required to reach Iuka, Grant determined that he probably would not arrive on the 19th, so he ordered Ord to await the sound of fighting between Rosecrans and Price before engaging the Confederates. As Rosecrans advanced, his men fought actions with Confederate troops at points along the way. About 4:00 pm, just after ascending a hill, the Union column halted because the Confederates were well-placed below in a ravine, filled with timber and underbrush. The Confederates launched attacks up the hill, capturing a six-gun Ohio battery, while the Federals counterattacked from the ridge. Fighting, which Price later stated he had \"never seen surpassed,\" continued until after dark; the Union troops camped for the night behind the ridge. Price had redeployed troops from Ord's front to fight against Rosecrans's people. Ord did nothing, later proclaiming that he never heard any fighting and, therefore, never engaged the enemy; Grant also remarked that he had heard no sounds of battle. Following the fighting on the 19th, Price determined to reengage the enemy the next day, but his subordinates convinced him, instead, to march to join Van Dorn, as earlier planned. At the same time, Rosecrans redeployed his men for fighting the next day. Price's army evacuated via the uncovered Fulton Road, protected its rear with a heavy rearguard and hooked up with Van Dorn five days later at Ripley. Although Rosecrans was supposed to traverse Fulton Road and cover it, he stated that he had not guarded the road because he feared dividing his force; Grant later approved this decision. Rosecrans's army occupied Iuka and then mounted a pursuit; the Confederate rearguard and overgrown terrain prevented the Union pursuit from accomplishing much. The Federals should have destroyed or captured Price's army, but instead the Rebels joined Van Dorn and assaulted Corinth in October.",
  "start_date": "1862-09-19",
  "forces_text": "2nd Division and cavalry division, Army of the Mississippi (approx. 4,000-4,500) [US]; 1st Division, Army of the West (approx. 3,200) [CS]",
  "belligerents": {
    "CS": {
      "commanders": [
        {
          "navy": false,
          "last_name": "Price",
          "middle_name": "",
          "rank": "Major General",
          "suffix": "",
          "fullname": "Sterling Price",
          "first_name": "Sterling"
        }
      ],
      "description": "1st Division, Army of the West (approx. 3,200)",
      "strength_max": 3200,
      "strength_min": 3200,
      "casualties": 700
    },
    "US": {
      "commanders": [
        {
          "navy": false,
          "last_name": "Rosecrans",
          "middle_name": "S.",
          "rank": "Major General",
          "suffix": "",
          "fullname": "William S. Rosecrans",
          "first_name": "William"
        }
      ],
      "description": "2nd Division and cavalry division, Army of the Mississippi (approx. 4,000-4,500)",
      "strength_max": 4000,
      "strength_min": 4000,
      "casualties": 782
    }
  },
  "campaign": "Iuka and Corinth Operations [September-October 1862]",
  "battle": "MS001",
  "result": "Union",
  "significance": "C",
  "other_names": null,
  "state": "MS",
  "preservation": "IV.1",
  "principal_commanders": "Maj. Gen. William S. Rosecrans [US]; Maj. Gen. Sterling Price [CS]",
  "end_date": "1862-09-19",
  "cwsac_reference": "MS001",
  "casualties": 1482,
  "location": [
    {
      "place": "Tishomingo County",
      "state": "MS"
    }
  ],
  "battle_name": "Iuka"
}