{
  "dates": "April 29-May 1, 1863",
  "operation": false,
  "url": "http://www.nps.gov/hps/abpp/battles/ms005.htm",
  "results_text": "Confederate victory",
  "casualties_text": "Unknown",
  "description": "To insure that troops were not withdrawn to Grand Gulf to assist Confederates there, a combined Union army-navy force feigned an attack on Snyder's Bluff, Mississippi. After noon, on April 29th, Lt. Cdr. K. Randolph Breese, with his eight gunboats and ten transports carrying Maj. Gen. Francis Blair's division, inched up the Yazoo River to the mouth of Chickasaw Bayou where they spent the night. At 9:00 am, the next morning, the force, minus one gunboat, continued upriver to Drumgould's Bluff and engaged the enemy batteries. During the fighting, Choctaw suffered more than fifty hits, but no casualties occurred. Around 6:00 pm, the troops disembarked and marched along Blake's Levee toward the guns. As they neared Drumgould's Bluff, a battery opened on them, creating havoc and casualties. The Union advance halted and, after dark, the men reembarked on the transports. The next morning, transports disembarked other troops. The swampy terrain and enemy heavy artillery fire forced them to retire. The gunboats opened fire again, about 3:00 pm on the 1st, causing some damage. Later, the boats' fire slackened and stopped altogether after dark. Sherman had received orders to land his troops at Milliken's Bend, so the gunboats returned to their anchorages at the mouth of the Yazoo.",
  "start_date": "1863-04-29",
  "forces_text": "XV Army Corps, Department of the Tennessee [US]; Hébert's Brigade [CS]",
  "belligerents": {
    "CS": {
      "commanders": [
        {
          "navy": false,
          "last_name": "Hébert",
          "middle_name": "",
          "rank": "Brigadier General",
          "suffix": "",
          "fullname": "Louis Hébert",
          "first_name": "Louis"
        }
      ],
      "brigades": 1,
      "description": "Hébert's Brigade"
    },
    "US": {
      "commanders": [
        {
          "navy": false,
          "last_name": "Sherman",
          "middle_name": "T.",
          "rank": "Major General",
          "suffix": "",
          "fullname": "William T. Sherman",
          "first_name": "William"
        }
      ],
      "description": "XV Army Corps, Department of the Tennessee",
      "corps": 1
    }
  },
  "campaign": "Grant's Operations Against Vicksburg [March-July 1863]",
  "battle": "MS005",
  "result": "Confederate",
  "significance": "D",
  "other_names": [
    "Snyder's Mill"
  ],
  "state": "MS",
  "preservation": "II.4",
  "principal_commanders": "Maj. Gen. William T. Sherman [US]; Brig. Gen. Louis Hébert [CS]",
  "end_date": "1863-05-01",
  "cwsac_reference": "MS005",
  "casualties": null,
  "location": [
    {
      "place": "Warren County",
      "state": "MS"
    }
  ],
  "battle_name": "Snyder's Bluff"
}