{
  "dates": "May 16, 1863",
  "operation": false,
  "url": "http://www.nps.gov/hps/abpp/battles/ms009.htm",
  "results_text": "Union victory",
  "casualties_text": "6,757 total (US 2,457; CS 4,300)",
  "description": "Following the Union occupation of Jackson, Mississippi, both Confederate and Federal forces made plans for future operations. Gen. Joseph E. Johnston retreated, with most of his army, up the Canton Road, but he ordered Lt. Gen. John C. Pemberton, commanding about 23,000 men, to leave Edwards Station and attack the Federals at Clinton. Pemberton and his generals felt that Johnston's plan was dangerous and decided instead to attack the Union supply trains moving from Grand Gulf to Raymond. On May 16, though, Pemberton received another order from Johnston repeating his former directions. Pemberton had already started after the supply trains and was on the Raymond-Edwards Road with his rear at the crossroads one-third mile south of the crest of Champion Hill. Thus, when he ordered a countermarch, his rear, including his many supply wagons, became the advance of his force. On May 16, 1863, about 7:00 am, the Union forces engaged the Confederates and the Battle of Champion Hill began. Pemberton's force drew up into a defensive line along a crest of a ridge overlooking Jackson Creek. Pemberton was unaware that one Union column was moving along the Jackson Road against his unprotected left flank. For protection, Pemberton posted Brig. Gen. Stephen D. Lee's men atop Champion Hill where they could watch for the reported Union column moving to the crossroads. Lee spotted the Union troops and they soon saw him. If this force was not stopped, it would cut the Rebels off from their Vicksburg base. Pemberton received warning of the Union movement and sent troops to his left flank. Union forces at the Champion House moved into action and emplaced artillery to begin firing. When Grant arrived at Champion Hill, around 10:00 am, he ordered the attack to begin. By 11:30 am, Union forces had reached the Confederate main line and about 1:00 pm, they took the crest while the Rebels retired in disorder. The Federals swept forward, capturing the crossroads and closing the Jackson Road escape route. One of Pemberton's divisions (Bowen's) then counterattacked, pushing the Federals back beyond the Champion Hill crest before their surge came to a halt. Grant then counterattacked, committing forces that had just arrived from Clinton by way of Bolton. Pemberton's men could not stand up to this assault, so he ordered his men from the field to the one escape route still open: the Raymond Road crossing of Bakers Creek. Brig. Gen. Lloyd Tilghman's brigade formed the rearguard, and they held at all costs, including the loss of Tilghman. In the late afternoon, Union troops seized the Bakers Creek Bridge, and by midnight, they occupied Edwards. The Confederates were in full retreat towards Vicksburg. If the Union forces caught these Rebels, they would destroy them.",
  "start_date": "1863-05-16",
  "forces_text": "Army of the Tennessee (three corps) [US]; Department of Mississippi and East Louisiana [CS]",
  "belligerents": {
    "CS": {
      "commanders": [
        {
          "navy": false,
          "last_name": "Pemberton",
          "middle_name": "C.",
          "rank": "Lieutenant General",
          "suffix": "",
          "fullname": "John C. Pemberton",
          "first_name": "John"
        }
      ],
      "description": "Department of Mississippi and East Louisiana",
      "casualties": 4300
    },
    "US": {
      "commanders": [
        {
          "navy": false,
          "last_name": "Grant",
          "middle_name": "S.",
          "rank": "Major General",
          "suffix": "",
          "fullname": "Ulysses S. Grant",
          "first_name": "Ulysses"
        }
      ],
      "description": "Army of the Tennessee (three corps)",
      "corps": 3,
      "casualties": 2457
    }
  },
  "campaign": "Grant's Operations Against Vicksburg [March-July 1863]",
  "battle": "MS009",
  "result": "Union",
  "significance": "A",
  "other_names": [
    "Bakers Creek"
  ],
  "state": "MS",
  "preservation": "II.1",
  "principal_commanders": "Maj. Gen. Ulysses S. Grant [US]; Lt. Gen. John C. Pemberton [CS]",
  "end_date": "1863-05-16",
  "cwsac_reference": "MS009",
  "casualties": 6757,
  "location": [
    {
      "place": "Hinds County",
      "state": "MS"
    }
  ],
  "battle_name": "Champion Hill"
}