{
  "end_date": "1864-02-22",
  "casualties": 150,
  "casualties_text": "150 total (US 100; CS 50)",
  "forces": {
    "Confederate": {
      "casualties": 50,
      "commanders": [
        {
          "rank": "Major General",
          "first_name": "Nathan",
          "suffix": "",
          "navy": false,
          "middle_name": "Bedford",
          "last_name": "Forrest",
          "fullname": "Nathan Bedford Forrest"
        }
      ],
      "cavalry_corps": 1,
      "description": "Forrest's Cavalry Corps"
    },
    "US": {
      "casualties": 100,
      "commanders": [
        {
          "rank": "Brigadier General",
          "first_name": "William",
          "suffix": "",
          "navy": false,
          "middle_name": "Sooy",
          "last_name": "Smith",
          "fullname": "William Sooy Smith"
        }
      ],
      "description": "Cavalry force (7,000)",
      "strength_min": 7000,
      "strength_max": 7000
    }
  },
  "cwsac_reference": "MS013",
  "operation": false,
  "forces_text": "Cavalry force (7,000) [US]; Forrest's Cavalry Corps [CS]",
  "start_date": "1864-02-22",
  "preservation": "II.2",
  "results_text": "Confederate victory",
  "description": "From Vicksburg, Mississippi, Sherman launched a campaign to take the important railroad center at Meridian, Mississippi, and if the situation were favorable, to push on to Selma, Alabama, and threaten Mobile. Sherman ordered Brig. Gen. William Sooy Smith to lead a cavalry force of 7,000 men from Memphis, Tennessee, on February 1, 1864, south through Okolona, along the Mobile & Ohio Railroad, and to meet the rest of the Union force at Meridian, on February 10. With the main force of approximately 20,000 men, Sherman set out on the 3rd for Meridian, but made feints on various other locations. Against orders, Smith delayed ten days, while waiting for reinforcements, and did not start out until February 11. Destroying crops and railroad track along the way, Smith's force met almost no opposition, and, before long, 1,000 former slaves were traveling with them. Smith was supposed to rendezvous with Maj. Gen. William T. Sherman at Meridian on the 10th, but he never arrived there. Sherman left Meridian on the 20th, due in part to apprehension over Smith's whereabouts. Smith neared West Point, 90 miles north of Meridian, on the 20th, and he fought with Confederate cavalry units at Prairie Station and Aberdeen. Smith-knowing that Nathan Bedford Forrest commanded the troops he was fighting, concerned about the fate of the former slaves with him, and not knowing how many of the enemy he faced-decided to concentrate at Prairie Station, and, on the morning of the 21st, he set out for West Point. Shortly after dawn on the 21st, Col. Jeffrey Forrest's Confederate cavalry brigade engaged Smith. Withdrawing at times, Forrest drew Smith into a swamp west of the Tombigbee River. Other Rebel troops arrived and the fighting intensified. Smith was sure that this was a trap set for him, and, discerning that he was greatly outnumbered, he ordered a retreat, leaving a rearguard. The rearguard held off the Confederates for about two hours before withdrawing in good order. About the same time, Maj. Gen. Nathan Bedford Forrest arrived and ordered a pursuit. Skirmishing occurred the rest of the day. At sunup on the 22nd, the Rebels attacked Smith just south of Okolona on the prairie. More Confederate troops arrived, causing breaks in the Union battle line, precipitating a retreat. For most of the rest of the day, they engaged in a running battle for a distance of eleven miles, with both sides attacking and counterattacking. Col. Forrest was killed during one Rebel charge. The Yankees finally broke off the fighting and headed for Pontotoc. Maj. Gen. Nathan Bedford Forrest, the commander on the field, realized that his men were nearly out of ammunition and did not order a pursuit. Mississippi militia harassed Smith to the state line. Smith arrived in Collierville, Tennessee, near Memphis, on the 26th. Although Smith had caused much destruction during his expedition, Okolona forced him to retire before he could do more. Smith's actions against Sherman's orders jeopardized the Meridian Expedition.",
  "state": "MS",
  "significance": "B",
  "other_names": null,
  "dates": "February 22, 1864",
  "battle_name": "Okolona",
  "principal_commanders": "Brig. Gen. William Sooy Smith [US]; Maj. Gen. Nathan Bedford Forrest [CS]",
  "campaign": "Meridian and Yazoo River Expeditions [February 1864]",
  "belligerents": {
    "Confederate": {
      "casualties": 50,
      "commanders": [
        {
          "rank": "Major General",
          "first_name": "Nathan",
          "suffix": "",
          "navy": false,
          "middle_name": "Bedford",
          "last_name": "Forrest",
          "fullname": "Nathan Bedford Forrest"
        }
      ],
      "cavalry_corps": 1,
      "description": "Forrest's Cavalry Corps"
    },
    "US": {
      "casualties": 100,
      "commanders": [
        {
          "rank": "Brigadier General",
          "first_name": "William",
          "suffix": "",
          "navy": false,
          "middle_name": "Sooy",
          "last_name": "Smith",
          "fullname": "William Sooy Smith"
        }
      ],
      "description": "Cavalry force (7,000)",
      "strength_min": 7000,
      "strength_max": 7000
    },
    "CS": {
      "casualties": 50,
      "commanders": [
        {
          "rank": "Major General",
          "first_name": "Nathan",
          "suffix": "",
          "navy": false,
          "middle_name": "Bedford",
          "last_name": "Forrest",
          "fullname": "Nathan Bedford Forrest"
        }
      ],
      "cavalry_corps": 1,
      "description": "Forrest's Cavalry Corps"
    }
  },
  "result": "Confederate",
  "battle": "MS013",
  "location": [
    {
      "state": "MS",
      "place": "Chickasaw County"
    }
  ],
  "url": "http://www.nps.gov/hps/abpp/battles/ms013.htm"
}