{
  "battle": "ND005",
  "operation": false,
  "cwsac_reference": "ND005",
  "forces": {
    "Native American": {
      "commanders": [
        {
          "middle_name": "",
          "last_name": "",
          "suffix": "",
          "first_name": "Inkpaduta",
          "rank": "",
          "fullname": "Inkpaduta",
          "navy": false
        }
      ],
      "description": "Santee and Teton Sioux"
    },
    "US": {
      "strength_min": 2200,
      "commanders": [
        {
          "middle_name": "",
          "last_name": "Sully",
          "suffix": "",
          "first_name": "Alfred",
          "rank": "Brigadier General",
          "fullname": "Alfred Sully",
          "navy": false
        }
      ],
      "description": "Detachments from eight units (2,200)",
      "strength_max": 2200
    }
  },
  "url": "http://www.nps.gov/abpp/battles/nd005.htm",
  "forces_text": "Detachments from eight units (2,200) [US]; Santee and Teton Sioux [I]",
  "casualties_text": "Unknown",
  "results_text": "Union victory",
  "dates": "July 28-29, 1864",
  "result": "Union",
  "other_names": [
    "Tahkahokuty Mountain"
  ],
  "significance": "C",
  "preservation": "III.3",
  "state": "ND",
  "campaign": "Sully's Expedition Against the Sioux in Dakota Territory [July 1864]",
  "end_date": "1864-07-29",
  "description": "Brig. Gen. Alfred Sully, who had defeated the recalcitrant Sioux at Whitestone Hill in September 1863, wintered on the Missouri River. During the winter, Sully's superior, Maj. Gen. John Pope, formulated a plan for ending the difficulties with the Sioux. He would order a force of about 2,500 men, commanded by Sully, into the field to find the Native Americans and engage them in battle. In addition, he would send infantry behind Sully's force to establish strong-posts in the \"Indian country.\" Thus, Minnesota troops were ordered to meet Sully's force at the mouth of Burdache Creek on the Upper Missouri for active campaigning. The two columns rendezvoused on June 30 and set out against the Sioux. They established Fort Rice on July 7 at the mouth of Cannonball River and moved on. The Sioux, who had been operating north of Fort Rice, moved across the Missouri River and took a strong position on the Little Missouri River, about 200 miles from the fort. On July 26, Sully marched out to engage them in battle. On the 28th, he arrived near the Native American camp which he reported included 5,000-6,000 warriors \"strongly posted in wooded country, very much cut up with high, rugged hills, and deep, impassible ravines.\" Sully met with some of the tribal chiefs first, but nothing came of it so he attacked. Heavy fighting ensued, but eventually the artillery and long-range firearms took effect and the Sioux began losing ground. The retirement turned into flight. The Native Americans left all their possessions, and a running fight of almost nine miles scattered the warriors who were not wounded or killed. Killdeer Mountain broke the back of the Sioux resistance. Sully did meet the remnants of the Sioux warriors that had escaped Killdeer Mountain in August and defeated them, but they had none of the spirit formally exhibited.",
  "location": [
    {
      "state": "ND",
      "place": "Dunn County"
    }
  ],
  "battle_name": "Killdeer Mountain",
  "start_date": "1864-07-28",
  "casualties": null,
  "principal_commanders": "Brig. Gen. Alfred Sully [US]; Chief Inkpaduta [I]"
}