{
  "dates": "July 24-25, 1863",
  "operation": false,
  "url": "http://www.nps.gov/hps/abpp/battles/nd001.htm",
  "results_text": "Union victory",
  "casualties_text": "Total unknown (US unknown; I 13)",
  "description": "Brig. Gen. Henry Hastings Sibley led his troops from Fort Ridgely, Minnesota, into the Dakotas, pursuing the Santee Sioux, who had initiated an uprising in the Minnesota River Valley in August 1862. The Santee had joined forces with the Teton Sioux. Having marched all day on July 24, 1863, Sibley's scouts, around 1:00 pm, reported that they had spotted a large Native American camp a few miles away. Sibley established a camp on a nearby salt lake and set his men to entrenching it for protection. While in the process of making camp, numerous Native Americans appeared expressing friendship. A number of them approached the scouts gathered about 300-400 yards from the camp and began talking with them. Surgeon Josiah S. Weiser, 1st Regiment Minnesota Mounted Rangers, joined the assembly, but soon afterwards a Sioux shot and killed him. The scouts attempted to kill the attacker but he escaped. Native Americans who had hidden behind the surrounding ridges now emerged and attacked. In detachments, the soldiers went out to meet the Native Americans. Sibley, with some men, approached the \"Big Mound\" on the opposite side of the ravine. He attempted to dislodge those Sioux who were on the upper part of the large ravine firing at the infantry and cavalry with impunity. The Union forces displaced these and other well-placed Sioux in the surrounding ridges by accurate artillery fire and forced them into the broken prairie where they fled in confusion. The mounted troops, with some of the infantry and artillery following, set out in pursuit. A running battle ensued for the rest of the day. Before dark, the soldiers broke off the pursuit and returned to camp as previously ordered, some not arriving until the next morning. The Sioux forces were broken and dispirited.",
  "start_date": "1863-07-24",
  "forces_text": "District of Minnesota [US]; Santee and Teton Sioux [I]",
  "belligerents": {
    "I": {
      "commanders": [
        {
          "navy": false,
          "last_name": "",
          "middle_name": "",
          "rank": "Chief",
          "suffix": "",
          "fullname": "Inkpaduta",
          "first_name": "Inkpaduta"
        }
      ],
      "description": "Santee and Teton Sioux",
      "casualties": 13
    },
    "US": {
      "commanders": [
        {
          "navy": false,
          "last_name": "Sibley",
          "middle_name": "Hastings",
          "rank": "Brigadier General",
          "suffix": "",
          "fullname": "Henry Hastings Sibley",
          "first_name": "Henry"
        }
      ],
      "description": "District of Minnesota",
      "casualties": null
    }
  },
  "campaign": "Operations Against the Sioux in North Dakota [July 1863]",
  "battle": "ND001",
  "result": "Union",
  "significance": "C",
  "other_names": null,
  "state": "ND",
  "preservation": "III.3",
  "principal_commanders": "Brig. Gen. Henry Hastings Sibley [US]; Chief Inkpaduta [I]",
  "end_date": "1863-07-25",
  "cwsac_reference": "ND001",
  "casualties": null,
  "location": [
    {
      "place": "Kidder County",
      "state": "ND"
    }
  ],
  "battle_name": "Big Mound"
}