{
  "dates": "November 19, 1861",
  "operation": false,
  "url": "http://www.nps.gov/hps/abpp/battles/ok001.htm",
  "results_text": "Confederate victory",
  "casualties_text": "Unknown",
  "description": "Col. Douglas H. Cooper, Confederate commander of the Indian Department, had not been able to reconcile differences with Chief Opothleyahola, who commanded a band of Unionist Creeks and Seminoles. Cooper set out on November 15, 1861, with about 1,400 men to either compel submission . . . or \"drive him and his party from the country.\" His force rode up the Deep Fork of the Canadian River towards Chief Opothleyahola's camp which they found deserted. On the 19th, Cooper learned from captured prisoners that part of Chief Opothleyahola's band was at the Red Fork of the Arkansas River, where they were erecting a fort. Cooper's men arrived there around 4:00 pm and ordered a cavalry charge which discovered that Chief Opothleyahola's band had recently abandoned the camp. The Confederates did find some stragglers beyond the camp and followed them, blundering into Chief Opothleyahola's camp. The Federals fired into the Rebel cavalry and, in large force, came out to attack them. They chased the Confederates back to Cooper's main force. Darkness prevented Cooper from attacking until the main enemy force was within 60 yards. A short fight ensued but Chief Opothleyahola's men broke it off and retreated back to their camp. Cooper set out for Chief Opothleyahola's camp the next morning but found it gone. The Confederates claimed victory because Chief Opothleyahola had left the area. This was the first of three encounters between Chief Opothleyahola's Union bands and Confederate troops. The chief was forced to flee Oklahoma for Kansas at the end of the year.",
  "start_date": "1861-11-19",
  "forces_text": "Creek and Seminole [I]; Indian Department [CS]",
  "belligerents": {
    "I": {
      "commanders": [
        {
          "navy": false,
          "last_name": "",
          "middle_name": "",
          "rank": "Chief",
          "suffix": "",
          "fullname": "Opothleyahola",
          "first_name": "Opothleyahola"
        }
      ],
      "description": "Creek and Seminole"
    },
    "CS": {
      "commanders": [
        {
          "navy": false,
          "last_name": "Cooper",
          "middle_name": "H.",
          "rank": "Colonel",
          "suffix": "",
          "fullname": "Douglas H. Cooper",
          "first_name": "Douglas"
        }
      ],
      "description": "Indian Department"
    }
  },
  "campaign": "Operations in the Indian Territory [November-December 1861]",
  "battle": "OK001",
  "result": "Confederate",
  "significance": "D",
  "other_names": [
    "Round Mountains"
  ],
  "state": "OK",
  "preservation": null,
  "principal_commanders": "Chief Opothleyahola [I]; Col. Douglas H. Cooper [CS]",
  "end_date": "1861-11-19",
  "cwsac_reference": "OK001",
  "casualties": null,
  "location": [],
  "battle_name": "Round Mountain"
}