{
  "dates": "December 26, 1861",
  "operation": false,
  "url": "http://www.nps.gov/hps/abpp/battles/ok003.htm",
  "results_text": "Confederate victory",
  "casualties_text": "Unknown",
  "description": "Confederate troops had undertaken a campaign to subdue the Native American Union sympathizers in Indian Territory and consolidate control. They had attacked Chief Opothleyahola's band of Creeks and Seminoles earlier at Round Mountain and Chusto-Talasah. Now, they wanted to finish them off by assaulting them in their camp at Chustenahlah in a well-protected cove on Battle Creek. Col. James McQueen McIntosh and Col. Douglas H. Cooper, commanding the Indian Department, planned a combined attack with each of their columns moving on the camp from different directions. McIntosh left Fort Gibson on December 22, with 1,380 men. On the 25th, he was informed that Cooper's force could not join for a while, but he decided to attack the next day, despite being outnumbered. McIntosh attacked the camp at noon on the 26th. The Union defenders were secluded in the underbrush along the slope of a rugged hill, but as the Confederate attack came forward, the Native Americans began to fall back, taking cover for a while and then moving back. The retreat became a rout as the Federals reached their camp. They attempted to make a stand there but were forced away again. The survivors fled; many went all the way to Kansas where they found loyal Unionists. Chief Opothleyahola's band of Creeks and Seminoles mounted no resistance again.",
  "start_date": "1861-12-26",
  "forces_text": "Creek and Seminole [I]; McIntosh's and Douglas Cooper's brigades [CS]",
  "belligerents": {
    "I": {
      "commanders": [
        {
          "navy": false,
          "last_name": "",
          "middle_name": "",
          "rank": "",
          "suffix": "",
          "fullname": "Opothleyahola",
          "first_name": "Opothleyahola"
        }
      ],
      "description": "Creek and Seminole"
    },
    "CS": {
      "commanders": [
        {
          "navy": false,
          "last_name": "McIntosh",
          "middle_name": "McQueen",
          "rank": "Colonel",
          "suffix": "",
          "fullname": "James McQueen McIntosh",
          "first_name": "James"
        }
      ],
      "brigades": 2,
      "description": "McIntosh's and Douglas Cooper's brigades"
    }
  },
  "campaign": "Operations in the Indian Territory [November-December 1861]",
  "battle": "OK003",
  "result": "Confederate",
  "significance": "B",
  "other_names": null,
  "state": "OK",
  "preservation": "II.2",
  "principal_commanders": "Chief Opothleyahola [I]; Col. James McQueen McIntosh [CS]",
  "end_date": "1861-12-26",
  "cwsac_reference": "OK003",
  "casualties": null,
  "location": [
    {
      "place": "Osage County",
      "state": "OK"
    }
  ],
  "battle_name": "Chustenahlah"
}
