{
  "dates": "April 6-7, 1862",
  "operation": false,
  "url": "http://www.nps.gov/hps/abpp/battles/tn003.htm",
  "results_text": "Union victory",
  "casualties_text": "23,746 total (US 13,047; CS 10,699)",
  "description": "As a result of the fall of Forts Henry and Donelson, Confederate Gen. Albert Sidney Johnston, the commander in the area, was forced to fall back, giving up Kentucky and much of West and Middle Tennessee. He chose Corinth, Mississippi, a major transportation center, as the staging area for an offensive against Maj. Gen. Ulysses S. Grant and his Army of the Tennessee before the Army of the Ohio, under Maj. Gen. Don Carlos Buell, could join it. The Confederate retrenchment was a surprise, although a pleasant one, to the Union forces, and it took Grant, with about 40,000 men, some time to mount a southern offensive, along the Tennessee River, toward Pittsburg Landing. Grant received orders to await Buell's Army of the Ohio at Pittsburg Landing. Grant did not choose to fortify his position; rather, he set about drilling his men many of which were raw recruits. Johnston originally planned to attack Grant on April 4, but delays postponed it until the 6th. Attacking the Union troops on the morning of the 6th, the Confederates surprised them, routing many. Some Federals made determined stands and by afternoon, they had established a battle line at the sunken road, known as the \"Hornets Nest.\" Repeated Rebel attacks failed to carry the Hornets Nest, but massed artillery helped to turn the tide as Confederates surrounded the Union troops and captured, killed, or wounded most. Johnston had been mortally wounded earlier and his second in command, Gen. P.G.T. Beauregard, took over. The Union troops established another line covering Pittsburg Landing, anchored with artillery and augmented by Buell's men who began to arrive and take up positions. Fighting continued until after dark, but the Federals held. By the next morning, the combined Federal forces numbered about 40,000, outnumbering Beauregard's army of less than 30,000. Beauregard was unaware of the arrival of Buell's army and launched a counterattack in response to a two-mile advance by William Nelson's division of Buell's army at 6:00 am, which was, at first, successful. Union troops stiffened and began forcing the Confederates back. Beauregard ordered a counterattack, which stopped the Union advance but did not break its battle line. At this point, Beauregard realized that he could not win and, having suffered too many casualties, he retired from the field and headed back to Corinth. On the 8th, Grant sent Brig. Gen. William T. Sherman, with two brigades, and Brig. Gen. Thomas J. Wood, with his division, in pursuit of Beauregard. They ran into the Rebel rearguard, commanded by Col. Nathan Bedford Forrest, at Fallen Timbers. Forrest's aggressive tactics, although eventually contained, influenced the Union troops to return to Pittsburg Landing. Grant's mastery of the Confederate forces continued; he had beaten them once again. The Confederates continued to fall back until launching their mid-August offensive.",
  "start_date": "1862-04-06",
  "forces_text": "Army of the Tennessee and Army of the Ohio (65,085) [US]; Army of the Mississippi (44,968) [CS]",
  "belligerents": {
    "CS": {
      "commanders": [
        {
          "navy": false,
          "last_name": "Johnston",
          "middle_name": "Sidney",
          "rank": "General",
          "suffix": "",
          "fullname": "Albert Sidney Johnston",
          "first_name": "Albert"
        },
        {
          "navy": false,
          "last_name": "Beauregard",
          "middle_name": "",
          "rank": "General",
          "suffix": "",
          "fullname": "P.G.T. Beauregard",
          "first_name": "P.G.T."
        }
      ],
      "description": "Army of the Mississippi (44,968)",
      "strength_max": 44968,
      "strength_min": 44968,
      "casualties": 10699
    },
    "US": {
      "commanders": [
        {
          "navy": false,
          "last_name": "Grant",
          "middle_name": "S.",
          "rank": "Major General",
          "suffix": "",
          "fullname": "Ulysses S. Grant",
          "first_name": "Ulysses"
        },
        {
          "navy": false,
          "last_name": "Buell",
          "middle_name": "Carlos",
          "rank": "Major General",
          "suffix": "",
          "fullname": "Don Carlos Buell",
          "first_name": "Don"
        }
      ],
      "description": "Army of the Tennessee and Army of the Ohio (65,085)",
      "strength_max": 65085,
      "strength_min": 65085,
      "casualties": 13047
    }
  },
  "campaign": "Federal Penetration up the Cumberland and Tennessee Rivers [February-June 1862]",
  "battle": "TN003",
  "result": "Union",
  "significance": "A",
  "other_names": [
    "Pittsburg Landing"
  ],
  "state": "TN",
  "preservation": "III.1",
  "principal_commanders": "Maj. Gen. Ulysses S. Grant and Maj. Gen. Don Carlos Buell [US]; Gen. Albert Sidney Johnston and Gen. P.G.T. Beauregard [CS]",
  "end_date": "1862-04-07",
  "cwsac_reference": "TN003",
  "casualties": 23746,
  "location": [
    {
      "place": "Hardin County",
      "state": "TN"
    }
  ],
  "battle_name": "Shiloh"
}