{
  "dates": "October 10, 1863",
  "operation": false,
  "url": "http://www.nps.gov/hps/abpp/battles/tn020.htm",
  "results_text": "Union victory",
  "casualties_text": "316 total (US 100; CS 216)",
  "description": "Maj. Gen. Ambrose E. Burnside, commander of the Department of the Ohio, undertook an expedition into East Tennessee to clear the roads and passes to Virginia, and, if possible, secure the saltworks beyond Abingdon. In October, Confederate Brig. Gen. John S. Williams, with his cavalry force, set out to disrupt Union communications and logistics. He wished to take Bull's Gap on the East Tennessee & Virginia Railroad. On October 3, while advancing on Bull's Gap, he fought with Brig. Gen. Samuel P. Carter's Union Cavalry Division, XXIII Army Corps, at Blue Springs, about nine miles from Bull's Gap, on the railroad. Carter, not knowing how many of the enemy he faced, withdrew. Carter and Williams skirmished for the next few days. On October 10, Carter approached Blue Springs in force. Williams had received some reinforcements. The battle began about 10:00 am with Union cavalry engaging the Confederates until afternoon while another mounted force attempted to place itself in a position to cut off a Rebel retreat. Captain Orlando M. Poe, the Chief Engineer, performed a reconnaissance to identify the best location for making an infantry attack. At 3:30 pm, Brig. Gen. Edward Ferrero's 1st Division, IX Army Corps, moved up to attack, which he did at 5:00 pm. Ferrero's men broke into the Confederate line, causing heavy casualties, and advanced almost to the enemy's rear before being checked. After dark, the Confederates withdrew and the Federals took up the pursuit in the morning. Within days, Williams and his men had retired to Virginia. Burnside had launched the East Tennessee Campaign to reduce or extinguish Confederate influence in the area; Blue Springs helped fulfill that mission.",
  "start_date": "1863-10-10",
  "forces_text": "Department of the Ohio [US]; 1st Tennessee Volunteer Cavalry Regiment, 4th Kentucky Cavalry Regiment, and some home guard troops and artillery [CS]",
  "belligerents": {
    "CS": {
      "commanders": [
        {
          "navy": false,
          "last_name": "Williams",
          "middle_name": "S.",
          "rank": "Brigadier General",
          "suffix": "",
          "fullname": "John S. Williams",
          "first_name": "John"
        }
      ],
      "description": "1st Tennessee Volunteer Cavalry Regiment, 4th Kentucky Cavalry Regiment, and some home guard troops and artillery",
      "regiments": 2,
      "casualties": 216
    },
    "US": {
      "commanders": [
        {
          "navy": false,
          "last_name": "Burnside",
          "middle_name": "E.",
          "rank": "Major General",
          "suffix": "",
          "fullname": "Ambrose E. Burnside",
          "first_name": "Ambrose"
        }
      ],
      "description": "Department of the Ohio",
      "casualties": 100
    }
  },
  "campaign": "East Tennessee Campaign [September-October 1863]",
  "battle": "TN020",
  "result": "Union",
  "significance": "D",
  "other_names": null,
  "state": "TN",
  "preservation": "IV.1",
  "principal_commanders": "Maj. Gen. Ambrose E. Burnside [US]; Brig. Gen. John S. Williams [CS]",
  "end_date": "1863-10-10",
  "cwsac_reference": "TN020",
  "casualties": 316,
  "location": [
    {
      "place": "Greene County",
      "state": "TN"
    }
  ],
  "battle_name": "Blue Springs"
}