{
  "dates": "November 16, 1863",
  "operation": false,
  "url": "http://www.nps.gov/hps/abpp/battles/tn023.htm",
  "results_text": "Union victory",
  "casualties_text": "970 total (US 400; CS 570)",
  "description": "In early November 1863, Lt. Gen. James Longstreet, with two divisions and about 5,000 cavalry, was detached from the Confederate Army of Tennessee near Chattanooga to attack Maj. Gen. Ambrose E. Burnside's Union Department of the Ohio troops at Knoxville, Tennessee. Following parallel routes, Longstreet and Burnside raced for Campbell's Station, a hamlet where the Concord Road, from the south, intersected the Kingston Road to Knoxville. Burnside hoped to reach the crossroads first and continue on to safety in Knoxville; Longstreet planned to reach the crossroads and hold it, which would prevent Burnside from gaining Knoxville and force him to fight outside his earthworks. By forced marching, on a rainy November 16, Maj. Gen. Ambrose E. Burnside's advance reached the vital intersection and deployed first. The main column arrived at noon with the baggage train just behind. Scarcely 15 minutes later, Longstreet's Confederates approached. Longstreet attempted a double envelopment: attacks timed to strike both Union flanks simultaneously. Maj. Gen. Lafayette McLaw's Confederate division struck with such force that the Union right had to redeploy, but held. Brig. Gen. Micah Jenkins's Confederate division maneuvered ineffectively as it advanced and was unable to turn the Union left. Burnside ordered his two divisions astride the Kingston Road to withdraw three-quarters of a mile to a ridge in their rear. This was accomplished without confusion. The Confederates suspended their attack while Burnside continued his retrograde movement to Knoxville. Had Longstreet reached Campbell's Station first, the Knoxville Campaign's results might have been different.",
  "start_date": "1863-11-16",
  "forces_text": "Department of the Ohio [US]; Confederate Forces in East Tennessee [CS]",
  "belligerents": {
    "CS": {
      "commanders": [
        {
          "navy": false,
          "last_name": "Longstreet",
          "middle_name": "",
          "rank": "Lieutenant General",
          "suffix": "",
          "fullname": "James Longstreet",
          "first_name": "James"
        }
      ],
      "description": "Confederate Forces in East Tennessee",
      "casualties": 570
    },
    "US": {
      "commanders": [
        {
          "navy": false,
          "last_name": "Burnside",
          "middle_name": "E.",
          "rank": "Major General",
          "suffix": "",
          "fullname": "Ambrose E. Burnside",
          "first_name": "Ambrose"
        }
      ],
      "description": "Department of the Ohio",
      "casualties": 400
    }
  },
  "campaign": "Longstreet's Knoxville Campaign [November-December 1863]",
  "battle": "TN023",
  "result": "Union",
  "significance": "D",
  "other_names": null,
  "state": "TN",
  "preservation": "IV.2",
  "principal_commanders": "Maj. Gen. Ambrose E. Burnside [US]; Lt. Gen. James Longstreet [CS]",
  "end_date": "1863-11-16",
  "cwsac_reference": "TN023",
  "casualties": 970,
  "location": [
    {
      "place": "Knox County",
      "state": "TN"
    }
  ],
  "battle_name": "Campbell's Station"
}