{
  "dates": "January 27, 1864",
  "operation": false,
  "url": "http://www.nps.gov/hps/abpp/battles/tn029.htm",
  "results_text": "Union victory",
  "casualties_text": "265 total (US 100; CS 165)",
  "description": "Since the Battle of Dandridge, the Union cavalry had moved to the south side of the French Broad River and had disrupted Confederate foraging and captured numerous wagons in that area. On January 25, 1864, Lt. Gen. James Longstreet, commander of the Department of East Tennessee, instructed his subordinates to do something to curtail Union operations south of the French Broad. On the 26th, Brig. Gen. Samuel D. Sturgis, having had various brushes with Confederate cavalry, deployed his troopers to watch the area fords. Two Confederate cavalry brigades and artillery advanced from Fair Garden in the afternoon but were checked about four miles from Sevierville. Other Confederates attacked a Union cavalry brigade, though, at Fowler's on Flat Creek, and drove it about two miles. No further fighting occurred that day. Union scouts observed that the Confederates had concentrated on the Fair Garden Road, so Sturgis ordered an attack there in the morning. In a heavy fog, Col. Edward M. McCook's Union division attacked and drove back Maj. Gen. William T. Martin's Confederates until about 4:00 pm. At that time, McCook's men charged with sabers and routed the Rebels. Sturgis set out in pursuit on the 28th, and captured and killed more of the routed Rebels. The Union forces, however, observed three of Longstreet's infantry brigades crossing the river. Realizing his weariness from fighting, lack of supplies, ammunition, and weapons and the overwhelming strength of the enemy, Sturgis decided to evacuate the area. But, before leaving, Sturgis determined to attack Brig. Gen. Frank C. Armstrong's Confederate cavalry division which he had learned was about three or four miles away, on the river. Unbeknownst to the attacking Federals, Armstrong had strongly fortified his position and three infantry regiments had arrived to reinforce him. Thus, the Union troops suffered severe casualties in the attack. The battle continued until dark, when the Federals retired from the area. The Federals had won the big battle but the fatigue of continual fighting and lack of supplies and ammunition forced them to withdraw.",
  "start_date": "1864-01-27",
  "forces_text": "Cavalry Division, Cavalry Corps, Army of the Ohio [US]; Cavalry Division, Department of East Tennessee [CS]",
  "belligerents": {
    "CS": {
      "commanders": [
        {
          "navy": false,
          "last_name": "Martin",
          "middle_name": "T.",
          "rank": "Major General",
          "suffix": "",
          "fullname": "William T. Martin",
          "first_name": "William"
        }
      ],
      "cavalry_divisions": 1,
      "description": "Cavalry Division, Department of East Tennessee",
      "casualties": 165
    },
    "US": {
      "commanders": [
        {
          "navy": false,
          "last_name": "Sturgis",
          "middle_name": "D.",
          "rank": "Brigadier General",
          "suffix": "",
          "fullname": "Samuel D. Sturgis",
          "first_name": "Samuel"
        },
        {
          "navy": false,
          "last_name": "McCook",
          "middle_name": "M.",
          "rank": "Colonel",
          "suffix": "",
          "fullname": "Edward M. McCook",
          "first_name": "Edward"
        }
      ],
      "cavalry_divisions": 1,
      "description": "Cavalry Division, Cavalry Corps, Army of the Ohio",
      "casualties": 100
    }
  },
  "campaign": "Operations about Dandridge [December 1863-January 1864]",
  "battle": "TN029",
  "result": "Union",
  "significance": "C",
  "other_names": null,
  "state": "TN",
  "preservation": "II.3",
  "principal_commanders": "Brig. Gen. Samuel D. Sturgis and Col. Edward M. McCook [US]; Maj. Gen. William T. Martin [CS]",
  "end_date": "1864-01-27",
  "cwsac_reference": "TN029",
  "casualties": 265,
  "location": [
    {
      "place": "Sevier County",
      "state": "TN"
    }
  ],
  "battle_name": "Fair Garden"
}