{
  "dates": "December 14, 1863",
  "operation": false,
  "url": "http://www.nps.gov/hps/abpp/battles/tn026.htm",
  "results_text": "Confederate victory",
  "casualties_text": "1,600 total (US 700; CS 900)",
  "description": "Lt. Gen. James Longstreet abandoned the Siege of Knoxville, on December 4, 1863, and retreated northeast towards Rogersville, Tennessee. Union Maj. Gen. John G. Parke pursued the Confederates but not too closely. Longstreet continued to Rutledge on December 6 and Rogersville on the 9th. Parke sent Brig. Gen. J.M Shackelford on with about 4,000 cavalry and infantry to search for Longstreet. On the 13th, Shackelford was near Bean's Station on the Holston River. Longstreet decided to go back and capture Bean's Station. Three Confederate columns and artillery approached Bean's Station to catch the federals in a vice. By 2:00 am on the 14th, one column was skirmishing with Union pickets. The pickets held out as best they could and warned Shackelford of the Confederate presence. He deployed his force for an assault. Soon, the battle started and continued throughout most of the day. Confederate flanking attacks and other assaults occurred at various times and locations, but the Federals held until southern reinforcements tipped the scales. By nightfall, the Federals were retiring from Bean's Station through Bean's Gap and on to Blain's Cross Roads. Longstreet set out to attack the Union forces again the next morning, but as he approached them at Blain's Cross Roads, he found them well-entrenched. Longstreet withdrew and the Federals soon left the area. The Knoxville Campaign ended following the battle of Bean's Station. Longstreet soon went into winter quarters at Russellville. Their success meant little to Confederate efforts except to prevent disaster.",
  "start_date": "1863-12-14",
  "forces_text": "Cavalry Corps, Department of the Ohio [US]; Confederate Forces in East Tennessee [CS]",
  "belligerents": {
    "CS": {
      "commanders": [
        {
          "navy": false,
          "last_name": "Longstreet",
          "middle_name": "",
          "rank": "Lieutenant General",
          "suffix": "",
          "fullname": "James Longstreet",
          "first_name": "James"
        }
      ],
      "description": "Confederate Forces in East Tennessee",
      "casualties": 900
    },
    "US": {
      "commanders": [
        {
          "navy": false,
          "last_name": "Shackelford",
          "middle_name": "",
          "rank": "Brigadier General",
          "suffix": "",
          "fullname": "James Shackelford",
          "first_name": "James"
        }
      ],
      "description": "Cavalry Corps, Department of the Ohio",
      "cavalry_corps": 1,
      "casualties": 700
    }
  },
  "campaign": "Longstreet's Knoxville Campaign [November-December 1863]",
  "battle": "TN026",
  "result": "Confederate",
  "significance": "D",
  "other_names": null,
  "state": "TN",
  "preservation": "IV.2",
  "principal_commanders": "Brig. Gen. James Shackelford [US]; Lt. Gen. James Longstreet [CS]",
  "end_date": "1863-12-14",
  "cwsac_reference": "TN026",
  "casualties": 1600,
  "location": [
    {
      "place": "Grainger County",
      "state": "TN"
    }
  ],
  "battle_name": "Bean's Station"
}