{
  "dates": "November 29, 1863",
  "operation": false,
  "url": "http://www.nps.gov/hps/abpp/battles/tn025.htm",
  "results_text": "Union victory",
  "casualties_text": "880 total (US 100; CS 780)",
  "description": "In attempting to take Knoxville, the Confederates decided that Fort Sanders was the only vulnerable place where they could penetrate Union Maj. Gen. Ambrose E. Burnside's fortifications, which enclosed the city, and successfully conclude the siege, already a week long. The fort surmounted an eminence just northwest of Knoxville. Northwest of the fort, the land dropped off abruptly. Confederate Lt. Gen. James Longstreet believed he could assemble a storming party, undetected at night, below the fortifications and, before dawn, overwhelm Fort Sanders by a coup de main. Following a brief artillery barrage directed at the fort's interior, three Rebel brigades charged. Union wire entanglements--telegraph wire stretched from one tree stump to another to another--delayed the attack, but the fort's outer ditch halted the Confederates. This ditch was twelve feet wide and from four to ten feet deep with vertical sides. The fort's exterior slope was almost vertical, also. Crossing the ditch was nearly impossible, especially under withering defensive fire from musketry and canister. Confederate officers did lead their men into the ditch, but, without scaling ladders, few emerged on the scarp side and a small number entered the fort to be wounded, killed, or captured. The attack lasted a short twenty minutes. Longstreet undertook his Knoxville expedition to divert Union troops from Chattanooga and to get away from Gen. Braxton Bragg, with whom he was engaged in a bitter feud. His failure to take Knoxville scuttled his purpose. This was the decisive battle of the Knoxville Campaign. This Confederate defeat, plus the loss of Chattanooga on November 25, put much of East Tennessee in the Union camp.",
  "start_date": "1863-11-29",
  "forces_text": "Department of the Ohio [US]; Confederate Forces in East Tennessee [CS]",
  "belligerents": {
    "CS": {
      "commanders": [
        {
          "navy": false,
          "last_name": "Longstreet",
          "middle_name": "",
          "rank": "Lieutenant General",
          "suffix": "",
          "fullname": "James Longstreet",
          "first_name": "James"
        }
      ],
      "description": "Confederate Forces in East Tennessee",
      "casualties": 780
    },
    "US": {
      "commanders": [
        {
          "navy": false,
          "last_name": "Burnside",
          "middle_name": "E.",
          "rank": "Major General",
          "suffix": "",
          "fullname": "Ambrose E. Burnside",
          "first_name": "Ambrose"
        }
      ],
      "description": "Department of the Ohio",
      "casualties": 100
    }
  },
  "campaign": "Longstreet's Knoxville Campaign [November-December 1863]",
  "battle": "TN025",
  "result": "Union",
  "significance": "B",
  "other_names": [
    "Fort Loudon"
  ],
  "state": "TN",
  "preservation": "IV.2",
  "principal_commanders": "Maj. Gen. Ambrose E. Burnside [US]; Lt. Gen. James Longstreet [CS]",
  "end_date": "1863-11-29",
  "cwsac_reference": "TN025",
  "casualties": 880,
  "location": [
    {
      "place": "Knox County",
      "state": "TN"
    }
  ],
  "battle_name": "Fort Sanders"
}