{
  "dates": "December 5-7, 1864",
  "operation": false,
  "url": "http://www.nps.gov/hps/abpp/battles/tn037.htm",
  "results_text": "Union victory",
  "casualties_text": "422 total (US 225; CS 197)",
  "description": "In a last, desperate attempt to force Maj. Gen. William T. Sherman's army out of Georgia, Gen. John Bell Hood led the Army of Tennessee north toward Nashville in November 1864. Although he suffered a terrible loss at Franklin, he continued toward Nashville. In operating against Nashville, he decided that destruction of the Nashville & Chattanooga Railroad and disruption of the Union army supply depot at Murfreesboro would help his cause. He sent Maj. Gen. Nathan Bedford Forrest, on December 4, with an expedition, composed of two cavalry divisions and Maj. Gen. William B. Bate's infantry division, to Murfreesboro. On December 2, Hood had ordered Bate to destroy the railroad and blockhouses between Murfreesboro and Nashville and join Forrest for further operations; on December 4, Bate's division attacked Blockhouse No. 7 protecting the railroad crossing at Overall Creek, but Union forces fought it off. On the morning of the 5th, Forrest headed out toward Murfreesboro, splitting his force, one column to attack the fort on the hill and the other to take Blockhouse No. 4, both at La Vergne. Upon his demand for surrender at both locations, the Union garrisons did so. Outside La Vergne, Forrest hooked up with Bate's division and the command advanced on to Murfreesboro along two roads, driving the Yankees into their Fortress Rosencrans fortifications, and encamped in the city outskirts for the night. The next morning, on the 6th, Forrest ordered Bate's division to \"move upon the enemy's works.\" Fighting flared for a couple of hours, but the Yankees ceased firing and both sides glared at each other for the rest of the day. Brig. Gen. Claudius Sears's and Brig. Gen. Joseph B. Palmer's infantry brigades joined Forrest's command in the evening, further swelling his numbers. On the morning of the 7th, Maj. Gen. Lovell Rousseau, commanding all of the forces at Murfreesboro, sent two brigades out under Brig. Gen. Robert Milroy on the Salem Pike to feel out the enemy. These troops engaged the Confederates and fighting continued. At one point some of Forrest's troops broke and ran causing disorder in the Rebel ranks; even entreaties from Forrest and Bate did not stem the rout of these units. The rest of Forrest's command conducted an orderly retreat from the field and encamped for the night outside Murfreesboro. Forrest had destroyed railroad track, blockhouses, and some homes and generally disrupted Union operations in the area, but he did not accomplish much else. The raid on Murfreesboro was a minor irritation.",
  "start_date": "1864-12-05",
  "forces_text": "District of Tennessee (forces in Murfreesboro area; approx. 8,000) [US]; Forrest's Cavalry, Bate's Infantry Division, and Brig. Gen. Claudius Sears's and Brig. Gen. Joseph B. Palmer's Infantry Brigades (6,500-7,000) [CS]",
  "belligerents": {
    "CS": {
      "commanders": [
        {
          "navy": false,
          "last_name": "Forrest",
          "middle_name": "Bedford",
          "rank": "Major General",
          "suffix": "",
          "fullname": "Nathan Bedford Forrest",
          "first_name": "Nathan"
        }
      ],
      "description": "Forrest's Cavalry, Bate's Infantry Division, and Brig. Gen. Claudius Sears's and Brig. Gen. Joseph B. Palmer's Infantry Brigades (6,500-7,000)",
      "strength_max": 6500,
      "strength_min": 6500,
      "casualties": 197
    },
    "US": {
      "commanders": [
        {
          "navy": false,
          "last_name": "Rousseau",
          "middle_name": "H.",
          "rank": "Major General",
          "suffix": "",
          "fullname": "Lovell H. Rousseau",
          "first_name": "Lovell"
        },
        {
          "navy": false,
          "last_name": "Milroy",
          "middle_name": "",
          "rank": "Brigadier General",
          "suffix": "",
          "fullname": "Robert Milroy",
          "first_name": "Robert"
        }
      ],
      "description": "District of Tennessee (forces in Murfreesboro area; approx. 8,000)",
      "strength_max": 8000,
      "strength_min": 8000,
      "casualties": 225
    }
  },
  "campaign": "Franklin-Nashville Campaign [September-December 1864]",
  "battle": "TN037",
  "result": "Union",
  "significance": "D",
  "other_names": [
    "Wilkinson Pike",
    "Cedars"
  ],
  "state": "TN",
  "preservation": "II.4",
  "principal_commanders": "Maj. Gen. Lovell H. Rousseau and Brig. Gen. Robert Milroy [US]; Maj. Gen. Nathan Bedford Forrest [CS]",
  "end_date": "1864-12-07",
  "cwsac_reference": "TN037",
  "casualties": 422,
  "location": [
    {
      "place": "Rutherford County",
      "state": "TN"
    }
  ],
  "battle_name": "Murfreesboro"
}