{"1862-05-16": "United States transport Oriental wrecked near Cape Hatteras.", "1863-03-30": "Point Pleasant, Va., captured by rebels, but subsequently recaptured....Commencement of the investment of Washington, N.C....Richmond, near Vicksburgh, taken possession of by our forces.", "1864-11-20": "Gen. SHERMAN ATTACKED EAST MACON, Ga. His troops crossed the Ocmulgee River, and his cavalry advanced to Griswoldville, eight miles east of Macon, Ga.", "1863-07-17": "Quiet restored in New-York; the Draft Riot suppressed; Gen. BROWN succeeded by Gen. CANBY in command of the troops in New-York; speech of Archbishop HUGHES to the mob....Battle with the rebel Gen. MORGAN at Berlin, Ohio....Two expeditions -- one up the Red River and one to Natchez -- made large captures of arms, ammunition and cattle.", "1861-09-20": "Surrender of Col. MULLIGAN, at Lexington.", "1862-05-07": "BATTLE OF WEST POINT, VA. -- Gen. FRANKLIN's division was engaged in a terrible conflict with the rebels under LEE, but succeeded in driving them back in the Chickahominy....The President visited Fort Monroe, the Galena, Monitor and Minnesota....The Merrimac appeared off Craney Island and returned to Norfolk....Gen. MILROY, in the Mountain Department, fell back after some skirmishing.", "1864-10-21": "A very gallant fight between Little Blue River and Independence, Mo. Our troops fought PRICE's entire army five hours. The Union forces evacuated Independence, falling back on the Big Blue.", "1862-05-12": "Great destruction of tobacco on the Elizabeth River....Rebel steamer Gov. Morton captured.", "1863-01-02": "Battle of Murfreesboro, Tenn., continued, the rebels being repulsed in an attack on our left wing....Gen. SHERMAN's force, operating against Vicksburgh, was withdrawn from the Yazoo River....Dumfries entered by STUART's cavalry, who captured some public stores, &c....Gen. BURNSIDE returned to the Army of the Potomac from Washington.", "1861-01-13": "Pensacola Navy-yard seized by Secessionists.", "1862-07-15": "Gen. STEVENS' division from South Carolina arrived in Hampton Roads to reinforce MCCLELLAN ....Rebel iron-clad gunboat Arkansas run past our vessels and succeeded in reaching the rebel batteries at Vicksburgh, before reaching which she had a desperate fight with the Union iron-clad Carondelet.", "1864-05-24": "Gen. GRANT's army at Mount Carmel Church, Va. Our army engaged, and 1,000 prisoners taken. Gen. BUTLER's position at Wilson's Wharf attacked, but the rebels repulsed. Gen. SHERMAN resumed his march from Kingston, Ga.", "1863-01-16": "Rebel privateer Oreto ran the blockade out of Mobile.", "1863-11-07": "Battle on the banks of the Rappahannock, near Rappahannock Station; our army very successful; rebel redoubts and 2,000 prisoners taken in West Virginia....Continuation of the reconnoissance of the Chowan River, N.C.", "1861-04-09": "JEFFERSON DAVIS makes a requisition for troops.", "1863-06-14": "Skirmish at State Creek, Ky....Berryville and Martinsburgh occupied by the rebels....THE ARMY OF THE POTOMAC LEFT FALMOUTH FOR PENNSYLVANIA IN PURSUIT OF LEE..Port Hudson assaulted -- our forces repulsed with heavy loss....Gen. ROSECRANS commenced a forward movement.", "1862-10-25": "Slight cavalry skirmishing at Manassas Junction and Bristol Station....Our forces routed the rebels at Greenville, Mo....Gen. SHERMAN is*sued a stringent order for the Government of Memphis.", "1861-06-25": "Blockade of Mississippi Sound.", "1862-07-17": "Congress adjourned....CYNTHIANA, KY., taken by the rebels.", "1862-12-06": "Attack on our force at Cane Hill, Ark. the rebels repulsed.", "1861-12-19": "Gallant affair at Drainesville -- Retreat of the enemy.", "1862-09-24": "The Governors of the loyal States met in Convention at Altoona, Penn., seventeen States being represented....Great excitement in Louisville, Ky.; business suspended and all required to labor on the fortifications....Gen. BUELL arrived there at midnight....Engagement between the forces sent from New-Orleans and the rebels at Donaldsonville.", "1864-02-09": "The rebel MOSBY appeared with 300 men on the old Bull Run battle-field.", "1861-07-16": "Advance of the army of the Potomac.", "1864-01-28": "The resolution in the Senate, to expel Senator DAVIS withdrawn....Gen. PALMER made a reconnoissance to Tunnel Hill, Ga. The rebels retreated in the night.", "1863-05-23": "Battle at Gum Swamp, N.C., continued....Junction of Gen. BANKS' forces with those of Gen. AUGUR at Bayou Sara.", "1864-11-24": "Second day of fighting up the Oconee River, Ga....Severe skirmishing near Columbia, Tenn....SHERMAN's rear guard left Milledgeville, Ga....SLOCUM's column at Devereaux, Ga....Our troops made a flank Movement on Jackson, Miss....Thanksgiving Day.", "1864-05-22": "ROME, GA., OCCUPIED BY GEN. SHERMAN without opposition.", "1861-11-25": "Capture by the Penguin of the schooner Albion, of Nassau, N.P., with a cargo valued at $100,000 -- The privateer Sumter escapes the Iroquois, which was watching for her off Martinique.", "1864-12-11": "A messenger from SHERMAN's army reached our fleet.", "1861-01-08": "Resignation of Secretary THOMPSON -- North Carolina forts seized by the State Government.", "1864-12-20": "Rearrest of one of the St. Albans robbers.. ..Gen. SHERMAN demanded the surrender of Savannah. The city was evacuated by HARDEE's army in the night. The rebels blew up their rams at Savannah.....Capture of rebel salt works at Saltville, Va.", "1861-07-25": "Arrival of Gen. MCCLELLAN in Washington, to take command of the army of the Potomac. -- Gov. MORGAN, of New-York, calls for 25,000 more troops from the State.", "1862-10-31": "Skirmish with STUART's cavalry at Marysville, Va....The advance guard of the column for the relief of Nashville passed through Bowling Green, Ky.", "1861-01-10": "Arsenals and forts of Louisiana seized by the State Government -- Secession of Mississippi -- Secession of Florida.", "1862-05-17": "The rebels driven across the Chickahominy at Bottom's Bridge. The rebels burned the bridge, and obstructed the march of our troops.", "1862-12-01": "Tallahatchie, Miss., evacuated by the rebels.", "1862-04-22": "Gen. BANKS' advance reached Harrisonburgh, Va....Bombardment of Fort Jackson continued....Rebel Congress at Richmond suddenly dispersed.", "1861-07-05": "Successful engagement at Brier Forks, Mo., between the troops under SIEGEL and the rebels under Gov. JACKSON and RAINS.", "1862-04-15": "Our gunboats shelled the neighborhood of Gloucester, Va., near Yorktown....The rebels cut the levee on the Arkansas side of the Mississippi near Fort Wright. Immense destruction of property in consequence... Ex-Secretary CAMERON arrested on charge of falsely imprisoning PIERCE BUTLER.", "1864-05-03": "THE CROSSING OF THE RAVIDAN OF THE ARMY OF THE POTOMAC EFFECTED, without opposition, at Culpepper, Germania and Ely's fords....The Secretary of the Navy sentenced Admiral WILKES to be repremanded and suspended for three years for insubordination, & c.", "1863-07-26": "Death of Hon. JOHN J. CRITTENDEN....MORGAN AND THE REMAINDER OF HIS BAND CAPTURED NEAR NEW-LISBON, OHIO.", "1864-07-08": "Harper's Ferry reoccupied by our forces....The rebel pirate Florida, on our coast, captured the bark Golconda....Capture of Platte City, Mo., by guerrillas.", "1864-10-22": "Gen. CURTIS telegraphed from Kansas, Mo., that he had been pressed all day, and that in the afternoon the rebels passed around his flank, when CURTIS gave him heavy blows for several hours....Col. JAMIESON was attacked at Bryan Ford, Mo., by a heavy column of rebels, at 10 A.M. At 3 P.M., the rebels forced the ford. Our troops fought the rebels until after dark, driving them four miles. Gen. PLEASONTON pursued PRICE, with 2,000 men, fought him on the battle-field of the day before, drove him from Independence, and pursued him sharply. PLEASONTON captured a large number of prisoners and three pieces of artillery....The President issued an order thanking Gen. SHERIDAN for gaining the victories in the Shenandoah.", "1864-02-14": "Meridian evacuated by the rebels....Guerrilla attack at Tecumseh Landing, Miss.", "1864-11-03": "The rebel army under HOOD attempted to cross the Tennessee, near the mouth of the Blue Water, and were repulsed by Gen. SHERMAN....The rebels bombarded Fayetteville, Ark....Commencement of Col. NORTH's trial.", "1863-02-13": "A Court of Inquiry, relative to cotton and other traffic on the Mississippi River, instituted....Skirmish near Bolivar, Tenn....Gunboat lndianola ran the blockade at Vicksburgh.", "1863-09-02": "Kingston, Tenn., captured by Gen. BURNSIDE.", "1863-05-10": "Death of Stonewall JACKSON.", "1862-03-14": "BATTLE OF NEWBERN, N.C.....The rebels evacuated New Madrid, Mo., leaving immense stores, &c., in our hands.....Gen. MCCLELLAN issued an address to his army.....Reconnoissance to Cedar Run. Va.", "1862-01-05": "Slight skirmish near Port Royal, S.C.", "1862-04-06": "BATTLE OF SHILOH, OR PITTSBURG LANDING, COMMENCED. -- The rebels outnumbered us, and on this day succeeded in driving our troops back to the protection of the gunboats ....Gunboat Pittsburgh ran the batteries a Island No. 10 under a terrific fire from the rebel batteries....The Carondelet engaged with rebel batteries all day....Gen. MITCHEL reached Shelbyville, Tennessee.", "1861-10-15": "The ship Thomas Watson, attempting to get into Charleston, is burnt to the water's edge by the blockading squadron -- The schooner Emily Tenbrook runs the blockade at Savannah, and gets into St. Thomas -- Engagement between the Seminole and rebel batteries at Quantico.", "1863-08-01": "Battle between the cavalry of the two armies near Culpepper, Va....JEFF. DAVIS appealed to the deserters from the rebel army to return, offering them pardon and amnesty.", "1862-07-08": "President LINCOLN and Gen. BURNSIDE arrived at Fort Monroe. The President proceeded up the James River....An expedition up the Roanoke River started from Plymouth, N.C.", "1861-06-05": "At this date the Massachusetts had captured twenty-five prizes at the Passes of the Mississippi.", "1861-05-22": "The seat of the rebel Government transferred to Richmond.", "1863-01-30": "Victory of Gen. CORCORAN over the rebel Gen. ROGER A. PRYOR's force near the Blackwater, the engagement being called the Battle of the Deserted House....Union gunboat Isaac Smith, captured by the rebels in the Stono River, S.C.", "1863-02-04": "Engagement at Fort McAllister, Ga.", "1861-01-18": "Close of the Debate on the Crisis in the House of Representatives.", "1863-03-01": "Rebels defeated at Bradyville, Tenn.", "1862-10-27": "Gen. JEFF. C. DAVIS indicted for killing Gen. NELSON....1,500 rebels attacked and defeated at Putnam's Ferry, Mo....English steamer Anglia, of Liverpool, captured four miles inside of Bull's Bay, S.C. She was loaded with arms, ammunition' and other contraband goods.... Rebel army under Gens. ECHOLS, FLOYD and JENKINS retreated from Charlestown, Va....Battle at Labadieville, on Bayou La Fourohe, La. The rebels were put to flight after a short, resistance.", "1864-02-03": "Gen. SHERMAN's expedition left Vickburgh, Miss....The rebels threatening Newbern, N.C., retired to Kingston, and Newbern was relieved from danger of attack....An expedition left Newport for White Oak River on a reconnaissance.", "1863-04-18": "Fayetteville, Ark., attacked by the rebels, who were repulsed....Skirmish near Ceclina, Tenn....Fighting near Memphis, Tenn....Steamer St. John's captured off Charleston, S.C.", "1862-04-05": "THE ARMY OF THE POTOMAC ARRIVED IN FRONT OF THE ENEMY's WORKS AT YORKTOWN. -- The rebels fired the first shot, after which the cannonading continued with but slight intermission until dark....The gunboat Carondelet arrived at New Madrid, Missouri, having run the rebel batteries in a terrible thunder storm.", "1864-06-13": "Gen. SHERIDAN destroyed the railroad from Trevillon Station to Lorraine Court-house, near Richmond.", "1861-08-28": "Capture of the Hatteras Inlet forts by the expedition under Commodore STRINGHAM and Gen. BUTLER.", "1861-04-16": "The Confederate Government call for 32,000 more troops. -- Fort Pickens reinforced by Col. BROWN's command.", "1864-07-31": "Gen. STONEMAN and part of his command captured by the rebels....The rebels occupied Frederick, Md.", "1861-01-05": "South Carolina Convention adjourned -- The Star of the West leaves New-York with reinforcements for Fort Sumter.", "1863-07-31": "Heavy bombardment of our works on Morris Island, Charleston harbor, from Fort Wagner....Successful attack on the rebels at Lancaster, Ky....Reconnoissance to Sperryville, Va.", "1864-02-11": "Gen. W.L. SMITH's cavalry expedition started in the direction of Collersville, Tenn.", "1863-03-26": "Skirmish near Camp Dick Robinson, Ky ....Orange Grove, Fla., Occupied by a Union regiment of colored soldiers.", "1864-03-09": "Formal presentation of the Lieutenant-General's commission to Gen. GRANT by the President....A skirmish took place near Suffolk, Va., in which colored troops were engaged....An expedition from Yorktown, Va., to the vicinity of Kings and Queens Court-house met and dispersed a body of rebels.", "1862-03-23": "BATTLE OF WINCHESTER, VA. -- Rebels defeated, with a loss of 869 killed, wounded and missing. Union loss 115 killed, 450 wounded.... Surrender of Fort Macon, North Carolina, demanded by our forces, which being refused, the fort was invested.", "1862-08-02": "Reconnoitering column from POPE's army crossed the Rapidan and took Orange Courthouse, Va....Railroad and telegraph lines between Orange Court-house and Gordonsville destroyed ....Brush with the rebels at Ozark, Mo.", "1863-03-08": "Schooner Enterprise captured off the coast of Florida.", "1864-10-08": "The Fifth and Ninth Corps, Army of the Potomac, advanced their lines half a mile, driving the rebel skirmishers into their breastworks....The rebels drew up in line of battle near Jefferson City, Mo., but afterward moved off toward the west.", "1864-07-13": "Battle at Tapaluci, Tenn.", "1863-03-17": "Col. JAMES B. FRY appointed Provost-Marshal General....Spirited fighting on the Blackwater -- unsuccessful attempt to carry the rebel breastworks....Brilliant cavalry fight at Kelly's Ford on the Rappahannock....Steamer Calypso arrived at Charleston, S.C., having run the blockade.", "1864-06-22": "THE SECOND CORPS ATTACKED NEAR THE WELDON RAILROAD. A severe engagement. The rebels forced back in a charge by the Sixth Corps. Our forces not successful in the day's battle....Gen. WILSON's cavalry crossed the Weldon Railroad at Ream's Station, and commenced destroying the track and other property there....SEVERE ENGAGEMENT IN SHERMAN's ADVANCE. A victory won by his army....Arrest of ISAAC HENDERSON, Navy Agent at New-York.", "1864-09-20": "Gen. SHERIDAN crossed Cedar Creek, having pursued the rebels thirty miles.", "1863-04-12": "Col. E.A. KIMBALL killed by Gen. CORCORAN....Battle between Gen. BANKS' army and the rebels in the Teche country, La....Steamer Stonewall Jackson destroyed off Charleston. Our iron-clads left Charleston Harbor.", "1862-12-16": "Letter of Gen. BURNSIDE, assuming the responsibility of the defeat at Fredericksburgh, written....Rebel raid on Occoquan, Va....Gen. BUTLER transferred the command of the Department of the Gulf to Gen. BANKS. Gen. BANKS issued his General Order assuming command of the Department of the Gulf, including Texas....An expedition left New-Orleans for Baton Rouge, La.", "1864-08-19": "THE REBELS DROVE IN WARREN's PICKETS AND FORCED BACK TWO DIVISIONS OF OUR ARMY. A heavy fight took place, resulting in reestablishing our lines and capturing many prisoners. Our troops were surprised, but recovered their lost ground.", "1863-11-27": "Gen. GRANT reported, that the route of the rebels was most complete, and that BRAGG's loss would fully reach 60 pieces of artillery....Gen. HOOKER's, PALMER's and SHERMAN's commands reported ten miles beyond Chickamauga Creek, in pursuit of the rebels....Fight near Germanna Ford, on the south side of the Rapidan. The rebels fell back to a stronger position.....HOOKER's corps engaged near Ringgold, Ga...Battle of Ringgold....Escape of the rebel Gen. JOHN MORGAN and six of his officers, from the Ohio Penitentiary, in the night.", "1861-04-17": "Gov. LETCHER, of Virginia, issues a Proclamation hostile to the National Government.", "1862-12-26": "Execution of 38 Indians in Minnesota.", "1862-11-03": "Gen. PLEASONTON's Cavalry occupied Upperville, Va., after a spirited engagement with the enemy of about four hours....Gen. STAHL's Cavalry drove the enemy from Thoroughfare Gap, Va., which was afterward occupied by Gen. SCHURZ....Maj.-Gen. J.B. RICHARDSON died at Sharpsburgh, Md., from wounds received in the battle of Antietam....Commodore W.D. PORTER offered the merchants of New-York to take the clipper ship Dreadnought and pursue the pirate Alabama ...Piedmont, Va., occupied by our cavalry, under Gens. PLEASANTON and AVERILL.... Maj. REID SANDERS, C.S.A., captured on the coast of Virginia, endeavoring to escape with rebel dispatches....Reconnoissances through Snicker's Gap, Va. The object fully accomplished, after some severe skirmishing and brave charges made by our troops.", "1862-12-27": "A party of rebel cavalry repulsed at Dumfries, Va.... JOHN MORGAN and his guerrillas attacked a Union force at Elizabethtown, Ky.", "1861-12-30": "Delivery of the rebel Commissioners, MASON and SLIDELL, to the British.", "1863-04-19": "Rebel battery at the West Branch, Nansemond River, near Suffolk, Va., captured....Our forces landed at Eastport....Sloop Neptune captured off Charleston, S.C....Steamer Norseman destroyed off Charleston.", "1861-01-25": "Ex-Secretary FLOYD presented by the Grand Jury for malfeasance in office -- Secession of Louisiana.", "1861-10-08": "Attack of rebels on Santa Rosa Island, and repulse by regulars and WILSON's Zouaves.", "1861-08-06": "Adjournment of Congress.", "1864-12-08": "A cavalry force sent out on the left of the Army of the Potomac engaged in skirmishing.", "1863-04-23": "Gen. HUNTER addressed a letter to JEFF. DAVIS, threatening retaliation for the execution of negro soldiers and their officers.", "1862-07-01": "BATTLE OF MALVERN HILL, before Richmond. Our troops were more successful this day than on those preceding, having been victorious in every action....Brilliant cavalry engagement near Boonsville, Miss. The rebels attacked our forces, but were repulsed after seven hours' hard fighting....The President announced his decision to call for 300,000 more volunteers....Tax Bill approved.", "1863-08-31": "Fourt Moultrie, Charleston harbor, attacked.", "1861-02-25": "Information received of the treason of Gen. TWIGGS in Texas, of the surrender of forts in Texas to the State Government, and also of a large body of United States troops -- The Peace Conference agree upon FRANKLIN's Territorial Proposition for a division of the Territory on the line of 36° 30'.", "1863-11-28": "The rebels made an attack in force upon a large portion of our line, at Knoxville, Tenn., the attack being a feint to cover the real point of attack.", "1864-01-26": "Senator BAYARD, of Delaware, announced his determination to resign his office, and delivered his valedictory....Athens, Ala., taken by the rebels....Gen. PALMER sent an expedition into Jones and Ouslow Counties, N.C., which succeeded in destroying large quantities of stores.", "1864-07-24": "The cavalry expedition which left Decatur July 10, arrived at Marietta, Ga., having been completely successful in a raid on the Montgomery and West Point Railroad....Fighting in the Shenandoah Valley.", "1863-04-29": "The Rappahannock crossed by Gen. HOOKER at Kelley's Ford in the advance upon Fredericksburgh....Attack on the rebel batteries at Grand Gulf, Miss....Haines' Bluff near Vicksburgh, bombarded....Orange Springs reached by, Gen. STONEMAN's cavalry....Louisa Court-[???]use, Va., reached by STONEMAN's cavalry in the light.....Ship Oneida destroyed by the. Florida. The bark Henrietta also destroyed.", "1864-05-07": "GEN. GRANT's ARMY IN PURSUIT OF LEE. -- Having marched fifteen miles in the night of the 6th, it was, in the morning, in position at Todd's Tavern...Battle near Petersburgh, Va., between Gen. BUTLER's army and the rebels....GEN. SHERMAN REPORTED THAT GEN. THOMAS HAD OCCUPIED TUNNEL HILL, GA., and that the rebels had taken position at Buzzards' Roost Pass, north of Dalton, Ga.", "1862-12-10": "The rebels appeared in force near Nashville, driving in our pickets....Gunboat fight at Port Royal, Va.....Plymouth, N.C. destroyed by the rebels.", "1862-02-22": "JEFF. DAVIS INAUGURATED AT RICHMOND, Va....Martial law proclaimed over West Tennessee....The day appointed by the President for a general movement of the land and naval forces.", "1864-11-08": "Presidential election. RE-ELECTION OF ABRAHAM LINCOLN AS PRESIDENT, AND ELECTION OF ANDREW JOHNSON AS VICE-PRESIDENT....Gen. MCCLELLAN resigned his commission in the United States Army....Atlanta attacked by the rebels under Gen. IVERSON.", "1863-12-16": "The Virginia and Tennessee Railroad cut at Salem by Gen. AVERILL's cavalry expedition. Three depots were destroyed, containing 2,000 barrels of flour, 10,000 bushels of wheat, 100,000 bushels of shelled corn, 50,000 bushels of oats, 2,000 barrels of meat, and many other articles.", "1864-12-06": "Heavy skirmishing near Nashville, Tenn....Rebels defeated near the Charleston and Savannah Railroad....Destruction of Pocotaligo Bridge on the same road.", "1861-10-11": "Naval collision between rebel gunboats and National vessels at the head of the Mississippi passes. Unsuccessful attempt of the steam ram \"Turtle\" to sink one of the National ships.", "1862-04-25": "ARRIVAL OF OUR SQUADRON OFF NEW-ORLEANS....Surrender of Fort Macon, North Carolina, after a bombardment of ten and a half hours by our fleet and batteries....Death of Gen. C.F. SMITH.", "1864-05-30": "The rebels attacked the left wing of GRANT's army but were easily repulsed with considerable slaughter. Gen. HANCOCK's division attacked the rebels and drove them from their intrenched skirmish line. At midnight, the rebels attacked HANCOCK, but were repulsed. Gen. WARREN's corps engaged, near Bethesda Church, Va. Gen. GRANT reported that his army had successfully crossed the Pamunkey River....The rebels repulsed in an attack on Gen. BUTLER's line. Gen. SMITH's corps occupied White House, Va.....Heavy skirmishing with SHERMAN's army.", "1861-11-08": "Capture of the rebel Commissioners SLIDELL and MASON, on the British mail steamer Trent, by the United States war sloop San Jacinto.", "1864-12-18": "Gen. THOMAS reported that the enemy had been vigorously pursued, but had studiously avoided attack. A few additional prisoners captured....Gen. E.D. MCCOOK defeated a part of the rebel Gen. LYON's force at Hopkinsville, Ky.", "1862-10-20": "At 3 o'clock in the morning, 300 or 400 of MORGAN's men, captured a Union train of 81 wagons, (51 of which were loaded,) near Bardstown, Ky. MORGAN then went toward Bardstown and captured another train at daylight.", "1862-08-04": "A DRAFT FOR 300,000 MEN FOR NINE MONTHS ORDERED.", "1863-05-04": "Panic in Richmond, Va., on the approach of STONEMAN's cavalry....STONEMAN's cavalry within two miles of Richmond, Va....He reached Chickahominy Bridge....Hungary, Va., reached by Col. KILPATRICK....Meadow Bridge, on the Chickahominy, destroyed by Col. KILPATRICK....Schooner Juniper, blockade-runner, captured.", "1864-11-21": "Heavy skirmishing near Cumberland Gap....Gen. SHERMAN's RIGHT WING CAPTURED MILLEDGEVILLE, Ga. Gordon, Ga., occupied. SLOCUM's column reached Etonville, Ga.", "1864-04-17": "Bread riot by females in Savannan, Ga....The rebels in force assaulted Plymouth, N.C., but were repulsed with considerable loss.", "1861-07-20": "Reinforcement of the blockading squadron at the mouths of the Mississippi.", "1864-09-12": "Gen. SHERMAN replied to a remonstrance of the Mayor of Atlanta against removing all the inhabitants of the city.", "1863-07-25": "Steamer Merrimac captured, running the blockade at Wilmington, N.C.", "1861-11-19": "American ship Harvey Birch burnt at sea by the pirate Nashville.", "1863-12-25": "The shelling of Charleston, S.C., continued; ten or twelve buildings destroyed by fire.", "1862-11-09": "Gen. BUTLER sequestered the property in the district of La Fourche, La., and declared all sales made by disloyal persons, since Sept. 18, void....Brilliant cavalry dash of BAYARD's men at Fredericksburgh.", "1864-03-31": "An expedition to Mount Elba and Longview, Ark., returned to Pine Bluff, having destroyed a large amount of rebel property.", "1863-12-09": "The President's Message transmitted to Congress....The Captain and crew of the Chesapeake landed at St. John.", "1864-05-28": "BATTLE OF DALLAS, GA., CONCLUDED. The rebels suffered severely, leaving 2,000 dead and wounded in our hands. Gen. MCPHERSON's corps drove back the rebels with great loss.....TWO DIVISIONS OF GEN. GRANT's ARMY HAD A SEVERE ENGAGEMENT.", "1864-05-31": "The rebels attacked Gen. SHERMAN's army, but were repulsed after a three hours' flight. Our left reached the railroad near Marietta, Ga.....A hard fight near Hanover Court-house, Va.....Battle between SHERIDAN's and FITZ-HUGH LEE's cavalry at Cold Harbor, Va. The rebels defeated, and SHERIDAN retained possession of the place.....Another artillery attack on BUTLER's forces....Nomination of JOHN C. FREMONT and JOHN COCHRANE for President and Vice-President, by the Cleveland Convention.", "1863-06-03": "Great Peace meeting in New-York....Gen. LEE broke up camp at Fredericksburgh, Va.", "1863-04-16": "FEDERAL GUNBOATS BENTON, TUSCUMBIA, LAFAYETTE, PITTSBURGH, CARONDELET, GEN. PRICE AND THREE TRANSPORTS RAN PAST THE REBEL BATTERIES AT VICKSBURGH IN THE NIGHT.", "1864-02-02": "A portion of our forces encountered a large force of rebels in Mechanicsburgh Gap, near Romney, West Va. We succeeded in forcing the rebels to retreat....A guard posted at Patterson's Creek bridge, on the Baltimore and Ohio Railroad, attacked by rebel cavalry. The rebels fired the bridge, which was not consumed. The rebels were driven back from the railroad at all points....A vessel which had run into Charleston Harbor was destroyed by shot from our vessels.", "1861-10-22": "Engagement near Frederickstown, Mo., and defeat of rebels under JEFF. THOMPSON.", "1864-03-10": "Gen. GRANT arrived at the headquarters of the Army of the Potomac....Pilatka, Fla., occupied by our troops....An expedition left Vicksburgh, Miss., for Fort De Russey, La....Emancipation Report adopted by the Virginia Constitutional Convention at Alexandria.", "1863-05-19": "Gen. MEAGHER took leave of his troops....Richmond, Mo., sacked by guerrillas...Vicksburgh fortifications assaulted....Blockade runner steamer Union captured.", "1864-12-02": "Gen. BRECKINRIDGE issued an order to husband arms, & c., and to glean lead from battle-fields....Gen. SHERMAN's army passed through Millen, Ga., and encamped in its vicinity.", "1862-06-09": "Battle of Port Republic, Va., between SHIELDS' and JACKSON's forces.", "1861-06-11": "Skirmish at Romney, Western Virginia.", "1861-06-28": "Arrest of Marshal KANE in Baltimore.", "1862-09-16": "BATTLE AT MUNFORDSVILLE, Ky., renewed; desperate fighting throughout the day....Terrific fighting near Sharpsburgh and Antietam Creek, Md. The day closed without any definite result.", "1863-01-11": "Fort Hindman and Arkansas, forts on the Arkansas River, surrendered by the rebels....Fight at Huntsville, Mo....Union gunboat Hatteras sunk by the Alabama, on the coast of Texas....Gen. WEITZEL crossed Berwick Bay and attacked the rebel gunboat Cotton in the Bayou Teche.", "1861-08-16": "Proclamation of the President declaring the States of Virginia, North Carolina, Tennessee and Arkansas in insurrection.", "1862-02-12": "Edenton, N.C., taken by Lieut. MAURY, U.S.N....Retreat of rebel Gen. PRICE from Springfield, Mo.", "1863-11-08": "Cavalry, fight at Hazel Run, Va....Gen. MEADE reported that on advancing from Kelly's Ford, in the morning, it was discovered that the rebels had evacuated their position on the Rappahannock. Our army was put in motion and the pursuit of the rebels continued by the infantry to Brandy Station, and by the cavalry beyond. Our captures in the fight at Rappahannock were four guns, eight battle-flags, and over 1,900 prisoners....Capture of the rebel steamer Cornubia at Wilmington, N.C.", "1861-06-03": "BEAUREGARD arrives at Manassas Junction and takes command of the Confederate army. Border State Convention meet at Frankfort, Ky.", "1864-12-07": "A cavalry expedition started South from the Army of the Potomac....Engagement near Murfreesboro, Tenn.", "1863-06-10": "The draft in Indiana resisted....Engagement near Monticelio, Ky....Lake Providence attacked by rebels and successfully defended by negro troops....The Havelock sunk off Charleston bar.", "1864-08-26": "The rebel Gen. EARLY attempted to cross the Potomac, but was driven back by AVERILL....The rebels in SHERIDAN's front fall back.", "1864-03-08": "Special election in New-York State, resulting in allowing soldiers to vote -- Election in New-Hampshire....Gen. GRANT visited Washington.", "1862-02-20": "Winton, N.C., burned by Gen. BURNSIDE's troops....Gunboat reconnoissance up the Occoquan Creek, Va.", "1864-09-03": "Gen. SHERMAN issued a congratulatory order on the occupation of Atlanta....The rebels handsomely beaten near Berryville, Va......Rebel cavalry attacked by Gen. MILROY near Murfreesboro, Tenn.", "1863-07-02": "SECOND DAY OF THE BATTLE OF GETTYSBURGH. The rebels attacked our forces in large numbers, but were repulsed. Gens. WEED and ZOOK killed, and Gen. SICKLES wounded. The rebel Gen. BARKSDALE, of Mississippi, killed. Chambersburgh and Shippensburgh, Penn., evacuated by the rebels....Skirmish near Bottom's Bridge, Va....Tullahoma, Tenn., occupied by our forces.", "1862-02-05": "Gen. THOS. FRANCIS MEAGHER took command of the Irish Brigade in MCCLELLAN's army. ....British schooner Mars captured off Florida.", "1862-07-02": "Gov. MORGAN appealed to the people of New-York to volunteer.", "1862-06-24": "EVACUATION OF WHITE HOUSE LANDING by MCCLELLAN commenced. Gen. HOOKER's Division attacked by the rebels, who were repulsed at the point of the bayonet.... President LINCOLN at West Point, N.Y.", "1863-09-20": "The great battle at Chickamauga, Ga., continued....Union attack on Zollicoffer, Tenn.", "1864-09-14": "Secretary STANTON ordered the draft to be commenced Sept. 19....Gen. SHERMAN ordered the people of Atlanta to evacuate the city.", "1861-05-13": "Resumption of the interrupted communication with Washington via Baltimore -- Baltimore occupied by Federal troops -- Anti-Secession Convention in Western Virginia.", "1862-06-06": "Memphis, Tenn., occupied by the Union army....Great gunboat battle opposite Memphis; 7 of the enemy's gunboats and rams destroyed.... Gen. FREMONT attacked the rebel rear guard near Harrisonburgh, Va.", "1864-11-25": "ATTEMPTED BURNING OF A LARGE NUMBER OF HOTELS IN NEW-YORK CITY, BY REBEL SPIES....Severe fighting west of Columbia, Tenn., between HOOD's and THOMAS' armies....A large number of Federal prisoners continued at Saulsbury, N.C., attempted to escape, but were overpowered by the guard, who opened upon them with grape and canister....Cavalry battle at Sandersville, Ga....The Mayor of Milledgeville, Ga., sent a dispatch to Macon for provisions, as the citizens were utterly destitute.", "1863-03-05": "Severe engagement near Springville, Tenn.....Brig.-Gen. H.M. NAGLEE relieved of his command by Gen. HUNTER....Gen. HALLECK addressed a letter to Gen. ROSECRANS, relative to the treatment of disloyal persons....Col. COLBURN's force (Union) captured at Thompson's Station, Tenn.", "1864-03-21": "Engagement near Teachoes, La ...The rebels defeated at Nachitoches, on the Red River, La.", "1864-10-26": "Gen. DIX issued an order requiring all refugees from the South to register their names, declaring that those who refused or neglected to obey the order, should be treated as spies....Gen. GILLEM had a fight with the rebels at Norristown, East Tenn., completely routing them, and capturing a number of prisoners and pieces of artillery....Gen. GRANT's army returned to its old quarters....Fight with the rebel Gen. PRICE at Newtonia, Mo....A rebel force of 2,500 attacked Fayetteville, Ark., but was repulsed with heavy loss.", "1862-10-09": "Gen. GRANT recalled Gen. ROSECRANS from the pursuit of the rebels defeated at Corinth.... The rebel army under Gen. BRAGG, was attacked at Chaplin Creek on its retreat. A short but sharp fight ensued, when the rebels broke and fled... STUART's cavalry started on their expedition to Pennsylvania. The force consisted of 1,800 cavalry, 4 pieces of horse artillery, under command of Gen. HAMPTON and Cols. W.H. LEE and JONES. The troops rendezvoused at Darksville at 12 M., marched thence to the vicinity of Hedgeville, where they encamped for the night.", "1862-12-24": "Severe skirmish on the Blackwater.", "1864-11-04": "Engagement on the Tennessee River....The siege of Fayetteville, Ark., by the rebels, raised....Revelation by one of the conspirators of a plot to overthrow the Government, release and arm the rebel prisoners, and kill Gov. MORTON, of Indiana.", "1863-04-28": "Skirmish near Kinston, N.C., continued.....STONEMAN's cavalry crossed the Rappahannock at Kelley's Ford.", "1864-11-27": "Our stores and sick and wounded removed from Columbia, Tenn., to Nashville....Capture of ROGER A. PEYOR near Petersburg, Va....Gen. CANBY's troops reached and destroyed Big Black Bridge on the Mississippi Central Railroad.", "1861-05-17": "Union triumph in Kentucky. The Confederate Congress authorize the issue of $50,000,000 in bonds, payable in twenty years.", "1864-06-30": "Hon. SALMON P. CHASE resigned his position as Secretary of the Treasury. President LINCOLN sent to the Senate the nomination of DAVID TOD, of Ohio, as Secretary of the Treasury....Gen. KAUTZ's division of WILSON's cavalry force re-entered our lines, returning from their great raid.", "1863-03-03": "Act amendatory to the Tax Law passed both Houses of Congress, as amended by a Conference Committee....An expedition left Belle Blain, Va., for Northumberland County, Va....Gunboat Indianola destroyed by the rebels.", "1863-09-06": "THE REBELS EVACUATED FORTS WAGNER AND GREGG, CHARLESTON HARBOR, AT NIGHT.", "1863-04-26": "The rebels at Cape Girardeau, Mo., routed. ....Schooner Clarinda, blockade runner, captured.", "1861-03-21": "A vessel with supplies for the United States fleet seized by rebels off Pensacola.", "1861-01-07": "TOOMBS delivers a violent secession speech in the Senate -- Maj. ANDERSON's course in evacuating Fort Moultrie sustained by the House of Representatives.", "1863-08-18": "Bombardment of Fort Sumter continued.", "1863-09-28": "The Army of the Potomac reviewed by Gen. CORTEZ.", "1864-10-27": "Gen. DOUBLEDAY's Court-martial ordered to Baltimore to try the soldiers' voting fraud cases.....An advance in force, on a reconnoissance, made by WARREN's Corps of GRANT's army. In the evening the enemy attacked HANCOCK's Corps vigorously, but were repulsed. The purpose being accomplished, our troops were withdrawn to nearer their former lines....The rebel ram Albemarle sunk by Lieut. CUSHING, in the Roanoke River....Arrest of Col. NORTH on charges of fraud in the matter of soldiers' votes.", "1864-08-10": "Gen. SHERIDAN's army skirmishing near Winchester, Va. Sharp fight near Martinsburgh....Steamer Empress fired into by rebel batteries on the banks of the Mississippi....Sharp skirmish near Abbeyville, Miss.", "1862-03-20": "An expedition of engineers from Gen. POPE's army, having reached Commodore FOOTE above Island No. 10, started on its return and commenced cutting the famous canal for the passage of gunboats to New Madrid.", "1864-12-22": "Fighting near Gordonsville, Va....Loss of the United States transport North American, by foundering at sea. 194 lives lost.", "1861-02-08": "The Montgomery Convention adopt the Constitution of the United States for the Provisional Government of the \"Confederate States of America.\"", "1863-01-10": "Cavalry skirmish at Catlett's Station, Va....Battle at Arkansas Post commenced.....English steamer Rising Dawn captured.....Brig J.P. Ellicott captured by the privateer Retribution.", "1862-12-04": "Gen. BANKS and part of his expedition sailed from New-York.", "1862-03-18": "Ship Emily St. Pierre captured near Charleston S.C.....Steamer Nashville escaped from Beaufort N.C....Rebel gunboat sunk near New Madrid by a masked battery....Gen. DIX assigned to the command of the \"Middle\" Department....Aquia Creek, Va., evacuated by the rebels.", "1863-08-24": "Charleston, S.C., again shelled by Gen. GILLMORE.", "1863-12-08": "The House of Representatives unanimously passed a vote of thanks to Gen. U.S. GRANT and his army, and ordered that a medal be struck in his honor, in the name of the people of the United States....PROCLAMATION OF AMNESTY ISSUED BY THE PRESIDENT....Gen. AVERILL's expedition moved to cut the Virginia and Tennessee Railroad.", "1861-08-17": "Charleston blockading squadron increased -- It consists now of the Roanoke, Vandalia, Seminole and Iroquois -- Fernandina strictly blockaded -- Vessels arrive at Havana from Savannah and New-Orleans.", "1864-06-06": "An assault at midnight on BURNSIDE's corps repulsed....Gen. SHERMAN's army moved toward Marietta, Ga.....Gen. HUNTER pursued the rebels through Staunton, West Virginia.", "1862-12-11": "SHELLING OF FREDERICKSBURGH. The place occupied by our troops, who crossed in the face of a terrible fire. The city partially destroyed....Successful reconnoissance from Nashville....Arrival of two of Gen. BANKS' vessels, disabled, at Port Royal, S.C.", "1864-10-09": "An engagement took place near Fisher's Hill, Va., in which the rebels were defeated, leaving eleven pieces of artillery and other munitions of war.", "1862-09-14": "BATTLE OF SOUTH MOUNTAIN, MD. -- After a very severe engagement, the corps of Gens. HOOKER and RENO carried Hagerstown Heights by storm. Gen. FRANKLIN's Division engaged the enemy at Crampton's Gap, and, after a hot contest, gained a complete success. Gen. RENO was killed. The rebels retreated in the night toward the Potomac, our army pressing them closely. Our loss in the battle of South Mountain was, in killed, wounded and missing, 2,325....Attack on Harper's Ferry. At 2 o'clock A.M. Maryland Heights were abandoned. Col. D'UTASSY sent four companies to the Heights, who brought off four brass twelve-Sounders and a wagon-load of ammunition. Col. MILES' message reached Gen. MCCLELLAN. The rebels attacked our extreme left on Bolivar Heights, and were repulsed by Gen. WHITE. In the night our cavalry escaped from Harper's Ferry.....At light the rebels attacked our forces at Munfordsville, Ky., with artillery. After a hard artillery fight, the rebel infantry attacked our troops, and were repulsed five successive times.", "1863-12-04": "Rebel cavalry attack on our forage wagons near Harrison, twelve miles from Chattanooga.", "1861-07-21": "Battle of Bull Run.", "1863-01-12": "Gen. JOHN E. WOOL assumed command of the Department of the East headquarters at New-York City....JEFF. DAVIS' Message sent to the rebel Congress....Gen. JOHN A. MCCLERNAND congratulated his army on the capture of Arkansas Post.", "1862-02-17": "Two rebel regiments, marching to reinforce Fort Donelson, captured... Battle at Sugar Creek, Arkansas.", "1864-11-12": "The rebels in the Shenandoah Valley attacked our forces but were disastrously repulsed....Burning of Atlanta continued. The public buildings destroyed.", "1864-01-10": "A heavy fight occurred near Strawberry Plains, East Tennessee. The rebels repulsed with heavy loss....A battalion of Maryland cavalry attacked by the rebel guerrilla MOSBY, in London County, Va.", "1863-08-28": "The rebels driven across Bayou Metairie Bridge, Ark., with considerable loss.", "1862-01-13": "RESIGNATION OF SECRETARY CAMERON.... EDWIN M. STANTON was appointed Secretary of War.", "1863-10-14": "Battle of Broad River or Bristoe Station, Va.", "1863-10-03": "Proclamation of the President issued, appointing Nov. 26 as Thanksgiving Day....McMinnville attacked by rebels.", "1862-11-22": "The War Department issued an order releasing persons who had been imprisoned for resisting the draft, discouraging enlistments, &c., and also paroling persons who had been sent from the rebel States by the Military Commanders or Governors....Suicide of Brig.-Gen. FRANCIS E. PATTERSON.", "1863-04-20": "Great mass meeting in New-York in commemoration of the grand, uprising of the people in 1861....Opelousas and Washington, La., occupied by Gen. BANKS....Rebel fort at Butte a la Rose, La., captured.", "1862-10-03": "THE REBELS ATTACKED OUR ARMY NEAR CORINTH, MISS., early in the morning. The fight continued during the day, the rebels succeeding in capturing some of our guns, and driving our forces back three or four miles to the fortifications of the town....President LINCOLN reviewed the Army of the Potomac....Ship Brilliant, from New-York to London, burned by the pirate Alabama ....Union Gen. GEO. W. MORGAN reached Greenupsburgh, Ky., 15 miles from Portsmouth, Ohio, with his forces from Cumberland Gap, having marched 219 miles in 16 days.... Rebel Gen. JOHN MORGAN repulsed near Olive Hill, Ky.", "1864-07-19": "Our forces reached Peachtree Creek, four miles north of Atlanta, Ga. They were attacked by HOOD's troops.", "1862-02-21": "Execution of Capt. NATHANIEL P. GORDON, a slave-trader, at New-York....National troops defeated on the Rio Grande, New-Mexico.", "1864-06-25": "An attack on BURNSIDE's line at 11 P.M. Pretty severe engagement between our cavalry and the rebels at the Chickahominy River. Raid on SHERMAN's rear by 2,000 rebels....Destruction of railroad by WILSON's cavalry continued at Drake's Station....Engagement at Roanoke Station.", "1864-06-03": "BATTLE OF THE CHICAHOMINY. -- A short but terrible battle. Gen. GRANT assaulted the rebels at 4:30 A.M., driving them from their intrenchments at all points, but without gaining any decisive advantage. At 7 P.M. the rebels attacked. The battle lasted with great fury half an hour, at the expiration of which the rebels were repulsed. The blockader Water Witch captured by the rebels in Warsaw Sound.", "1863-12-14": "A portion of Gen. LONGSTREET's army made a descent from Rogersville and engaged the advance of our forces near Bean's Station....Gen. LONGSTREET divided his army and made, with one portion, an attack on Bean's Station, and with the other an attack on Kelly's Ford.", "1864-08-04": "Fast Day....A Government transport fired on by rebel batteries on the James River....Exchange of the Union and rebel officers under fire at Charleston, S.C....Gen. KELLY repulsed the rebels at New-Creek, Md. The fight continued until after dark, the rebels retiring in the night.", "1864-07-29": "The rebels crossed the Potomac on their raid into Maryland and Pennsylvania....Our cavalry occupied Fayetteville, Ga -- They cut the Atlanta and Macon Railroad....Fights with the rebels near Morganzia, La.", "1862-12-14": "Another raid of rebel cavalry into Poolesville, Md.....Firing on the rebel pickets or James Island, N.C....Kinston, N.C., occupied by Gen. FOSTER's Army....Rebel Saltworks at Yellville, Ark., destroyed by Capt. BIRCH....Gen. N.P. BANKS arrived at New-Orleans with his Expedition.", "1863-05-31": "Skirmishing near Monticelio, Ky.....Schooner Echo captured.", "1864-04-15": "Gen. MOSBY's force suddenly appeared near Bristow Station, Ga.", "1864-11-09": "Gen. SHERMAN issued his orders regulating the march of his army through Georgia, commanding his troops to forage on the country, to abstain from trespassing except when molested by guerrillas, & c., when corps commanders were authorized to devastate the surrounding country....Advance and repulse of a small rebel force near Fort Steadman, army of the Potomac.", "1861-01-02": "Fort Pulaski, at Savannah, taken by order of the Governor of Georgia.", "1862-09-28": "English steamer Sunbeam captured by the gunboats Stale of Georgia and Mystic while attempting to run the blockade at Wilmington, N.C.", "1861-08-26": "Skirmish at Summersville.", "1864-12-05": "Meeting of Congress.", "1861-09-11": "The Kentucky Legislature pass a resolution ordering rebel troops to leave the State -- The President, in a letter to Gen. FREMONT, directs him to modify the confiscation clause of his proclamation of Aug. 30.", "1861-01-19": "Secession of Georgia.", "1860-12-31": "Exciting session of the Senate -- Mr. BENJAMIN, of Louisiana, delivers a violent secession speech.", "1861-01-22": "Arms destined for Alabama seized in New-York.", "1862-03-08": "BATTLE OF PEA RIDGE ENDED, by the defeat and rout of the rebels....BEAUREGARD called on the planters to send their bells to depots, for conversion into cannon....The Army of the Potomac divided into five Corps d'Armee.....THE MERRIMAC, FROM NORFOLK, ATTACKED OUR FLEET IN HAMPTON ROADS. She sunk the Cumberland. The Congress surrendered and was burned. The Minnesota grounded. The St. Lawrence was engaged. The gunboats Oregon and Zouave were badly damaged.", "1863-10-17": "Spirited engagement at Manassas Junction....The President called for 300,000 volunteers to be raised before the 5th of January, stating that a draft would then take place for any deficiency in the quotas ot the States existing at that time.", "1862-09-07": "Gen. MCCLELLAN left Washington, under orders to drive the enemy from Maryland, most of his force having preceded him. He established his headquarters at Rockville, Md.....Schooner Starlight captured by the Alabama, near Flores. ....Bowling Green, Ky., occupied by our advance force under Gen. NEGLEY....Gen. POPE relieved of the command of the Army of Virginia, and assigned to that of the Northwest.", "1862-08-17": "Gen. MCCLELLAN's advance from Harrison's Landing reached Hampton.", "1863-10-29": "Furious bombardment of Fort Sumter.", "1864-11-02": "Gov. SEYMOUR issued a proclamation relative to the election....Gen. DIX issued an order concerning fraudulent voting.", "1862-01-10": "Expedition bound down the Mississippi left Cairo.... HUMPHREY MARSHALL defeated near Prestonburgh, Ky.", "1861-11-18": "Message of JEFF. DAVIS to the rebel Congress.", "1864-03-22": "Gen. THAYER, with an army of 5,500 men, left Fort Smith, Arkansas, to cooperate with Gen. STEELE's army.", "1863-11-01": "Discovery of a plot to liberate the rebel prisoners in Ohio.", "1862-06-01": "The battle of Fair Oaks continued. This day's fight was very severe, and we regained our position of the day before. The Union loss in two days' battles was, in killed, wounded and missing, 5,739 ...The rebels driven out of Strasburgh, Va., and the town occupied by FREMONT's army.", "1863-03-12": "Successful rebel raid to Hilton Head Island, S.C., in the night....Gunboat Chilticothe attacked at the town of Greenwood, near Vicksburgh.", "1862-04-17": "Mount Jackson and Newmarket, Va., occupied by BANKS' troops....A part of MCDOWELL's force marched from Warrenton on Fredericksburgh....An expedition, under Gen. RENO, left Newbern, N.C., to attack a body of rebels near Elizabeth City.", "1863-01-17": "Steamer Vanderbilt arrived at Fortress Monroe after an unsuccessful cruise after the Alabama....Rebel privateer Oreto destroyed the brig Estelle.", "1864-05-29": "The rebels made a night attack on SHERMAN, but were repulsed.....Gen. \"Baldy\" SMITH's command arrived at Fortress Monroe from Bermuda Hundreds on its way to join Gen. GRANT.", "1864-01-19": "An unsuccessful attempt was made to burn JEFF. DAVIS' house at Richmond.", "1862-03-27": "Schooner Julia Warden captured near Charleston, S.C.", "1864-06-18": "SEVERE BATTLE NEAR LYNCHBURGH, VA. -- Our forces charged, were repulsed, and charged again. Finding the enemy's position too strong, and numbers too great, our forces commenced falling back. Our forces advanced close to Petersburg Va....The rebels before Gen. SHERMAN gave way at night, abandoning their works in front of Kenesaw Mt.", "1863-06-01": "Meeting of sympathizers with VALLANDIGHAM at Philadelphia....James Island evacuated by the Union troops.", "1863-11-25": "Brisk engagement near Chattanooga. The rebels driven entirely off Lookout Mountain. Missionary Ridge taken from the rebels. Battle of Tunnel Hill. Gen. GRANT announced a complete victory over BRAGG....The rebels repulsed at Kingston, Tenn.", "1864-10-20": "Capture of the St. Albans robbers....Skirmishing between the Little and Big Blue River, Mo.", "1862-01-21": "Gen. MCCLERNAND's expedition returned to Cairo, from reconnoitering in the vicinity of Columbus, Ky.", "1862-12-07": "BATTLE OF FAYETTESVILLE OR PRAIRII GROVE, ARK., Union victory....Battle with MORGAN's force at Hartsville, Tenn. A Union brigade captured by the rebels, who were afterward put to flight......Capture of the California steamer Ariel by the pirate Alabama. The Ariel was released on giving bonds for $228,000, payable 30 days after the recognition of the Southern Confederacy.", "1864-02-29": "At 8 o'clock A.M., Gen. KILPATRICK's forces took up their line of march along the road to Spottsylvania Court-house, Va., en route for the junction of the Virginia Central and the Richmond and Fredericksburgh Railroad. The command arrived at Spottsylvania Court-house. Col. DAHLGREN's command attacked. Great destruction of bridges, railroad track, & c., & c., KILPATRICK reached and destroyed a portion of the Richmond and Fredericksburgh Railroad. His forces left Frederickshall for Richmond....Gen. BUTLER ordered to send out a force to meet KILPATRICK.", "1862-11-20": "Skirmish at Charlestown, Va.", "1863-06-19": "The rebels crossed the Ohio River into Indiana....Skirmish at Orleans, Ind.", "1860-12-29": "Mr. FLOYD tenders his resignation as Secretary of War -- President BUCHANAN accepts it.", "1863-09-07": "Gen. GILLMORE took possession of Fort Wagner and Battery Gregg in the morning, having captured 36 pieces of artillery and a large amount of ammunition.", "1864-01-06": "Skirmish at Newtown, West Virginia.", "1864-12-13": "DEPARTURE OF THE GREAT NAVAL EXPEDITION FROM FORTRESS MONROE....Fort McAllister, Savannah, carried by assault, with its garrison and stores....Sharp skirmishing near Nashville....The St. Albans robbers released by the Canadian Judge COURSOL....The rebels routed at Kingsport, Tenn.....Gen. SHERMAN reported his arrived before Savannah without the loss of a wagon.", "1863-07-05": "The day occupied by Gen. MEADE in succoring the wounded and burying the dead left on the field of Gettysburgh.", "1863-07-12": "Our forces entered Hagerstown, Md., the rebels having evacuated the town in the night.....Our forces having passed through South Mountain, came up with the rebel army of Gen. LEE, securely posted on the heights of Marsh's Run.", "1864-11-23": "Our forces withdrew from Pulaski, Tenn....SHERMAN's cavalry occupied Toomsboro, on the Georgia Central Railroad....Fight near Griswoldville, Ga....HOOD's infantry at Waynesboro and Lawrenceburgh....Fight at the Oconee River, Ga.", "1861-01-23": "Second seizure of arms in New-York.", "1861-10-17": "The Nashville runs the blockade at Charleston.", "1862-02-18": "Proclamation of Gen. BURNSIDE and Flag-Officer GOLDSBOROUGH in North Carolina issued. ....Skirmish at Independence, Mo....Rebel Congress met at Richmond.", "1861-02-02": "The cutter Lewis Cass surrendered to the State of Alabama.", "1860-12-30": "Arsenals in South Carolina seized by State troops.", "1863-05-14": "JACKSON, MISS., TAKEN BY GEN. GRANT.....Resignation of Gen. THOS. F. MEAGHER accepted....Schooner Sea Bird captured....Clinton, Miss., occupied by our troops.", "1864-06-14": "Very heavy skirmishing between SHERMAN's army and the rebels; the position of our army changed in the night.", "1861-04-13": "Surrender of Sumter.", "1863-02-02": "A bill providing for the employment of negro soldiers passed the United States House of Repsentatives....Rebel camp at Middletown, Tenn., surprised....Department of Washington, under command of Gen. HEINTZELMAN, constituted....The Union ram Queen of the West ran past the rebel batteries at Vicksburgh, and attacked the rebel steamer City of Vicksburgh.", "1862-04-02": "Gen. BANKS' force proceeded from Strasburgh to Woodstock, Va., and were engaged with the enemy at the latter place.....The President's Emancipation and Compensation resolutions passed the Senate....Thoroughfare Gap, Va., occupied by Gen. GEARY's Union army....Early in the morning, Col. ROBERTS spiked the guns of the upper rebel battery at Island No. 10....The pioneer steamer passed through the newly-constructed canal from above Island No. 10 to New-Madrid.", "1862-06-08": "Battle of Cross Keys, Va. FREMONT's army engaged.", "1861-01-28": "Withdrawal of the Georgia Delegation from Congress -- The Legislature of South Carolina resolve to demand the surrender of Sumter.", "1863-03-31": "Great Union meeting in Washington....Sharp battle near Somerset, Ky. -- the rebels defeated....Jacksonville, Fla., evacuated by Union troops, the town having been burned by them....Union gunboat St. Clair attacked by the rebels on the Cumberland....Woods near Washington, N.C., shelled by Union gunboats....The rebels opened fire on the fort back of Washington, N.C., the place being closely invested by the rebels....The rebel batteries at Grand Gulf on the Mississippi attacked....Schooner Antelope captured off Charleston, S.C.", "1864-05-04": "The crossing of the Rapidan by the Army of the Potomac continued....Gen. MEADE issued an address to the Army of the Potomac on the commencement of their march. Gen. WARREN's headquarters at the Wilderness...A fleet of transports on Hampton Roads commenced embarking troops.....Rebel raid into Princeton, Kentucky.", "1862-12-08": "The President ordered the execution of thirty-nine Indians in Minnesota, to take place of Dec. 19....Steamer Lake City destroyed by the rebels at Concordia, Ark.", "1863-06-11": "C.L. VALLANDIGHAM nominated for Governor of Ohio....Darien, Ga., destroyed by our forces....The Herald destroyed by Union gunboats, Charleston Harbor....Steamer Calypso captured....Gen. HALLECK directed the Garrtsons at Martinsburgh and Winchester, Va., to retire to Harper's Ferry....Triune, Tenn., attacked by the rebels.", "1863-03-24": "Capture of a guerrilla party near Stafford Court-house, Va....Our fleet commenced entering the Yazoo Pass near Vicksburgh.", "1863-03-22": "Gen. WOOL, commanding the Department of the East, issued an order relative to deserters....Capture of Mount Sterling, Ky., by rebels, who burned the town....Steamer Granite City captured off the Bahamas....Steamer Bio Bio burned at New-Orleans.", "1862-07-12": "Gen. ALBERT PIKE resigned his command in the rebel army....Gen. CURTIS' command arrived at Helena, Ark.", "1863-11-05": "Ball in New-York in honor of the Russians....Skirmish at Metley's Ford, Tenn....Capture of the steamer Margaret and Jessie by the Fulton ....Gen. AVERILL attacked and defeated the enemy near Lewisburgh, capturing three pieces of artillery, 100 prisoners, and a large number of small arms, wagons, and a large quantity of camp equipage. The enemy's loss in killed and wounded estimated at 300.", "1861-02-21": "The President elect in Philadelphia -- He learns of a plot to take his life.", "1863-04-09": "Fight at Blount's Bridge, N.C. and at Kuff's Mills, N.C.", "1861-12-12": "Occupation of Tybee Island by National troops.", "1863-10-05": "Railroad bridge south of Murfreesboro', Tenn., destroyed by the rebels....The rebel batteries opened on ROSECRANS at Chattanooga.....Frigate Ironsides attacked by a rebel vessel and torpedo in Charleston Harbor in the night....Engagement at Blue Springs, Tenn.", "1862-10-21": "Expedition from MCCLELLAN's Army to intercept a force of rebel cavalry foraging in London County, Va. The Expedition was successful.... Dashing reconnoissance in the direction of Leesburgh, Va. Skirmishing with the rebel cavalry. ....Gen. JEFF. C. DAVIS released from arrest, and ordered to report for duty at Cincinnati....An expedition, consisting of 4,000 or 5,000 men, with artillery, and fifteen transports and gunboats, left Hilton Head for a reconnoissance along the Charleston and Savannah Railroad....Successful attack on a rebel force near Nashville, Tenn.", "1861-05-21": "Seizure of telegrams by the Government.", "1863-02-21": "The pirate Alabama burned the bark Olive Jane.", "1861-09-16": "Wholesale arrest of members of the Maryland regiment.", "1860-12-27": "The Palmetto flag raised in Charleston -- Forts Pinckney and Moultrie occupied by State troops.", "1863-12-17": "The steamer Chesapeake, captured by rebel passengers on Dec. 6, retaken by the Elia and Annie in Sambro Harbor, near Halifax....Raid of STUART's rebel cavalry on the Orange and Alexandria Railroad.", "1861-09-25": "Occupation of Romney, Western Virginia, by National troops.", "1861-04-25": "Virginia joins the Confederate States.", "1864-07-16": "A rebel force captured the Federal stockade at Brownsboro, on the Memphis and Charleston Railroad.", "1862-11-16": "Gen. BURNSIDE's headquarters moved to Catlett's Station, Va.", "1863-02-07": "Reconnoissance from the right wing of the Army of the Potomac....Engagement near Williamsburgh, Va.", "1863-05-02": "Battle of Chancellorsville continued....Culpepper Court-house, Va., fell in our hands ....BIG BLACK RIVER, MISS., REACHED BY OUR FORCES....COL. GRIERSON's CAVALRY FORCE reached BATON ROUGE, LA., FROM TENNESSEE.", "1864-09-01": "THE BATTLE OF ATLANTA CONTINUED. -- A brilliant charge was made at 5 P.M. by Gen. DAVIS' force, resulting in the discomfiture of the rebels and surrender of a large number. Great destruction by the rebels of large magazines of stores accumulated at Atlanta. They blew up, in addition to other things, 80 car-loads of ammunition. Gen. SLOCUM's corps assaulted the enemy's works around the city in the afternoon....Panic and evacuation of the city.", "1863-11-06": "Engagement in West Virginia....Reconnoissance of the Chowan River, N.C., to near the mouth of the Blackwater.", "1863-10-02": "Successful cavalry engagement at Anderson's Cross-roads, Ky.", "1861-05-24": "Advance of the Union Army into Virginia. Assassination of Col. ELLSWORTH.", "1861-11-23": "Bombardment of the rebel batteries by Fort Pickens and the ships-of-war Niagara and Richmond.", "1862-07-22": "The President issued an order for the seizure of supplies needed by our armies; directing that negroes should be employed as laborers, giving them wages for their labor....The President ordered that foreigners should not be required by military commanders to take the oath of allegiance.", "1863-03-29": "Williamsburgh, Va., attacked by the rebels.", "1864-05-15": "BATTLE OF RESACA, GA. An all-day battle, in which we were successful. The rebels forced to evacuate Resaca. Gen. JOHNSTON retreated from our front in the night....Gen. SIGEL fought a battle at Newmarket, Va. The rebels successful. Our forces fell back to Strasburgh, Va... Gen. BANKS' gunboats arrived at Fort de Russey, La.", "1861-03-02": "Revenue cutter Dodge seized by the Texan authorities.", "1863-05-27": "Presentation of Kearney medals to the Third army corps....Rebels defeated at Florence, Ala....Attack on Port Hudson commenced....Union gunboat Cincinnati sunk by rebel batteries at Vicksburgh.", "1863-10-10": "Sharp fight with the rebel STUART's cavalry at Robertson's River....Skirmish between the rebels and Gen. BURNSIDE's forces at Blue Springs, Tenn....Engagement at James City, Va. ....Commencement of the strategical movements of the Army of the Potomac and that of Gen. LEE....JEFF. DAVIS reviewed the rebel army before Chattanooga.", "1863-02-15": "Slight skirmish near Nolinsville, Ky.", "1862-01-03": "Reconnoissance to Big Bethel, Va.", "1862-12-15": "FREDERICKSBURGH EVACUATED BY OUR ARMY in the night. BURNSIDE's Army crossed to Falmouth....Gen, BUTLER issued his farewell address to his army.", "1864-04-13": "Rebel Gen. BUFORD appeared before Columbus, Ky., and demanded its unconditional surrender, threatening, in case of refusal, to give no quarter to negro soldiers. The enemy retired without an attack....A portion of BANKS' army attacked near Blair's Landing, La. The rebels repulsed with slaughter.", "1862-10-24": "GEN. BUELL REMOVED FROM THE COMMAND OF THE ARMY IN KENTUCKY, and Gen. ROSECRANS assigned to the command....Gen. H.S. GRANT reported a skirmish at Brownsville, Tenn., in which the rebels were defeated with a loss of 40 prisoners and some property....Difficulty with the coal miners, in Pennsylvania, relative to the draft, adjusted....Skirmish with MORGAN's guerrillas at Morgantown, Ky.; 16 rebels captured.... English steamer Scolia, loaded with arms, powder, &c., captured at Bull's Bay, S.C.....Gen. WEITZEL's Brigade, 5,000 strong, left Carrollton above New-Orleans. The expedition was made up of transports and gunboats.", "1862-11-15": "A.J. HAMILTON appointed Military Governor of Texas....Artillery fight near Fayetteville, Va....Warrenton, Va., evacuated by our troops.", "1864-05-27": "Gen. GRANT's army all in motion. THE BATTLE OF DALLAS, GA., CONTINUED. Severe fighting on SHERMAN's left. SHERMAN's headquarters at Dallas.....Gen. SHERIDAN took possession of Hanover Ferry and Hanoverton, Va.", "1862-04-07": "SURRENDER OF ISLAND No. 10. -- Gen. POPE having crossed his army to the Tennessee shore below the Island.....Battle of Pittsburgh Landing continued....Our troops, reinforced, retook the camp and batteries captured by the rebels on the 6th, and captured a large number of prisoners. The enemy put to a full retreat, and Gen. A.S. JOHNSTON (rebel) killed.....The rebels were commanded by POLK and BEAUREGARD.", "1862-08-29": "BATTLE AT GROVETON, NEAR BULL RUN. The Corps of Gen. SIGEL engaged. The battle of this day ended in a victory for our arms, and at night our army rested near its dead and wounded. The engagement was furious, and the rebels were everywhere repulsed. Col. FLETCHER WEBSTER killed....Return of the Seventh Regiment to New-York.", "1862-11-06": "Death of Brig.-Gen. CHAS. D. JAMESON.... Warrenton, Va., occupied by advance of the Army of the Potomac....Death of Commodore G.J. PENDERGRAST, U.S.N....Advance of Gen. MCCOOK's corps arrived at Nashville....English schooner Dart captured.", "1862-10-04": "After a quiet night, the attack on our troops at Corinth, Miss., was resumed early in the morning. The battle ended by a retreat of the whole rebel army. It was won with great loss on both sides....Gen. BUELL's troops reached Bardstown, Ky., driving out the enemy's rear guard of cavalry and artillery. The pursuit was continued toward Springfield.", "1861-04-03": "Great preparations commenced in the Northern Navy Yards.", "1864-10-25": "Fighting in Missouri. The rebels badly whipped.", "1864-12-24": "ATTACK ON FORT FISHER, WILMINGTON, BY PORTER's FLEET. The bombardment lasted from 1 P.M. till night. A furious cannonade.", "1864-02-23": "Bombardment of Fort Powell, Mobile Bay, by our mortars....Desperate charge on the rear-guard of Gen. SMITH's cavalry force....Skirmish near Tunnel Hill, Ga. In the afternoon a contest for its possession commenced.", "1864-02-22": "Gen. PALMER's forces occupied Ringgold, Ga.....The expedition up the Savannah River withdrew....Loss of the steamer Bohemian off Cape Elizabeth....Opening of the great Sanitary Fair in Brooklyn....Call of the Republican National Committee, appointing June 17, as the day for the convention to meet at Baltimore.", "1861-10-07": "Gen. FREMONT and his army leave Jefferson City in pursuit of PRICE.", "1864-11-28": "Our forces evacuated Columbia, Tenn....The rebels surprised and captured Fort Kelly on New-Creek, Va.", "1864-07-12": "ENGAGEMENT NEAR FORT STEVENS, ONE OF THE DEFENCES OF WASHINGTON. The rebels driven off....Gov. SEYMOUR issued a general order, directing the Commanders of regiments of the National Guards to hold themselves in readiness for immediate service....Gov. PARKER, of New-Jersey, issued a proclamation calling on the people of his State to organize for 30 days' service.", "1864-01-24": "Gen. BUTLER issued an order forbidding the passage through our lines of white women and children from the South.", "1862-02-03": "The privateersmen who, up to this date, were confined in the city jails were released therefrom and imprisoned in Fort Lafayette.... Rebel steamer Nashville sent from Southampton, Eng. The Union gunboat Tuscarora, starting in pursuit, was stopped by British frigate Shannon.", "1863-10-12": "The rebels driven to Brandy Station, Va.", "1862-10-23": "Dashing fight at Waverley, Tenn., between a small force of rebels and Union soldiers, in which the rebels were defeated and lost many more than we did....Skirmishing in Kentucky with MORGAN's guerrillas....Ship Lafayette, of New-Haven, captured and burned by the pirate Alabama....English schooner Francis captured.", "1863-01-01": "THE EMANCIPATION PROCLAMATION OF PRESDENT LINCOLN, DECLARING SLAVES IN THE INSURRECTIONARY STATES AND DISTRICTS FOREVER AND HENCEFORWARD FREE, issued....The battle of Murfreesboro, Tenn., commenced Dec. 31, 1862, continued. The engagement opened at dawn by Gen. ROSECRANS. The battle was hotly contested, and the losses great on both sides....The rebel guerrilla MORGAN defeated in Kentucky....Emancipation Jubilee of the negroes at Hilton Head, S.C...The rebel Gen. FORREST defeated at Hunt's Cross Roads, Tenn., by Gen. SULLIVAN....Galveston, Texas, recaptured by the rebels, who also took the steamer Harriet Lane. The steamer Westfield was blown up by its commander to prevent it from falling into the hands of the rebels....Gen. BUTLER and Staff arrived in New-York City from New-Orleans....Charges preferred against the New-York Police Commissioners for illegal action in making arrests for treason, &c.", "1863-08-17": "Great distruction of rebel property at Grenada by our troops from Tennessee....COMMENCEMENT OF THE GRAND ATTACK ON FORT SUMTER, CHARLESTON HARBOR. The iron-clad fleet and the land batteries attacked the fort....Explosion of the steamer City of Madison on the Mississippi....Address of Gen. DIX to the citizens of New-York relative to the draft....Reconnoissance in force from the rebel army in Virginia....Steamer Nita captured running out of Mobile.", "1863-02-03": "The rebels repulsed in an attack on our forces at Dover, Tenn., by Union gunboats....Fort Donelson, Tenn., invested by the rebels.", "1864-09-08": "Brownsville, Texas, attacked by CORTINAS, and the rebels driven from the town....Gen. MCCLELLAN accepted the nomination for the Presidency....Gen. SHERMAN ordered the removal of the inhabitants of Atlanta, and proposed a truce of ten days.", "1863-08-23": "Fort Fisher, near Wilmington, N.C., bombarded by the frigate Minnesota....Capture of JEFF. THOMPSON.", "1864-01-07": "Obsequies of Archbishop HUGHES....Arrest of A.M. PALMER, Private Secretary of Collector BARNEY, for complicity in shipping goods to the rebels. He was sent to Fort Lafayette....Death of Judge CALEB B. SMITH, late Secretary of the Interior.", "1862-05-03": "Rebels near Farmington, Miss., attacked. The position carried and two bridges destroyed.", "1864-02-08": "A band of rebel guerrillas crossed from Missouri into Kansas, near Aubrey....The Florida expedition reached Jacksonville, Fla.", "1863-11-03": "ELECTION IN NEW-YORK, NEW-JERSEY, MASSACHUSETTS, MINNESOTA, MISSOURI and WISCONSIN....Success of the Union ticket in all the States but one....Reconnoissance to Falmouth, Va....Repulse of the rebels at Colliersville, Tenn....Battle of Bayou Coteau in the Teche country, La.", "1864-11-13": "Gen. SHERMAN's right wing, under Gen. HOWARD, moved out of Atlanta and began its march through Georgia.", "1863-10-11": "The Army of the Potomac withdrew to the north side of the Rappahannock....Attack on the Memphis and Charleston Railroad, near Germantown, Tenn.", "1862-02-25": "NASHVILLE, TENN., OCCUPIED BY THE UNION ARMY....Order issued by the War Department forbidding the publication of war news not authorized by the Government. The telegraph lines taken possession of the Government.", "1862-05-13": "MCCLELLAN's advance guard at White House, Va.; Gen. MCCLELLAN's Headquarters at Cumberland, near which was skirmishing with the enemy.", "1862-07-14": "Gen. POPE assumed command of the Army of Virginia, and issued his famous order, discarding the idea of maintaining lines of retreat and bases of support....Battle at Fayetteville, Ark.", "1861-03-16": "Adjournment of the Southern Congress.", "1861-05-08": "Shipment of arms via the Mississippi prohibited.", "1863-02-23": "Bill authorizing the suspension of the writ of habeas corpus passed by the United States Senate.", "1862-04-26": "Com. FARRAGUT demanded the surrender of New-Orleans. The Mayor replied that the city was at the mercy of our gunboats....Capture of a rebel outwork at Yorktown....Fort Macon occupied by our forces.", "1863-10-18": "Gen. GRANT ASSUMED COMMAND OF THE DEPARTMENTS OF THE OHIO, CUMBERLAND, AND TENNESSEE....Charlestown, Va., attacked by the rebels....Arrival of Secretary STANTON in Louisville, Ky.", "1862-10-15": "Gen. STAHL left Centreville, with cavalry and artillery, to find the rebel Gen. STUART. He had some skirmishes, but nothing decisive resulted therefrom....Heavy fight between Lexington and Richmond, Ky., in which the rebels were repulsed....Our army reached Crab Orchard, Ky., after severe skirmishing....Bark Lamplighter, of Boston, captured and burned by the pirate Alabama.", "1863-05-20": "Steamer Stono, late United States gunboat Isaac Smith, destroyed off Charleston....Bark Goodspeed destroyed by the Tacony....VICKSBURGH INVESTED.", "1863-02-16": "The Conscription bill passed by the United States Senate....Brig.-Gen. THOS. G. STEVENSON placed in arrest by Gen. HUNTER, at Port Royal, for objecting to fight in company with negroes.", "1863-12-10": "Shells thrown into Charleston, S.C., in the night.", "1862-02-08": "BATTLE OF ROANOKE ISLAND continued. The Island, with all its fortifications, captured, -- 3,000 stand of small arms, 3,000 prisoners, 6 forts and large quantities of military supplies taken by Gen. BURNSIDE's force. Capt. O. JENNINGS WISE mortally wounded....Rebel boats, the Sallie Wood and Muscle, captured at Chickasaw, Miss.; also, three steamboats burned at Florence, Ala.", "1861-04-12": "The Charleston batteries open on Sumter.", "1864-07-20": "THE REBELS ASSAULTED SHERMAN's ARMY THREE TIMES -- each time being repulsed. Our army was engaged all day and drove the rebels steady on into their intrenchments....Gen. SMITH's forces reached La Grange, Tenn....Gen. \"Baldy\" SMITH took leave of his command before Petersburgh, Va., and Gen. MARTINDALE assumed command....Gen. AVERILL attacked and dafeated the rebel EARLY in front of Winchester, Va.", "1864-09-30": "Gen. WARREN attacked and carried the rebel line on their extreme right, capturing a number of prisoners....Gen. MEADE moved from his left and carried the enemy's line near Poplin Grove Church.....Gen. BUTLER's forces assaulted the rebels in three columns near Chapin's Farm.", "1864-02-25": "Gen. KILPATRICK's FORCES COMMENCED MOVING ON AN EXPEDITION TO RICHMOND....Skirmish at Bean Station....Our army in front of Dalton, Ga. TUNNEL HILL CARRIED BY OUR FORCES AFTER CONSIDERABLE FIGHTING....Rebel raid on Maysville, Ky.", "1863-01-13": "Peace resolutions introduced into the New-Jersey Legislature.", "1862-02-10": "The rebel squadron from Roanoke Island attacked and destroyed.....Elizabeth City, N.C., surrendered....Martial law proclaimed in Kansas.", "1862-01-23": "A second fleet of stone-laden vessels sunk in Charleston, S.C., harbor....Rebel steamer Calhoun captured off Southwest Pass, month of the Mississippi.", "1863-06-06": "Bark Whistling Wind destroyed by a privateer....Rebels attacked Milliken's Bend and Young's Point, near Vicksburgh, but were repulsed....Shawneetown, Kan., destroyed by guerrillas.", "1862-10-28": "Our troops occupied Halltown, Va., and our pickets extended beyond there....Gen. PRICE's, pickets driven from Grand Junction.... The Union troops, under Brig.-Gen. HERRON, attacked a rebel camp four miles, from Fayetteville, Ark. After a sharp engagement of an hour the enemy were completely routed, leaving all their camp equipage and a few wagons. Gen. HERRON pursued the rebels several miles into the Boston Mountains....Skirmish at Snicker's Gap, Va.... Bark Laurietta captured and burned by the pirate Alabama.", "1862-04-30": "Cannonading at Yorktown....The rebels cut the telegraph wire near Huntsville, Ala., and attacked one of our brigades.", "1863-12-12": "Gen. BUTLER gave notice that the rebel authorities had refused to receive more supplies for the Union prisoners in Richmond....The rebel General JOHN MORGAN escaped across the Tennessee River at Gillespie's Landing, 60 miles from Chattanooga.", "1861-07-30": "The pirate Sumter supplied with coal at Trinidad.", "1862-01-08": "Rebels in Randolph County, Mo., routed.", "1862-07-24": "Gen. HALLECK left Washington for Fortress Monroe....British steamer Tubal Cain captured.", "1863-05-13": "The rebels defeated at Mississippi Spring, Miss....Gen. JOE JOHNSTON arrived at Jackson, Miss....A large amount of rebel property destroyed at Yazoo City....Schooner A.J. Hodge captured....Ship Crown Point burned by the Florida.", "1864-02-28": "Gen. KILPATRICK's forces made demonstrations in front of the rebel works at Mine Run. Gen. CUSTER started on a reconnoissance toward Gordonsville, in cooperation with Gen. KILPATRICK....Arrival of Gen. SHERMAN at Vicksburgh, Miss., on his return from his great raid through Mississippi.", "1862-07-11": "Gen. HALLECK assigned by the President to the command of the whole land forces of the United States, as General-in-Chief.", "1862-06-18": "Cumberland Gap occupied by Union Gen. MORGAN's force.", "1861-12-25": "Retreat of the rebel Gen. PRICE to Arkansas.", "1864-05-06": "BATTLE OF THE WILDERNESS CONTINUED. -- Another day of terrible fighting, resulting in the falling back of LEE's army. Gen. WADSWORTH killed. The rebel Gen. LONGSTREET wounded. Our wounded, who had been removed to Fredericksburgh, fired on by citizens....Gen. BUTLER's forces effected a successful landing without resistance.", "1864-04-21": "Successful expedition to Hasonborough, N.C.", "1864-08-08": "SURRENDER OF FORT GAINES TO COMMODORE FARRAGUT.....Gen. SHERIDAN assigned to the command of the troops in the Shenandoah Valley....Steamboat Vanderbilt sunk in the Hudson.", "1864-12-10": "Gen. SHERMAN's troops five miles from Savannah....Rebel reconnoissance toward the Army of the Potomac.", "1862-03-01": "JOHN MINOR BOTTS arrested in Richmond, Va., for treason to the Confederacy....Schooner British Queen captured endeavoring to run the blockade at Wilmington, N.C.", "1864-12-23": "Fight near Gordonsville, Va.", "1863-06-20": "Ship Isaac Webb captured and bonded by the Tacony.....Frederick, Md., occupied by the rebels.", "1862-10-01": "President LINCOLN arrived at Harper's Ferry....Gen. HALLECK sent to Gen. MCCLELLAN, urging him to cross the Potomac at once, and give battle to the enemy....Gen. PLEASANTON crossed the Potomac on a reconnoissance, near Shepherdstown. He met the rebels there, and drove them to Martinsburgh....Secretary STANTON transferred the Western gunboat fleet to the Navy Department....Gen. BUELL's army left Louisville, Ky.", "1864-09-02": "ATLANTA, GA., OCCUPIED BY SHERMAN's ARMY AT 11 A.M.....Sharp fighting near Martinsburg, Va.", "1861-02-05": "Withdrawal of the Louisiana Delegation from Congress.", "1864-09-05": "Steamer Elsie captured in running the blockade at Wilmington....The President issued a proclamation, recommending that Sunday, Sept. 11, be observed as a day of Thanksgiving.", "1863-12-19": "The Chesapeake delivered over to British authorities at Halifax. The prisoners, on landing, were rescued by the citizens.", "1862-06-10": "Skirmish near James Island.", "1864-04-05": "Fight between gunboats and guerrillas at Hickman, Ky....Gen. GRANT left Washington for the Army of the Potomac.", "1863-06-22": "Millerstown, eight miles from Gettysburgh, Penn., occupied by the rebels.....Greencastle reoccupied by the rebels. The portion of EWELL's corps which had not yet arrived in Pennsylvania crossed the Potomac and moved up the valley.....The rebels driven from Cumberland, Md.....Brashear City, La., captured by the rebels.", "1863-07-20": "Gov. SEYMOUR ordered the return of the State arms used against the rioters in New-York City.....Cavalry reconnoissance to Front Royal, Va.....Sharp fight with the rebel guerrilla MORGAN, and capture of a large portion of his force at George's Creek.....Destruction of railroad and other property at Rocky Mount, N.C., by an expedition of Union troops.", "1863-06-07": "Battle of Milliken's Bend concluded.", "1863-05-16": "Recapture of the cavalry taken by the rebels at Charlestown, Md....Rebels under Gen. PEMBERTON defeated at Edward's Station, Miss.....GREAT BATTLE AT BAKER's CREEK, NEAR VICKSBURGH, CALLED THE BATTLE OF CHAMPION's HILL....Engagement at Berry's Ferry, Va.", "1864-08-17": "The Tallahassee scuttled the schooner North American, and bonded the brig Neva for $17,500.", "1863-09-10": "Little Rock, Ark., occupied by our forces.", "1864-10-29": "Maryland proclaimed a Free State by Gov. BRADFORD.", "1862-07-04": "Gen. MCCLELLAN issued a congratulatory address to his army, in which he declared that it should enter Richmond.", "1864-03-13": "A portion of our fleet arrived before Alexandria, La., and demanded its surrender, which was complied with.", "1861-05-03": "President issues a proclamation calling formore troops to serve for three years, and directing the increase of the Regular army and the enlistment of addition seamen.", "1863-09-24": "Alexandria, Va., opened to trade by Proclamation of the President.", "1861-05-27": "Occupation of Newport's News by Gen. BUTLER.", "1863-07-16": "The draft riot in New-York continued; Archbishop HUGHES invited the mob to visit him at his residence on the following day....Arrival of Seventh regiment in New-York....Gen. JOE JOHNSTON evacuated Jackson, Miss., in the night....The rebels routed in the Indian Country....Brisk engagement on James Island, S.C....Victory of Gen. BLUNT at Elk Creek over 5,000 rebels ....Jackson, Miss., taken by our army.", "1861-12-06": "Occupation of Beaufort, S.C., by the National troops.", "1861-09-06": "The Confederates advance into Kentucky. -- Gen. GRANT, with National troops, takes possession of Paducah, Kentucky.", "1862-07-20": "The expedition from Fredericksburgh made a descent on the Virginia Central Railroad at Beaver Dam Creek; the railroad and telegraph lines for several miles were destroyed.", "1863-07-24": "Col. TOLAND attacked the enerny at Wytheville, on the East Tennessee and Virginia Railroad, capturing two pieces of artillery, 700 muskets and 125 prisoners.", "1861-07-02": "Successful engagement of Gen. PATTERSON's column near Martinsborgh.", "1862-11-21": "Gen. SUMNER demands the surrender of Fredericksburgh.", "1862-02-28": "The steamer Nashville ran the blockade at Beaufort, N.C... Fast Day in the \"Confederate\" States....Skirmish at Sikeston, Mo.... Charlestown, Va., occupied by the Union troops.", "1861-01-29": "President Buchanan again evinces an unsteadiness of purpose, and an indisposition to deal vigorously with the rebellion.", "1862-08-09": "BATTLE OF CEDAR MOUNTAIN....Guerrilas at Stockton, Mo., defeated....Regulations for the enrollment and draft issued.", "1862-03-29": "\"Middle\" Department constituted.... Charge through Middleburgh, Va., in pursuit of rebels fleeing from the place....Schooner Lydia and Mary captured,", "1863-05-05": "HON. C.L. VALLANDIGHAM ARRESTED AT DAYTON, OHIO, FOR TREASON....Riot and attempt to rescue him at Dayton....RETURN OF THE ARMY OF THE POTOMAC FROM CHANCELLORSVILLE, ACROSS THE RAPPAHANNOCK, COMMENCED....Col. KILPATRICK surprised some rebel cavalry at Aylett's, Va....The Governor of Mississippi called on the people of the State to arouse for its defence.", "1863-05-08": "Proclamation of President LINCOLN in relation to the draft, defining, the duties, of persons of foreign birth....Gen. T.F. MEAGHER resigned his commission....Gen. BANKS reached Alexandria, La., having captured in his expedition 2,000 prisoners, 20 pieces of artillery, 2 transports, and a large amount of property.", "1862-11-29": "Gen. STAHL's force reached Perryville, Va., via Snicker's Gap, where they had a skirmish with the enemy, whom they completely routed.", "1862-05-04": "YORKTOWN EVACUATED BY THE REBELS early in the morning, and our troops occupied the works....Brisk fight between our cavalry and artillery and the rebels, from Yorktown near Williamsburgh....Gen. MCCLELLAN reported the capture of 71 heavy guns and large amount of ammunition, tents, &c....Gloucester taken.... MORGAN's rebel cavalry attacked at Lebanon, Tenn. ....English steamer Circassian captured near Havana.", "1861-11-02": "Removal of Gen. FREMONT from command in the West.", "1862-07-07": "Gen. CURTIS' advance in Arkansas attacked by the rebels, near Bayou Cache. The rebels repulsed and put to flight....Gen. BURNSIDE's flagboat arrived at Fort Monroe.", "1864-08-09": "Terrible explosion of a boat loaded with ammunition at City Point, Va....Heavy shelling of Atlanta.", "1863-07-14": "The Draft Riot in New-York City continued; business, suspended; negroes hung; Col. O'BRIEN killed; conflict between the mob and soldiers; Proclamation of Gov. SEYMOUR; Postmaster WAKEMAN's house destroyed; speech of GOV. SEYMOUR to \"his friends.\"....Riot in Boston....Advance of Gen. MEADE....Our cavalry occupied Falling Waters, on the Potomac, and captured a brigade of rebels....Williamsport, Md., occupied by our forces....Admiral LEE captured Fort Powhattan, on the James River.", "1863-03-28": "Danville, Ky., recaptured by Union troops....A Union train captured between Memphis, Tenn., and Grand Junction....Cole's Island, nine miles from Charleston, S.C., taken possession of by Union troops....Steamer Aries captured running the blockade at Charleston, S.C....Union gunboat Diana captured by rebels in Louisiana.....Our pickets at Washington, N.C., driven in.....Our fleet reached the Coldwater River, near Vicksburgh, by the Yazoo Pass.", "1864-07-27": "Our army attacked while crossing James River -- A spirited engagement, in which the rebels were driven back. Our troops attacked and carried their position....Gen. O.O. HOWARD assumed command of the Department and Army of the Tennessee, lately commanded by Gen. MCPHERSON ...Our cavalry, under Gens. STONEMAN and MCCOOK, started on a raid on the communications of the rebel army in Georgia.", "1864-08-06": "COMMODORE FARRAGUT SHELLED FORT GAINES, MOBILE HARBOR. He issued a congratulatory order to his command....Battle of Atlanta. The rebels made a demonstration on the Sixteenth Corps, and were heavily punished, and driven back -- Indian massacre near Beaver Creek.", "1863-10-13": "Defeat of VALLANDIGHAM, the Copperhead candidate for Governor of Ohio....Reelection of Gov. CURTIN of Pennsylvania.", "1862-11-24": "Scouting parties left camp near Charlestown, Va., and marched 210 miles in 70 hours.", "1864-12-16": "BATTLE OF NASHVILLE CONTINUED. Our army again gained a brilliant victory, and put HOOD's army to flight, with a loss in the two days estimated at 17,000 men and 51 cannon....A Union force occupied Pollard, 70 miles north of Mobile, and burned the Government and railroad buildings....Secretary STANTON announced that Gen. CANBY's two expeditions cooperating with SHERMAN, had met with perfect success....The rebels attacked and defeated 16 miles from Wytheville, Southwestern Virginia.", "1864-09-28": "The rebel Gen. FORREST at Fayetteville, on his way to intercept SHERMAN's communications....Admiral PORTER issued his farewell order to the Mississippi Squadron.", "1863-05-09": "Rebel guerrillas attacked at Horseshoe Bend, on the Cumberland River, Tenn....Schooner Sea Lion captured off Mobile Bay.", "1864-06-24": "Batteries of the Eighteenth, Fifth and Second Corps opened on Petersburgh, Va. Gen. BURNSIDE's Corps attacked. The attack a failure. Our lines advanced half a mile. TERRIBLE ARTILLERY ATTACK ON THE RIGHT FLANK OF THE ARMY OF THE POTOMAC....Gen. PILLOW demanded the surrender of Lafayette, which was refused and the rebels repulsed....Severe skirmishing before Kenesaw Mountain, Ga.", "1864-05-12": "THE BATTLE BETWEEN GRANT's AND LEE's ARMY RENEWED FIVE MILES BELOW SPOTTSYLVANIA COURT-HOUSE, VA. Gen. HANCOCK opened the battle and made a brilliant assault on A.P. HILL's division, which he routed. Gen. GRANT reported that the day closed leaving between 3,000 and 4,000 prisoners in our hands for the day's work, including two general officers and over thirty pieces of artillery. This day's battle was a decided Union success. In the night LEE abandoned his position.....Gen. SHERIDAN's army encamped at Walnut Grove and Gaine's Mills....Gen. BUTLER's army engaged.", "1862-11-26": "The President visited Gen. BURNSIDE at Belleplaine, Va. Successful reconnoissance from Bolivar Heights....Gen. SHERMAN's force left Memphis.....The rebel camp at Cold Knob, Va., surprised.", "1861-01-12": "Mr. SEWARD speaks in the Senate on the National troubles.", "1862-08-06": "REBEL RAM ARKANSAS BLOWN UP ... 3000 prisoners exchanged....Gen. HOOKER retired in the night from Malvern Hill....Death of Gen. ROBERT MCCOOK.", "1864-02-20": "Skirmish with MOSBY's cavalry at Piedmont Station, Va....BATTLE of OLUSTEE, FLA. Our troops under Gen. SEYMOUR met 15,000 rebels, 55 miles beyond Jacksonville. The battle was desperately fought during three hours, and at sunset our forces retired, overpowered, to Sanderson.", "1861-04-19": "The Massachusetts Sixth Regiment attacked in Baltimore by a mob and several of its members killed -- The Seventh New-York Regiment leave for Washington.", "1863-03-20": "Engagement at Milton, Tenn....Two of Commodore FARRAGUT's vessels arrived at the mouth of the canal opposite Vicksburgh....Fight at Auburn, Tenn.", "1864-08-23": "Gen. WARREN advanced his line one mile toward Petersburgh....FORT MORGAN, MOBILE BAY, SURRENDERED UNCONDITIONALLY. By its surrender we captured 200 prisoners, 60 pieces of artillery and a large quantity of material.", "1862-02-27": "The rebels began to evacuate Columbus, Ky....The Monitor sailed from New-York.", "1862-11-28": "BATTLE OF CANE HILL, ARKANSAS. -- Gen. STAHL's force drove in the rebel pickets at Ashby's Gap....Gen. BURNSIDE arrived in Washington from the Army of the Potomac....General GRANT's army struck their tents and marched in in the direction of Holly Springs.", "1863-11-15": "Reconnoissance of our forces along the Rapidan at Raccoon Ford....Advance in force of Gen. LONGSTREET on BURNSIDE's ' force. Commencement of the retreat of our forces to Knoxville, Tenn....Capture of Corpus Christi, Texas, by Gen. BANKS' troops.", "1864-04-09": "BATTLE OF PLEASANT HILL, LA. -- A severe battle, our troops falling back in the night....The rebels attempted to blow up the United States steam frigate Minnesota before light in the morning.", "1862-12-22": "Address of the President to the Army of the Potomac in regard to the occurrences at Fredericksburgh.", "1862-02-11": "Bursting of the Sawyer gun at Newport's News, Va.", "1862-08-12": "Reconnoissance in force from POPE's army in the neighborhood of Slaughter Mountain.", "1863-04-25": "Tuscumbia, Ala., occupied by our cavalry.....Ship Dictator destroyed by the Georgia.", "1864-03-29": "A rebel force crossed the Cumberland River at Eddyville.", "1861-04-04": "Excitement at Charleston.", "1862-06-29": "BATTLE FOUGHT 1 1/2 MILES FROM SAVAGE's STATION, near Richmond. At dark the rebels were repulsed, and forced to abandon their position....The crew of the steamer Kanawha cut out the English steamer Ann from under the guns of Fort Morgan, Mobile.", "1863-07-19": "The rebel MORGAN made an unsuccessful attempt to cross the Ohio River; more of his men captured.....Two companies of rebels and an ammunition train captured at Jackson, Tenn.", "1862-04-28": "Surrender of Forts Jackson and St. Philip. ....Rebel gunboats on the Warwick River shelled our encampments....Skirmish at Monterey, Tenn....Captured steamer Ella Warley arrived at Port Royal, S.C.", "1864-07-21": "The rebel lines contracted close to Atlanta....Skirmishing on the James River.", "1862-04-16": "THE PRESIDENT SIGNED THE BILL ABOLISHING SLAVERY IN THE DISTRICT OF COLUMBIA. ....M. MERCIER, French Minister, arrived in Richmond.....Troops left Ship Island for New-Orleans....Spirited engagement at Lee's Mills, near Yorktown.", "1864-06-04": "Gen. SHERMAN thirteen miles from Marietta, Ga. The rebels, discovering our forces moving around their right flank, abandoned their position. Considerable skirmishing.", "1864-09-06": "During a battle between the French and CORTINAS and Mexican forces, near Brownsville, Texas, Col. FORD, the rebel Commander at that point, came down from Texas, on the Rio Grande, with a large drove of cattle for the French, and seeing that they were engaged with CORTINAS, opened on the Mexican rear....The rebels and French repulsed CORTINAS. CORTINAS afterward crossed the Rio Grande, into Texas, and raised the American flag.", "1864-02-19": "Gen. SEYMOUR's forces advanced to Barber's Station, a distance of 12 miles.", "1862-10-07": "Gen. BUELL's army arrived within two miles of Perryville, Ky., where the enemy were found to be in force....Gen. MCCLELLAN's order, calling attention to the President's emancipation proclamation, and explaining the duties of the officers and soldiers...Reconnoissance to the Rappahannock, through Centreville and Manassas Junction.", "1862-10-29": "Skirmish between Gen. WALKER's (rebel) force and Gen. BAYARD's Cavalry, at Upperville and Paris, Va....Great fire at Harper's Ferry; twenty-six cars loaded with hay were simultaneously in flames. A part of the railroad bridge was destroyed.... Gen. U.S. GRANT reported that the guerrillas at Clarkson, Mo., had been attacked, routed, and utterly dispersed....Rebels at Snicker's Gap, Va., in force....Gen. RICHARDSON's Division, of MCCLELLAN's army, passes Snicker's Gap to Paris, Va....Brig Baron de Castine captured by the pirate Alabama, and released on giving bonds for $6,000, payable to the President of the Confederate States thirty days after peace shall be declared....The corps d'armee under Brig.-Gen. Cox reached Charlestown, Va. On their entrance they were greeted with cheers and other demonstrations of favor.", "1863-05-29": "Skirmish near Thoroughfare Gap, Va....Gen. KILPATRICK left Yorktown on a raid up the Peninsula, which resulted very successfully.", "1864-07-10": "A portion of the rebels encamped at Rockville, Md....A Union cavalry expedition left Decatur.", "1861-12-01": "The Secretary of the Navy reports that 160 prizes have been captured since the commencement of the blockade, by 43 vessels of the squadron.", "1862-08-14": "Gen. BURNSIDE's corps d'armee arrived at Fredericksburgh....The draft ordered to take place Sept. 1.", "1863-03-16": "Great Union meeting in Brooklyn....Gen. ROSECRANS reported the exploits of his cavalry ....Water admitted into the canal at Lake Providence, near Vicksburgh.", "1864-03-28": "The advance of Gen. BANKS' army left Alexandria, La....Copperhead riot at Charleston, Ill....Battle on Cane River, La., thirty-five miles above Alexandria. The rebels defeated.", "1863-08-22": "Gen. BEAUREGARD protested against the shelling of the City of Charleston.", "1863-11-24": "Gen. SHERMAN crossed the Tennessee River before daylight, at the mouth of the South Chickamauga, and carried the northern extremity of Missionary Ridge....Battle of Lookout Mountain.", "1862-09-04": "The rebel steamer Oreto ran the blockade into Mobile Bay, escaping the steamer Oneida in pursuit.", "1863-02-20": "The National Currency Bill passed the House of Representatives ...United States steamer Alabama left St. Thomas in search of the Florida....The Vanderbilt left St. Thomas on a cruise for privateers.", "1864-12-09": "Gen. HOWARD, of SHERMAN's army, reported that the army had met with perfect success....Reconnoissance from the Army of the Potomac toward Hatcher's Run....Charge on the rebel works at Jarrett's Station, Va.", "1864-10-12": "Death of Chief-Justice ROGER B. TANEY....Gen. HOOD demanded the surrender of Resaca, Ga., threatening, in case of resistance, to take no prisoners.", "1864-10-13": "Reconnoissance in force from the Army of the James....Attack on Resaca, Ga. The rebels repulsed....Engagement at Greenville, East Tennessee.", "1863-08-03": "Gov. SEYMOUR indited a letter, to the President, remonstrating against the enforcement of the draft in New-York City because of unfair enrollment, &c.", "1863-12-18": "Explanations made between Lord LYONS and Secretary SEWARD relative to the capture of the Chesapeake.", "1862-01-11": "Gunboat action near Columbus, Ky.... Bridges on the Louisville and Nashville Railroad burned by the rebels.", "1862-04-04": "Departments of the Shenandoah and of the Rappahannock constituted....The rebel floating battery at Island No. 10 again shelled....Our forces at Pittsburgh Landing, Tenn., attacked.", "1862-01-19": "BATTLE OF MILL SPRINGS, KY., in which the rebel Gen. ZOLLICOFFER was killed Rebel schooner Lizzie Weston captured.", "1863-09-19": "COMMENCEMENT OF THE GREAT BATTLE OF CHICKAMAUGA. Our army attacked in large force by the rebels under Gen. BRAGG, who had been reinforced by Gen. LONGSTREET's corps from Virginia....Defeat of the rebels in the Indian Country.", "1864-03-26": "President LINCOLN issued a proclamation defining the Amnesty Proclamation. Gen. FRANKLIN's forces reached Alexandria, La.", "1863-07-15": "The Draft Riot in New-York continued; the military routed! more negroes hung; terrible excitement in New-York and neighborhood; Proclamation of Mayor OPDYKE....Gen. DIX ordered to New-York, and Gen. J.G. FOSTER to Fort Monroe....Proclamation of the President issued appointing Aug. 6 for a National Thanksgiving for our great victories....A mob in Troy destroyed the Times office and other property....Arrival of VALLANDIGHAM at Niagara Falls, Canada, from his journey through the Southern States....Jackson, Miss., shelled by our forces....JEFF. DAVIS ISSUED A PROCLAMATION IMMEDIATELY CONSCRIPTING EVERY ABLE-BODIED MAN between the ages of 18 and 45....Gen. BLUNT crossed the Arkansas River.", "1863-03-07": "The Union expedition into Northumberland County, Va., returned to the headquarters of the Army of the Potomac from a very successful reconnoitering expedition, during which large captures of provisions, &c., were made....Cavalry engagement at Unionville, Tenn., near Murfreesboro....The Yazoo Pass expedition arrived in the Tallahatchie.", "1864-01-23": "Two Mississippi regiments attempted to fight their way out of the rebel lines, for the purpose of taking the oath of allegiance to the United States.", "1862-05-24": "Gen. BANKS' column retreated from Strasburgh to Winchester, Va., fighting the rebels gallantly.", "1862-04-23": "Gunboat Santiago de Cuba chased the Nashville unsuccessfully.", "1864-03-25": "Attack on Paducah, Ky., by the rebels. The city partially fired....Death of Hon. OWEN LOVEJOY.", "1864-08-16": "Fighting on the north bank of the James. The engagement resulted favorably, though not decisively, for us. The enemy somewhat driven back from their position....Cavalry fight between a division of SHERIDAN's army and the rebels, near Front Royal, Va....Fight near Chattanooga....The Tallahassee scuttled the bark P.C. Alexander, and burned the schooners Leopold, Pearl, Sarah Louisa and Magnolia.", "1861-02-17": "First speech of JEFFERSON DAVIS after his election.", "1864-07-25": "The rebels again occupied Martinsburgh, Va....A reconnoissance of our forces near Helena, Ark.", "1864-02-07": "The portion of the Army of the Potomac which had been sent out on a reconnoissance, returned to its old quarters....The rebels driven across the Rapidan....Great excitement in Richmond in expectation of the approach of Gen. BUTLER's force....An expedition sent from Knoxville, Tenn., returned, having surprised a body of rebels, killed and wounded 215, taken 50 prisoners, and dispersed the remainder of the band.", "1863-10-08": "The rebel rams in the Mersey placed under the supervision of English officials.", "1863-05-18": "Meeting to express sympathy with VALLANDIGHAM held in New-York....VALLANDIGHAM sentenced to confinement in Fort Warren....Union victory on the Big Black River, Miss....Capture of Haines' Bluff, near Vicksburgh, by Admiral PORTER....Schooner Isabel destroyed off Mobile Bay....Schooner Ripple captured off Mobile Bay.", "1863-06-12": "Gov. CURTIN, of Pennsylvania issued a proclamation calling for volunteers to repel the anticipated invasion of that State by the rebels....Gen. COUCH assumed command of the Department of the Susquehanna....President LINCOLN addressed a letter to ERASTUS CORNING and others, in relation to the arrest of VALLANDIGHAM, &c....Gen. HUNTER left the Department of the South....Gen. Q.A. GILLMORE assumed command....Brisk engagement, between Union batteries on Folly Island and the rebel batteries on Morris Island, Charleston Harbor.", "1863-07-06": "Defeat of the rebel Gen. JOHNSTON on the Big Black. His rear-guard captured at Bolton.....The rebel army from Gettysburgh arrived at Hagerstown, Md....Defeat of STUART by BUFORD, at Hanover.", "1863-03-19": "The rebel cavalry crossed Duck River, advancing toward Franklin, Tenn., but were driven back by Union cavalry....Rebel guerrillas attacked a railroad train near Richland, Ky....Anglo rebel steamer Georgiana ran ashore near Charleston.", "1861-04-05": "Preparations of BEAUREGARD to bombard Sumter.", "1861-12-02": "Meeting of Congress.", "1861-12-16": "Threatened War between the United States and Great Britain.", "1862-12-23": "Report of the Congressional Committee, on the battle of Fredericksburgh....Gen. BURNSIDE returned to his army, from Washington.... Winchester, Va., reoccupied by Union forces under Col. KEYES....JEFF. DAVIS issued a Retaliatory Proclamation, especially directed against Gen. BUTLER and his officers.", "1864-12-15": "BATTLE OF NASHVILLE COMMENCED. General THOMAS attacked HOOD's army at 9 A.M. Our lines advanced on the right five miles. The rebels were driven from the river, from their intrenchments, from a range of hills, on which their left rested, and forced back upon the right and centre. The rebels lost much artillery, many prisoners, and a whole line of earth works. In the night HOOD withdrew his right from the river....The rebel Gen. FORREST attacked Murfreesboro, Tenn....Our forces surprised the rebels at Glades' Spring, Va., in BRECKINRIDGE's rear.", "1864-02-18": "Gen. SEYMOUR left Jacksonville, Fla., and established a depot of supplies at Baldwin....Gen. SMITH's Union expedition reached Okolona, 75 miles south of Corinth, Miss.", "1864-09-13": "Attack on the rebels near Occoquan Creek by some of SHERIDAN's forces. A South Carolina regiment captured.", "1861-01-03": "The President, having sent back the last communication of the South Carolina Commissioners unopened, they return to Charleston.", "1861-08-07": "Hampton burnt by the rebels.", "1864-04-18": "A rebel ram came to within a few miles of Plymouth, N.C., and attacked our fleet, sinking the Smithfield and another gunboat.....The rebels attempted to blow up the frigate Wabash, blockading Charleston, N.C.", "1863-10-30": "Union meeting at Little Rock, Ark.", "1862-06-05": "Artillery battle at New Bridge, near Richmond....Fort Pillow evacuated after a siege of 52 days.", "1863-08-12": "Fort Sumter, Charleston harbor, battered by our shot....The rebels opened on our works near Charleston with grape and canister.", "1863-11-30": "The rebels blew up the magazines of Fort Esperanza, Matagorda Bay, Texas.", "1864-07-05": "The President issued a proclamation declaring martial law in Kentucky and suspending the action of the writ of habeas corpus. ..Secretary FESSENDEN sworn in....An expedition started from Lagrange, Tenn., in pursuit of the rebel FORREST.", "1861-01-15": "Secession Meeting in New-York.", "1863-07-11": "BRILLIANT Engagement on MORRIS ISLAND. All the batteries evacuated by the rebels, who defended themselves in Fort Wagner....Commencement of the Draft in New-York City.", "1862-08-07": "Guerrilla fight near Kirksville, Mo. -- the rebels defeated....English steamer Ladona captured. The rebels grossed the Ranidac and advanced toward Culpepper Court-house and Madison Court-house, Va.", "1864-09-09": "Spirited attack on the rebel pickets near Petersburgh, in the night.", "1863-08-30": "The Army of the Cumberland crossed the Tennessee River.", "1863-04-08": "The Army of the Potomac, reviewed by the President....The Keokuk, monitor, sank in Charleston harbor from the shots received in bombarding Fort Sumter....Arrival of the Yazoo Pass expedition, operating against Vicksburgh, at Helena, Ark....Ship Morning Star captured by the Alabama.", "1863-04-14": "Fight near Suffolk, Va....Aid reached Gen. FOSTER, at Washington, N.C....Repulse of the rebels in the Nansemond River, Va....The ram Queen of the West recaptured from the rebels in Grand Lake, La....The final action between Gen. BANKS' army and the rebels in the Teche country....Fight at Kelly's Ford, near Fredericksburgh.", "1862-02-06": "FORT HENRY, ON THE TENNESSEE RIVER, TAKEN BY OUR WESTERN GUNBOAT FLEET under command of Flag-Officer A.H. FOOTE. Gunboat expedition left Fort Henry.", "1863-03-13": "The rebels attacked Ncwbern, N.C.....Fight between the Union gunboat Chillicothe and the rebel Fort Pemberton, near Vicksburgh, at the mouth of the Tallahatchie River....Affair at Deep Gully, N.C., between Union and rebel forces.... VAN DORN's forces escape from before Gen. ROSECRANS at Duck River, Tenn.", "1864-04-11": "Gen. BANKS' army all reached Grand Ecore, La....The rebels repulsed in an attack on Roseville, Ark.", "1861-02-01": "Warlike preparations at Charleston -- Secession of Texas.", "1862-05-25": "Gen. BANKS retreated from Winchester to Martinsburgh, Va., fighting as he went. Our troops were attacked early in the morning, and fought during most of the dry. Our baggage trains reached the Potomac.", "1864-08-24": "Skirmish on SHERIDAN's left.....Reconnoissance of Gen. CROOK's command in the Shenandoah Valley.", "1861-06-04": "Engagement between the Harriet Lane and a rebel battery, at the mouth of the Nansemund River.", "1862-08-08": "POPE's advance fell slowly back, our forces concentrating at Culpepper Court-house.", "1863-12-11": "Fort Sumter on fire.", "1863-06-30": "York, Penn., evacuated by the rebels....Martial law proclaimed in Baltimore....Skirmish at Sporting Hill, Penn., near Oyster Point....Cavalry battle at Hanover Junction, Penn....Skirmish near Mechanicsburgh, Penn....Gen. BUFORD passed through Gettysburgh on a reconnoissance in force....At nightfall the greater part of the rebel force was concentrated in the immediate vicinity of two corps of the Union army.", "1864-04-26": "Gen. STEELE left Camden for Little Rock, Ark.....The rebels in strong force attacked our gunboats in Louisiana.", "1862-08-22": "STUART's Cavalry attacked a train of sick and wounded at Catlett's Station, Va.....Reception of Gen. CORCORAN in New-York.", "1862-01-17": "Gen. BURNSIDE's expedition arrived at Hatteras, N.C., after meeting with heavy gales.", "1861-11-21": "The pirate Nashville enters the British port of Southampton.", "1864-05-16": "The rebel army encamped around Spottsylvania Court-house, Va....The rebels in force attacked Gen. \"Baldy\" SMITH's lines, and forced them back with considerable loss....GEN. BUTLER's FORCE ATTACKED BY TROOPS FROM PETERSBURGH. Furious fighting. The rebels made a desperate onslaught in a fog, but were repulsed....Resaca, Ga., occupied by Gen. SHERMAN.", "1863-03-10": "President LINCOLN issued a Proclamation ordering soldiers absent from their regiments to return immediately....Skirmishing at Rutherford's Creek, near Columbia, Tenn....Gen. VAN DORN's force retreated toward Shelbyville, Tenn.....Rebel steamer Parallel burned on the Tallahatchie.", "1862-11-11": "Gen. GRANT reported a victory at Garrettsburgh, Ky....Gen. ROSECRANS' command arrived at Fort Donelson.", "1863-01-07": "Successful reconnoissance of Union troops from Yorktown in the neighborhood of West Point, Va.", "1861-02-12": "The Confederate States Government takes charge of all questions pending between the Southern States and the United States Government.", "1862-09-05": "REBELS CROSSED THE POTOMAC INTO MARYLAND, near Point of Rocks, in the night, and marched to White Oak Springs, Md. Col. THOS. H. FORD took command of the forces on Maryland Heights. Forces were stationed at Solomon's Gap and Sandy Hook, near Harper's Ferry.", "1863-06-09": "Severe cavalry engagement at Brandy Station or Beverly's Ford, Va., on the Rappahannock....The rebels driven from Monticelio, Ky....Departments of the Monongahela and Susquehanna created....Execution of two spies by Gen. ROSECRANS.", "1862-01-27": "Bishop AMES and Hon. HAMILTON FISH appointed Commissioners to visit Richmond under the order of the 20th.", "1863-03-21": "Steamer Nicholas I. captured off Wilmington, N.C....Steamer Aries captured off Charleston ....Death of Gen. E.V. SUMNER.", "1863-05-17": "Steamer Cuba pursued and destroyed, and schooner Hunter captured....Battle of Big Black River Bridge, Miss.", "1864-06-10": "Lexington, Ky., entered by Morgan's forces -- attack on Cynthiana, Ky., commenced....Gen. STURGIS' expedition defeated by the rebels at Guntown, south of Corinth, Miss....Gen. HUNTER's army advanced from Staunton, Va....GEN. KAUTZ CHARGED THE REBEL WORKS AT PETERSBURGH and carried them, penetrating to near the town, but, supporters not coming up, withdrew.", "1863-12-02": "The rebel cavalry repulsed at Clinch River, Tenn.", "1863-09-21": "Gen. THOMAS repelled the assault of the rebels on his corps at Rossville....Conclusion of the great battte, which resulted in our forces falling back to Chattanooga after a gallant fight by Gen. THOMAS' corps. The battle commenced on the Chickamauga Creek, and was waged from that point to Chattanooga. Gen. THOMAS' corps displayed great gallantry, and by its bravery saved the army from great disaster. The rebels acknowledged very heavy loss in officers and men.", "1863-01-25": "Cars on the railroad, between Nashville and Franklin, Tenn., destroyed by rebels....The iron-clad Montauk arrived off Fort McAllister, Ga.", "1863-03-09": "The rebels entered Fairfax Court House, Va., and captured Brig.-Gen. E.H. STOUGHTON and his guard....Anglo-rebel steamer Douro captured by the Quaker City.", "1862-02-07": "BATTLE OF ROANOKE ISLAND, N.C.....Harper's Ferry, Va., shelled by our batteries by order of Col. GEARY, on account of the rebels firing on a boat under flag of truce....Romney, Va., occupied by our troops under Gen. LANDER. ....Rebel picket guard surprised at Germantown, Va....Two rebel transports on the Tennessee River destroyed.", "1860-12-20": "Secession of South Carolina.", "1863-08-15": "The authorities of the City of New-York appropriated $3,000,000 to pay for substitutes.", "1864-11-26": "Columbia, Tenn., evacuated by Gen. THOMAS' army....Gen. SLOCUM's column of SHERMAN's army at Warrenton, Ga. -- Gen. HOWARD's column reached Sandersville, Ga., and cut the railroad....Gen. DIX issues an order, declaring those engaged in the attempt to burn New-York spies, and that in case of capture they should be tried by court-martial, and on conviction be executed \"without the delay of a single day.\"", "1862-05-27": "President LINCOLN [???] Congress a massage relative to Secretary CAMERON's transactions....Steamer Patras captured.", "1863-02-27": "Col. WYNDHAM's cavalry left Centreville, Va., on a reconnoissance, afterward reaching Falmouth, Va....Brig.-Gen. JOHN COCHRANE, having resigned his commission, took leave of his corps of the Army of the Potomac....JEFF. DAVIS issued a proclamation appointing March 27 as Fast Day in the Confederate States....Gen. STEVENSON released from arrest by Gen. HUNTER....Three Anglo-rebel steamers, the Georgiana, the Britinnia and the Gertrude, arrived at Nassau....A sham monitor sent by Admiral PORTER past the rebel batteries at Vicksburgh....Schooner Palmetto captured by the Alabama.", "1864-09-29": "Gen. ORD's CORPS OF GRANT's ARMY ADVANCED AND CARRIED A VERY STRONG FORTIFICATION AND LINE OF INTOENCHMENER BELOW CHAPIN's FARM, taking fifteen pieces of artillery and 200 or 300 prisoners....Gen. BARNEY advanced from Deep Bottom and carried the New-Market Road....Mayor GUNTHER vetoed a resolution of the Common Council, to illuminate the city in celebration of our victories.", "1864-06-07": "Gen. SHERIDAN crossed the Pamunkey....Engagement between our torts and the rebel batteries on Sullivan and James Islands, S.C....Assembling of the National Union Convention at Baltimore.", "1861-09-04": "False reports of the death of JEFFERSON DAVIS gain circulation and credit.", "1861-11-01": "Gen. MCCLELLAN appointed Commander-in-Chief.", "1864-02-13": "The entire line of the Memphis and Charleston Railroad evacuated by our forces.", "1864-05-14": "GEN. \"Baldy\" SMITH CARRIED THE FIRST LINE OF REBEL WORKS AT PETERSBURGH, VA. The rebels attacked the Fifth Corps, Army of the Potomac, but were finally driven back with severe loss, after a furious cannonade. Our forces then charged the rebel lines....Gen. SHERMAN's FORCES ACTIVELY ENGAGED. Gen. HOOKER's corps attacked by the rebel Gen. HOOD's division. The rebels repulsed. General battle, which lasted till midnight, each party holding its respective position.", "1863-01-03": "The rebels retreated from the battle-field of Murfreesboro....Gov. SEYMOUR, of New-York, appointed this day for the trial of the New-York Police Commissioners....Arrest of ISAAC N. COOK, in Cincinnati, as a defaulting Paymaster....Arrival in New-York of a cavalry company from California....Our forces at Moorefield, West Va., attacked....The boat containing a missing portion of the Monitor's crew picked up on Hatteras Shoals....Department of the East, including the New-England States and the State of New-York, created, and Gen. JOHN E. WOOL assigned to its command.", "1862-05-19": "The rebels attacked, killed and took prisoners a party of our men on the James River, landing under flag of truce....The President, by proclamation, repudiated the order of Gen. HUNTER liberating the slaves in his department.", "1862-08-30": "SECOND BATTLE OF BULL RUN. Though our position was maintained during the day, Gen. POPE ordered, in the night, a general retreat. Our army fell back toward Centreville....Severe battle near Richmond. Ky. Our forces were outnumbered and fell back to Lexington....Fight at Bolivar, Tenn. Enemy repulsed.", "1864-04-01": "Gen. GRANT visited Fort Monroe....Fight near Snyder's Bluff, on the Yazoo.", "1862-01-18": "Death of Ex-President JOHN TYLER, at Richmond, Va....Reconnoissance of the gunboat Conesloga, up the Tennessee River.", "1864-03-04": "Gen. CUSTER made a reconnoissance to Ely's Ford on the Rapidan....SHERMAN's army reached Vicksburgh, returning from their raid through Mississippi....Inauguration of Gov. HAHN, of Louisiana....Death of THOS. STARR KING.", "1862-10-10": "REBEL INVASION OF PENNSYLVANIA. STUART's rebel cavalry reached Chambersburgh Penn., about 6 P.M., having crossed the Potomac at McCoy's, between Hancock and Williamsport. ....Gen. ROSECRANS returned from the pursuit of PRICE's army, reporting it dispersed, demoralized, and incapable of further mischief....Ship Tonawanda captured by the pirate Alabama, and released on giving bonds for $80,000, payable to the President of the Confederate States thirty days after the declaration of peace. Ship Manchester and brig Dunkirk also captured.", "1864-04-19": "Fort Wessels, Plymouth, N.C., evacuated by our troops.", "1863-06-23": "Chambersburgh, Penn., reoccupied by the rebels.", "1862-06-03": "Landing of Union troops on James Island, S.C.", "1864-08-21": "THE REBELS MADE THREE DESPERATE CHARGES ON OUR LINES ON THE WELDON RAILROAD, but were repulsed with heavy loss....Brisk engagement near Charlestown, Va. The rebels charged on our lines, and after a sharp struggle our skirmishers gave way....ATTACK\t ON MEMPHIS, TENN. The city entered by rebel cavalry.", "1862-02-15": "Bowling Green, Ky., evacuated by the rebels and occupied by Gen. BUELL's army..... Engagement between rebel gunboats and our batteries near Fort Pulaski, Georgia.", "1864-08-28": "Gen. SHERMAN's army reached the West Point Railroad at Red Oak, thirteen miles from Atlanta, and began the destruction of the road from that point....Advance of our army in pursuit of EARLY.", "1863-05-21": "Assault on the rebel works at Vicksburgh, Miss. Our forces repulsed with severe loss.", "1863-05-01": "BATTLE OF CHANCELLORSVILLE COMMENCED ....Cavalry engagement at Blountsville; Ala....Battle of Thompson's Hills, Miss., or Port Gibson....Port Gibson occupied.", "1863-02-25": "Cavalry skirmish at Piedants Farm, Va....Cavalry fight near Strasburgh, Va. Our forces defeated....Privateer Retribution arrived at Nassau ....Capture of the Anglo-rebel steamer Peterhoff by the Vanderbilt, near St. Thomas....An expedition through Yazoo Pass, near Vicksburgh, left Moon Lake.", "1864-07-23": "Burial of the dead before Atlanta....Atlanta shelled....Heavy fighting in the Shenandoah Valley.", "1864-07-14": "Arrival of Maj.-Gen. FRANKLIN in Baltimore, having escaped from the rebel raiders.", "1860-12-26": "Evacuation of Fort Moultrie by Major ANDERSON.", "1862-10-05": "Galveston, Texas, occupied by the Union forces....The rebels, retreating from Corinth, reached the Hatchee River, where they were attached and lost two batteries and some prisoners.", "1862-01-14": "Gunboat reconnoissance to within a mile and a half of Columbus, Ky.", "1864-04-20": "Gen. STEELE's army entered Camden, Ark....The rebels stormed Fort Williams, Plymouth, N.C., carrying it, and capturing Gen. WESSELS and 2,500 men. Massacre of negro troops....PLYMOUTH SURRENDERED TO THE REBELS.", "1863-08-16": "Steamer Alice Vivian captured running out of Mobile....GEN. ROSECRANS COMMENCED HIS ADVANCE ACROSS THE CUMBERLAND MOUNTAINS.", "1861-10-20": "Partial blockade of the Potomac by rebel batteries.", "1862-10-16": "Advance of Gen. MCCLELLAN's army from Harper's Ferry....Pursuit of BRAGG's army in Kentucky virtually abandoned....British steamer Wachuta captured, after an all-day's chase, of the coast of North Carolina.... A reconnoissance up the Apalachicola River, Fla. The expedition captured a sloop laden with cotton.", "1861-04-15": "The President issues his Proclamation for 75,000 volunteers. -- Tremendous excitement in the North.", "1863-07-01": "FIRST DAY OF THE BATTLE OF GETTYSBURGH...The First and Eleventh army corps engaged..Gen. REYNOLDS killed....Large losses on both sides....Brilliant fight at Carlisle between the rebel cavalry and artillery of Gen. FITZHUGH LEE, and our forces, under Gen. W.F. SMITH.", "1861-02-09": "JEFFERSON DAVIS, of Mississippi, elected President, and A.H. STEPHENS, of Georgia, Vice-President of the Southern Confederacy, by a unanimous vote -- Arkansas arsenals seized by the State Government.", "1864-01-01": "Discovery in New-York of a portion of the machinery, consisting of a geometrical lathe and a large number of dies and plates, used by a contractor with the Confederate States in making Confederate bonds and Treasury Notes. Arrest of the contractor, and seizure of about $6,000,000 in Confederate bonds and $1,000,000 in Confederate Treasury Notes....Emancipation jubilee of the colored inhabitants of Norfolk, Va., and vicinity, on the anniversary of the issuing of the President's Proclamation of Freedom.....The State officers of New-York, elected in November, sworn in at Albany....Departure of a cavalry reconnoissance to Front Royal, Va.", "1864-12-03": "WHEELER's cavalry attacked SHERMAN's force on the Savannah Railroad, a few miles below Haynesboro....An expedition sent from Roanoke Island, N.C., which met with perfect succes in destroying rebel property....Heavy skirmishing before Nashville, Tenn.", "1863-08-21": "Lawrence, Kan., pillaged and burned by guerrillas....Gen. GILLMORE demanded the surrender of Morris Island and Fort Sumter, and threatened to shell Charleston in case of non-compliance with his demand....Our batteries opened on Charleston, S.C., in the night....The advance of the Army of the Cumberland appeared before Chattanooga, Tenn., and opened fire on the city.", "1862-10-11": "The rebel STUART's cavalry destroyed two warehouses at Chambersburgh, containing military stores; also the buildings of the Cumberland Valley Railroad, including the machine shops; the rolling stock collected there was also destroyed. They also burned the railroad bridge at Scotland, five miles from Chambersburgh....Gen. WOOL and staff arrived at Harrisburgh, Penn., and assumed the command and direction of the troops for the defence of the State....Rebels in large force near Nashville, Tenn. They sent a flag of truce, demanding the surrender of the city, which was refused by Gen. NEGLEY, in command of the post....Great battle between Harrisburgh and Danville, Ky., in which the rebels were defeated, after which they retreated to Camp Dick Robinson....The whole rebel army engaged in the battle of Perryville, reached Bryantsville, Ky., our army slowly following....Skirmish near Lagrange, Ark., -- the rebels defeated.", "1863-01-26": "Gen. BURNSIDE turned over the command of the Army of the Potomac to Gen. HOOKER....Gen. HOOKER, in general orders, assumed command....Gen. W.B. FRANKLIN, having been relieved of his command in the Army of the Potomac, took leave of his division....Gen. SUMNER relieved of his command....Bark Golden Rule burned by the Alabama....Ship Washington captured by the Alabama.", "1863-04-03": "The rebel Gen. MORGAN defeated at Liberty, Tenn.", "1861-05-18": "Prizes arrive at Philadelphia. -- Savannah blockaded.", "1861-05-04": "The British ship Hiawatha, twice fired at by the Cumberland, escapes and gets into Norfolk.", "1864-06-21": "THE REBELS MADE A FIERCE ATTACK ON GEN. HUNTER's REAR....SKIRMISHING near White House, Va.... Manoeuvring of GRANT's army -- Lively skirmishing. Our advance interrupted....A cavalry expedition under Gen. WILSON, left Bermuda Hundreds.", "1864-03-16": "Rebel guerrillas attacked a train from Nashville, near Estelle Springs, Tenn.....The rebels shelled from a camp, near Bennett's Ferry, on the Cumberland....Rebel attack on our forces at Skull Creek, near Hilton Head, frustrated.", "1864-06-19": "GREAT NAVAL BATTLE BETWEEN THE ALABAMA AND KEARSARGE, OFF THE HARBOR OF CHERBOURG, FRANCE. The Alabama sunk and Capt. SEMMES saved by an English yacth.", "1864-10-30": "Our fleet shelled Plymouth, N.C.", "1863-10-01": "Reception of the officers of the Russian fleet by the military and civil authorities of New-York.", "1863-09-13": "Brilliant cavalry fight at Culpepper, Va. ....Gen. ROSECRANS' army attacked at Bird's Gap.", "1864-08-30": "The Army of the Tennessee skirmished considerably with rebel cavalry.", "1864-09-25": "Gen. SHERIDAN's advance passed beyond New-Market. His forces drove the enemy from Mount Jackson....The rebels at Luray, attacked....A force of rebel cavalry occupied Frederickstown, Mo., twenty miles east of Pilot Knob....Athens, Ala., occupted by the rebel Gen. FORREST's troops.", "1862-03-05": "Our pickets at Columbus, Ky., driven in.... Bunker Hill, Va., occupied by Union forces.... Rebel schooner Wm. Mallory captured....BEAUREGARD assumed command of the rebel army of the Mississippi.", "1861-08-04": "Destruction of the rebel privateer Petrel by the St. Lawrence.", "1863-12-24": "Vigorous bombardment of the city of Charleston, S.C. in the night.", "1864-06-08": "Nomination of ABRAHAM LINCOLN and ANDREW JOHNSON by the Union Convention for President and Vice President of the United States....Capture of Mount Stirling, Ky., by the rebel JOHN MORGAN. MORGAN entered Paris, Ky....Burning of the steamer Berkshire on the Hudson.", "1863-06-13": "Town of Eunice, near Vicksburgh, destroyed by our gunboats....Winchester, Va., attacked and its armament and a part, of its garrison captured.", "1864-04-25": "A train of 240 wagons, of Gen. STEELE's army, captured by the rebels while on its way to Pine Bluff, Ark....Gen. BANKS' army reached Alexandria on its retreat.", "1862-07-05": "Vigorous bombardment of Vicksburgh.", "1863-03-02": "Ship John A. Park captured and burned by the Alabama.", "1863-04-22": "McMinnville, Tenn., taken by our troops, and the rebel stores there destroy ed....Tompkinsville, Ky., destroyed by our troops....A LARGE FORCE WITH GUNBOATS RAN PAST THE REBEL BATTERIES AT VICKSBURGH....Union raid on Middleton, Tenn.", "1864-05-26": "BATTLE OF DALLAS, GA., CONTINUED. Our army withdrawn to the north side of the North Anna River, Va., in the night, and moved toward Hanovertown. Secretary STANTON reported that the rebels held a strong position between the North and South Anna Rivers. Gen. J.G. FOSTER assumed command of the Department of the South.", "1862-06-25": "SEVERE AND SUCCESSFUL FIGHTING BEFORE RICHMOND. Reconnoitering expedition left Newbern, N.C....Gen. BUTLER ordered the seizure of the property of the traitor TWIGGS.", "1862-12-05": "Cavalry engagement near Coffeeville, Miss", "1863-04-02": "Grand reception of Gen. BUTLER at the New-York Academy of Music....Rebel attack on our iron-clads at Tuscumbia, Ala....Serious bread riot in Richmond, Va. A large number of women attacked the storehouses.", "1863-06-16": "Harper's Ferry reached by MILROY's army....Gov. CURTIN appealed to the people of Philadelphia to rise.....Gov. PARKER, of New-Jersey, called for volunteers to repel the invasion of Pennsylvania....Harper's Ferry invested and attacked. Our forces retired to Maryland Heights and shelled the rebels out.....Brig Umpire captured by the Tacony....Gen. MEAGHER tendered the hospitalities of New-York City.", "1862-02-01": "Skirmish near Bowling Green, Ky.", "1863-07-09": "Port Hudson taken possession of by our army....Victory of our cavalry under BUFORD and KILPATRICK at Boonsboro.", "1863-04-05": "A force left Newbern, N.C., to rescue Gen. FOSTER's army besieged at Washington, N.C....Iron-clad fleet armed at Charleston Bar.", "1864-05-05": "BATTLE OF THE WILDERNESS COMMENCED. -- A day of terrific fighting on most difficult ground in the Wilderness, near Chancellorsville, Va. Night closed in without any definite result. Gen. HAYS killed....Gen. BUTLER's army passed Fortress Monroe in transports on their way up the James River....Gen. KAUTZ forced the Blackwater, burnt the railroad bridge at Stony Creek, cutting BEAUREGARD's forces in two....Naval engagement between the rebel ram Albermarle and our fleet near the mouth of the Roanoke River....Skirmish at Thoroughfare Gap, Va. BURNSIDE's cavalry attacked the enemy on their passage through the Gap.", "1862-03-10": "CENTREVILLE, Va., occupied by our forces ....Gunboat Whitehall destroyed by fire in Hampton Roads....The last of the rebels left Manassas and our scouts approached the place.", "1861-07-13": "Engagement at Carrick's Ford. Defeat and death of the rebel Gen. GARNETT.", "1864-10-15": "The rebel army under LONGSTREET having appeared near Strasburgh, Va., Gen. SHERIDAN advanced and found them drawn up in four lines of battle, but, on charging, the rebels fled.", "1862-10-30": "Gen. ROSECRANS and staff arrived at Louisville, Ky.....Gen. O.M. MITCHELL, Commander of the Department of the South, died of yellow fever at Beaufort, S.C....English brig Hermasa captured.", "1861-10-25": "Gallant charge of the Frement Guard, under Maj. ZAGONYI, against a superior body of rebels at Springfield.", "1863-04-17": "Engagement at Vermillion Bayou, La., resulting in success for our troops....Col. GRIERSON started on his great cavalry expedition for Baton Rouge, La.", "1862-03-21": "Gen. BUTLER arrived at Ship Island.... Washington, N.C., occupied by Gen. BURNSIDE's troops....Departments of the Gulf and of the South constituted -- Gen. BUTLER assigned to the former, and Gen. T.W. SHERMAN to the latter.", "1864-12-25": "ATTACK ON FORT FISHER CONTINUED. Our troops landed under cover of the fire from the fleet, and were immediately engaged. In the night our infantry attacked the fort, but were repulsed. The land force reembarked....Gen. THOMAS' army 21 miles south of Columbia.", "1863-05-28": "Attack on Port Hudson continued. Our forces repulsed....Blockade runner Victoria captured.", "1864-12-12": "Arrival of Gen. HOWARD's messengers at Hilton Head, S.C....Sailing from Fortress Monroe, in the night, of the transports of PORTER's and BUTLER's expedition for North Carolina.", "1863-06-15": "The President called for 100,000 volunteers to repel the invasion of Pennsylvania....Gov. CURTIN, of Pennsylvania, called on the people of the State to enroll themselves for its defence ....Chambersburgh, Penn., occupied by the rebels....Winchester, Va., evacuated by Gen. MILROY, at 1 o'clock, A.M., after which he was pursued and engaged in a severe battle.", "1864-09-10": "Gen. SHERIDAN's forces in the Shenandoah Valley attacked at Darksville, Va.... Gov. BROWN, of Georgia, recalled the militia of the State from HOOD's army....Gen. SHERMAN replied to a communication from HOOD, charging him with \"studied and ungenerous cruelty\" in ordering the evacuation of the city by its inhabitants. A truce for ten days declared by Gen. SHERMAN.", "1862-08-18": "The rear guard of MCCLELLAN's army crossed the Chickahominy on its way toward Fort Monroe....Gen. POPE's retreat commenced ....The rebel Congress met.", "1863-06-26": "Gettysburgh, Penn., occupied by the rebels....Gov. CURTIN issued another proclamation to the people of Pennsylvania....Rebel privateer Archer (with the crew of the Tacony) entered Portland harbor, and captured the revenue cutter Caleb Cushing, which enterprise resulted in the capture of the Archer....White House, Va., occupied by our troops.", "1861-12-13": "Engagement at Alleghany Camp, Pocahontas County, Va.", "1862-09-10": "Gov. CURTIN issued an order calling on all able-bodied men in Pennsylvania to organize immediately for the defense of the State....Cavalry reconnoissance in the direction of Sugar Loaf Mountain, Md....Large force of rebels at New-market, eight miles from Frederick, Md....Great excitement in Cincinnati; 3,000 laborers ordered to the trenches. The rebels, 10,000 strong, believed to be approaching the city....Attack by a rebel column on our troops near Gauley, Western Virginia....Stringent order against straggling issued....Skirmish near Covington, Ky.", "1864-05-13": "GEN. BUTLER's ARMY ADVANCED TOWARD PETERSBURGH, VA. -- Skirmishing with the rebels in the afternoon....Gen. MEADE issued a congratulatory address to his army. The rebels in his front fell back early in the morning, our troops following....Gen. SHERIDAN's forces encamped at Bottom's Bridge....Gen. SHERMAN's army in line of battle in Sugar Valley.", "1861-08-10": "Battle of Wilson's Creek, near Springfield. Death of Gen. LYON.", "1862-06-28": "BATTLES BEFORE RICHMOND CONTINUED. ....Evacuation of White House Landing completed.", "1863-07-22": "Railroad bridge, 350 feet long, over Tar River, at Rocky Mount, N.C., destroyed by a cavalry expedition from Newbern, which also destroyed a large amount of property.....Recapture of Brashear City, La., by our troops.", "1863-03-27": "Fast day in the Confederate States....Deserter shot at Indianapolis, Ind....Arrest of the rebel Col. TALCOTT in New-York....Palatka, Fla., occupied by a Union regiment of colored troops....Admiral FARRAGUT engaged the rebel batteries at Warrenton, three miles below Vicksburgh....Bark Lapwing and M.J. Colcord taken by the Florida....United States troops landed at Cole's Island near Charleston, S.C....Bombardment of Fort Pemberton, Vicksburgh, commenced.", "1861-12-28": "Adjustment of the Mason-Slidell difficulty. -- Suspension of specie payments in New-York.", "1864-04-28": "Little Washington, N.C., evacuated by our troops.", "1862-08-23": "Early in the morning our artillery all along the line opened on the enemy from this side of the Rappahannock. For several hours a terrific artillery duel was kept up. Rappahannock Bridge blown up.", "1862-03-15": "Naval expedition left Cairo for Hickman, Ky.", "1863-01-05": "Murfreesboro, Tenn., occupied by a National force.....J.P. USHER, of Indiana, nominated as Secretary of the Interior.....Gen. MILROY, in Western Virginia, issued a proclamation notifying the people of Winchester and neighborhood of the provisions of the President's Emancipation Proclamation.", "1864-07-09": "BATTLE AT MONOCACY, Md., lasting from 9 A.M. to 5 P.M. Our forces overpowered and forced to retreat in disorder....Proclamation issued by President LINCOLN giving his views on reconstruction and his reasons for not signing a bill passed by Congress providing for the same....The Florida, continued her depredations on our coast....Our forces on John's Island, S.C., twice repelled a rebel assault....Gen. SHERMAN reached the Chattahoochee....Gov. BROWN, of Georgia, ordered all the militia of the State into active service.", "1863-11-02": "OCCUPATION OF BRAZOS ISLAND, TEXAS, and capture of Boca Chica by Gen. BANKS' army.", "1864-01-12": "An expedition left Point Lookout on a raid through Westmoreland, Northumberland and Richmond Counties, Va. The force succeeded in destroying a large amount of property.", "1864-04-30": "The President approved a joint resolution raising duties on imports 50 per cent....Gen. STEELE's army in Arkansas crossed the Saline River, after a fight with the rebels.", "1862-12-03": "Surrender, of Winchester, Va., to Gen. GEARY; the place occupied.", "1864-07-06": "Secretary WELLES addressed a dispatch to Capt. WINSLOW, of the Kearsarge, in recognition of his services in the destruction of the pirate Alabama.", "1861-06-10": "Affair at Big Bethel.", "1864-04-08": "The Senate passed a resolution to submit to the Legislatures of the States an amendment of the Constitution, abolishing slavery....BATTLE NEAR MANSFIELD, LA. The rebel Gen. TAYLOR attacked. Our army, unexpectedly, came on the rebels in full force. Our troops were entrapped, surrounded and flanked. They fell back, but their retreat was impeded by wagons, and the retreat became a rout.", "1861-01-04": "National Fast -- The United States arsenal at Mobile taken by the local troops.", "1863-08-06": "Ship Francis B. Cutting captured and bonded by the Florida....National Thanksgiving Day.", "1864-10-16": "HOOD's army at Lafayette....Gen. SHERMAN took Ship's Gap.", "1864-07-04": "The rebels took possession of Bolivar City, half a mile from Harper's Ferry, on their advance into Maryland, where they were attacked. Gen. SIGEL arrived at Sandy Hook. Gen. MULLIGAN evacuated Bolivar Heights....The rebels made a raid on Point of Rocks, Md....Naval operations in Stono River.", "1864-03-30": "Engagement in Arkansas with 1,200 rebels, who were routed and pursued ten miles.", "1864-02-06": "The expedition sent out by Gen. BUTLER with the object of liberating our troops held as prisoners at Richmond, made a demonstration at Bottom's Bridge and drove in the rebel pickets. Great excitement in Richmond....a portion of the Army of the Potomac engaged.", "1862-03-31": "Gen. HUNTER assumed command of the Department of the South.", "1864-03-05": "Secretary CHASE, in a letter to Hon. JAS. C. HULL, of Ohio, withdrew his name as a Presidential candidate.", "1862-09-03": "Gen. WHITE entered Harper's Ferry with his force from Winchester, Va.", "1863-02-12": "Passage of the National Currency bill by the Senate....Slight skirmish near Smithfield, Va....Great fire at Norfolk, Va....Ship Jacob Bell, from China, captured and burned by the Florida....Rebel fort on Pelican Island, near Galveston, Texas, shelled by the Brooklyn.", "1862-03-02": "Death of Gen. F.W. LANDER....Gunboat engagement with rebel batteries at Pittsburgh, Tenn.", "1864-03-20": "Rebel attack on Jenkins' Island and Spanish Wells, Hilton Head, S.C. frustrated.", "1863-03-14": "Port Hudson attacked by Admiral FARRAGUT....The steamer Mississippi ran aground, and was burned....Gen. FITZHUGH LEE made an advance on our lines at Gloucester, Va., but retired on learning that we had been reinforced....Engagement at Deep Gully, N.C., continued....Ship Punjaub captured Tay the Alabama.", "1862-04-11": "BOMBARDMENT OF FORT PULASKI CONTINUED -- THE FORT SURRENDERED.....The District of Columbia Emancipation Bill passed by the House of Representatives....Huntsville Ala., occupied by Gen. MITCHEL's forces....SECOND APPEARANCE OF THE MERRIMAC and her consorts in Hampton Roads. She captured three small vessels and then returned.... Gen. HALLECK arrived at Pittsburgh Landing.", "1862-06-04": "Gen. POPE 30 miles south of Corinth, pushing the enemy....Skirmish on James Island, S.C....The rebels burned their works near Fort Pillow.", "1862-08-05": "BATTLE OF BATON ROUGE....Malvern Hill occupied by our troops after a right of 1 1/2 hours, our gunboats shelled a rebel encampment beyond Malvern Hill....Gen. ROBERT MCCOOK, assassinnated by the rebels, near Salem, Tenn.", "1863-03-15": "Schooner Chapman taken possession of at San Francisco as privateer....The Jefferson newspaper office destroyed at Richmond, Ind.", "1862-08-01": "Severe fight at Newark, Mo....Retaliatory order issued by the rebel Government. Gen. POPE and his officers declared not to be entitled to the privileges of prisoners of war.", "1862-09-27": "Augusta, Ky., 40 miles from Cincinnati, on the Ohio River, taken by rebel cavalry, who destroyed the place.", "1863-12-05": "Destruction of the steamer Isaac Newton ....The rebels threatened our forces near the Rapidan....Gen. BUTLER issued an important order relative to colored troops.", "1864-05-11": "The armies under GRANT and LEE engaged with varied success until 11 A.M., when our line was somewhat advanced. Gen. LEE proposed a cessation of hostilities for 48 hours, to bury the dead, which Gen. GRANT refused. Gen. GRANT reported to the War Department, that after six days' fighting the result was much in our favor, declaring that he intended \"to fight it out on this line if it took all Summer\"....After three days of skirmishing we drove the rebels back to Rocky Ridge and Buzzard Roost Mountain, Ga....Gen. SHERIDAN captured Ashland Station, destroying a large amount of stores. HE ATTACKED GEN. STEWART AT YELLOW TAVERN, NEAR RICHMOND AND PENETRATED THE FIRST AND SECOND LINES OF THE REBEL DEFENCES.", "1863-04-27": "Scouting expedition under Gen. STAHL left Fairfax Court-house, Va....Fighting near Kinston, N.C....STONEHAN's cavalry expedition left Warrenton Junction, Va....U.S. sloop-of-war Preble destroyed by fire.", "1862-06-17": "Battle between our gunboats and rebel batteries at St. Charles, Ark., on the White River.", "1863-02-24": "The iron-clad gunboat Indianola captured by the rebels near Vicksburgh....Some shells thrown into Galveston, Texas, by the Brooklyn.", "1861-05-20": "At this date six American flag-ships, with full rank Commodores attached, belong to the blockading squadron.", "1864-08-18": "A FURIOUS ATTACK ON BURNSIDE's CORPS, NEAR PETERSBURGH, which was repulsed with great loss to the rebels....Gen. WARREN moved his corps across the Weldon Railroad, in doing which he was engaged in considerable fighting....The Tallahassee arrived at Halifax after having burned the schooners Josiah Acorn, Diadem, Sea Flower and brig Roan.", "1862-12-13": "BATTLE OF FREDERICKSBURGH, fought back of the town. Gen. BAYARD killed....Battle of Zuni, N.C....Gen. FOSTER attacked Kinston, N.C.", "1864-03-17": "Rebel night raid on Magnolia, Fla.", "1862-02-23": "The rebels evacuated Nashville, Tenn.... Gen. CURTIS captured Fayetteville, Ark., the rebels fleeing in contusion....Gallatin, Tenn., occupied by Gen. BUELL.", "1864-06-27": "BATTLE OF KENESAW MOUNTAIN, GA. An unsuccessful attack made by our forces on the rebels. Gen. MCPHERSON's corps attacked the rebels at the southwest end of Kenesaw Mountain. Gen. THOMAS also attacked further south. Firing along the whole line. Neither attack succeeded. Formal acceptance of a renomination by President LINCOLN.", "1862-11-30": "Steamer Vanderbilt returned from a cruise after the Alabama.", "1863-05-22": "The sentence of VALLANDIGHAM changed to banishment....Blockade runner Eagle captured....Assault on Vicksburgh continued....Battle at Gum Swamp, N.C....Engagement at Port Hudson Plains.", "1864-06-09": "Gen. SHERMAN's cavalry developed the position of the enemy in a line along the hills from Kenesaw to Lost Mountain....SHERIDAN's cavalry started on a raid....MORGAN's guerrillas whipped at Mt. Stirling, Ky....President LINCOLN informally accepted a renomination.", "1861-10-16": "Successful skirmish near Harper's Ferry. Capture of a rebel cannon by troops under Col. GEARY.", "1862-01-30": "THE MONITOR LAUNCHED.....Secretary SEWARD ordered the release of the prisoners in Fort Lafayette who were taken on vessels which had violated the blockade.... The President was authorized by Congress to take possession of the railroad and telegraph lines of the United States....Queen VICTORIA declared anew her intention to observe neutrality in the American war.", "1862-04-12": "Gen. HUNTER, at Fort Pulaski, declared free all slaves in the Fort and on Cockspur Island....Engagement at Monterey, Va....Expedition from Huntsville, Ala., seized the junction of the Memphis and Charleston Railroad....Another expedition from Huntsville arrived at Decatur in time to save the railroad bridge, which they found in flames.", "1864-03-11": "Fight with guerrillas on the Atchafalaya River, La.", "1862-10-22": "The Governor of Kentucky called on the people of Louisville to rally for the defense of the city....HUMPHREY MARSHALL's force retreated from Mount Stirling toward East Tennessee.... Gen. BRAGG's rebel army moved through Cumberland Gap....Our forces attacked Pocotaligo and Coosawhatchie, S.C. They succeeded in reaching the Charleston and Savannah Railroad, and did it some damage. The force was engaged in desperate fight with the rebels. The expedition was not entirely successful in accomplishing its mission....A force sent on a reconnoissance in the neighborhood of Martinsburgh had some skirmishing with the enemy, and captured a few prisoners. Return of GEARY's expedition, which left on the 21st, to Harper's Ferry....Battle at Maysville, in the northwest corner of Arkansas, (second battle of Pea Ridge.) Our forces, under Gen. BLUNT, attacked the enemy, supposed to be 6,000 to 7,000 strong, end after an hour of fighting totally routed them, with a loss on the part of the rebels of all their artillery, a battery of six pounders, a large number of horses and their equipments. By this battle all the organized forces of the enemy were driven back to the Valley of the Arkansas.", "1863-07-29": "Repulse of the rebels at Paris, Ky.", "1861-05-28": "BANKS and FREMONT appointed Major-Generals.", "1864-07-22": "GREAT BATTLE BEFORE ATLANTA -- The rebels assaulted our lines near Atlanta with great fury seven times, and were as often repulsed after a terrible struggle. Our loss was 3,521; the rebel loss estimated at 10,000. Gen. MCPHERSON was killed....Skirmishing in front of BURNSIDE's corps of the Army of the Potomac.", "1861-02-28": "President DAVIS vetoes the bill legalizing the African Slave-trade.", "1864-02-12": "Passage of the Enrollment Bill by the House of Representatives.", "1864-06-16": "CANNONADING ALONG THE WHOLE OF SHERMAN's LINE. -- The greater portion of both armies were engaged before noon. The rebels compelled to evacuate a splendid position near the base of Lost Mountain....Heavy firing at night, between GRANT's and LEE's armies....Gen. HUNTER's army entered Liberty....The Cummings' Point, S.C., (Union) batteries shelled by rebel batteries.", "1862-05-08": "The iron clad Galena and gunboats Aroostook and Port Royal started up James River.... Monitor, Naugatuck and several gunboats left for Sewell's Point which place they attacked.... Merrimac appeared but refused to fight.", "1863-11-17": "Enthusiastic reception of HENRY WARD BEECHER at his church in Brooklyn on his return from Europe....One of our camps near Chattanooga shelled by a rebel battery... .Our troops, falling back before Gen. LONGSTREET's army, reached Knoxville, Tenn....Attack of the rebels on our forces....COMMENCEMENT OF THE SIEGE OF KNOXVILLE, TENN., BY LONGSTREET's ARMY....Shell thrown into Charleston from Fort Gregg....Schooner Jas. L. Gerety, from Matamoras, seized by rebel passengers....Cavalry fight near Strausburgh, Va....Capture of Aranzas, Texas, by Gen. BANKS' troops.", "1862-10-19": "The rebel JOHN MORGAN, left Lawrenceburgh, Ky., with about 1,200 men, closely pursued by Gen. DUMONT.....Col. MILLER, of Gen. NEGLEY's army, had a brush with the enemy, near Nashville, Tenn., and captured several....On the 18th and 19th, a lage force of rebels under EWELL and JACKSON entered Martinsburgh, and completed the destruction of the railroad property there, including the depot and workshops....A powerful iron steamer ran the blockade at Charleston, S.C., (on the night of the 18th.)", "1862-03-24": "Engagement between the gunboats Tyler and Lexington and a rebel masked battery near Eastport, Tenn.", "1864-02-01": "Advance of the rebels in Western Virginia, Burlington occupied by them....Fighting in the New Creek, Va., valley....Engagement at Smithfield, Va., continued....Our outposts at Bachelor's Creek driven in by a strong force of rebels threatening Newbern, N.C....The President ordered that a draft for 500,000 men, to serve for three years or during the war, be made on the 10th day of March, for military service of the United States, crediting and deducting therefrom so many as may have been enlisted or drafted into the service prior to the first day of March, and not heretofore credited....Our outposts at Bachelor's Creek driven in by a strong force of rebels threatening Newbern, N.C.....Engagement at Smithfield, Va., continued.", "1864-05-10": "BATTLE OF SPOTTSYLVANIA COURT-HOUSE CONTINUED. A general advance of our army ordered at 5 A.M. A tremendous conflict ensued. In the afternoon an attack was made on the rebel batteries. After the assault had continued some time it was found that the rebel batteries could not be carried without great loss, and the effort for the time was abandoned. The battle ceased about 9 P.M., and was one of the most terrible and bloody of the war....Gen. SHERIDAN reported that he had turned the rebel right, reached their rear, and destroyed from eight to ten miles of railroad, and other property....Gen. SHERIDAN crosseed the South Anna River....Gen. AVERILL's force fought a battle near Wytheville, Va....Secretary STANTON reported that Gen. MCPHIRSON was within seven miles of Resaca, Ga....Gen. SHERMAN in front of Buzzard Roost Gap, Ga.", "1864-08-15": "Fighting near Richmond....Our garrison at Dalton, Ga., was reinforced, and the rebels driven off in confusion....The Tallahassee scuttled schooners M.A. Howe, Howard, Floral Wreath, Restless, Etta Caroline, and bonded schooner S.K. Harris.", "1862-03-11": "Our troops entered the works at Manassas Junction....Gen. MCCLELLAN having taken the field with the Army of the Potomac, the President relieved him of the command of the other military Departments....Gen. HALLECK assigned to the command of the Department of the Mississippi ....Gen. FREMONT placed in command of Mountain Department.", "1864-06-02": "Gen. SCHOFIELD's and HOOKER's corps of SHERMAN's army pushed forward toward Marietta, Ga....Our cavalry took possession of Allatoona Pass, Ga.", "1864-12-19": "Gen. THOMAS reported that little additional progress had been made, on account of stormy weather. Cavalry skirmish and capture of three guns at Spring Hill....The President issued a proclamation calling for 300,000 troops to fill deficiencies in the last draft, and ordering a draft in all districts which had not filled their quotas on February 15....Gen. CUSTER's Cavalry started on an expedition up the Shenandoah Valley.", "1861-02-06": "Important speech in the Senate of Senator JOHNSON, of Tennessee.", "1864-07-03": "Our army entered Marietta, Ga....a rebel force appeared near Martinsburgh, Va....A part of the expedition from Hilton Head repulsed....The rebels overtaken by SHERMAN, two miles south of Marietta, Ga.", "1863-10-23": "Execution of Dr. WRIGHT at Norfolk, Va.", "1864-02-21": "A force of troops left Hilton Head and proceeded up the Savannah River....Heavy fighting at Pontotoc, Miss.", "1864-07-17": "Gen. SHERMAN's command moved forward to within five miles of Atlanta, Ga. His advance crossed the Chattahoochie River....Gen. JOS. E. JOHNSTON turned over the command of the rebel army at Atlanta to Gen. J.B. HOOD....Severe fight near Grand Gulf....Indian raid on our post at Fort Larned.", "1862-07-27": "British steamer Memphis ran out of Charleston....Reconnoissance in force in direction of Kinston, N.C.....Gen. POPE left Washington for his army.", "1864-06-23": "At daylight an advance of our whole line near the track of the Petersburgh and Weldon Railroad, was ordered....A part of our cavalry reached the junction of the Lynchburgh and Danville Railroad, and destroyed the track....The rebels assaulted Gens. SCHOFIELD's and HOOKER's Corps of SHERMAN's army. Our advance pressed forward. NIGHT ATTACK ON THE REBEL WORKS AT KENESAW MOUNTAIN, GA.", "1863-11-04": "Capture of Brownsville, Texas, by Gen. BANKS' army.", "1863-09-05": "Furious bombardment of Forts Wagner and Gregg, Charleston harbor.", "1864-09-19": "BATTLE OF BUNKER HILL, VA. A great battle fought by SHERIDAN in the Shenandoah Valley. SHERIDAN made the attack and won a splendid victory, capturing over 2,500 prisoners, together with nine battle-flags, and five pieces of artillery. The rebel Gens. GORDON and RHODES were killed, and three other general officers wounded. All of the rebel killed and most of the wounded fell into our hands.....The steamers Philo Parsons and Island Queen seized by a band of rebels on the Canadian frontier.", "1863-09-29": "Engagement near Morganzia, La.", "1864-04-04": "Fight at Roseville, Ark....Gunboat expedition up the Chickahominy....Gen. GRANT returned to Washington....Opening of the great Sanitary Fair in New-York.", "1861-12-11": "Great fire in Charleston -- Loss estimated at $7,000,000.", "1863-05-24": "Capture of schooners Gen. Prim and Rapid and sloops Jane, Adelie and Bright.", "1862-10-17": "Return of Gen. HANCOCK's expedition to Boliver Heights. They found the enemy in force at Brucetown, 5 miles from Winchester, Va., and captured 1,500 bushels of wheat....HUMPHREY's division, which crossed near Shepherdstown, returned after finding the enemy in considerable force and after some artillery skirmishing.", "1862-02-19": "Com. FOOTE took possession of Clarksville, Tenn.", "1862-02-02": "Cavalry charge of the rebels on a small force of Union infantry in Morgan County, Tenn.", "1864-10-17": "The rear of Gen. HOOD's army left Lafayette, going South. The Secretary of War telegraphed that Gen. HOOD, after striking the railroad near Dalton and Resaca, had fallen back before SHERMAN without fighting, abandoning his movement on our line of communication....Arrest in Baltimore of a number of merchants, charged with contraband trade with the rebels.", "1862-11-07": "GEN. MCCLELLAN REMOVED FROM THE COMMAND OF THE ARMY OF THE POTOMAC, AND THE COMMAND TURNED OVER TO GEN. BURNSIDE.... Gen. BAYARD attacked at Rappahannock Station, Va....Expedition up Sapelo Sound, Ga., partly made up of negro troops.", "1863-01-20": "Gen. BURNSIDE announced to the Army of the Potomac that it was about to meet the enemy again....Gen. HUNTER assumed command of the Department of the South....The rebel privateer Alabama arrived at Jamaica.", "1863-11-29": "THE REBELS IN FRONT OF KNOXVILLE REPULSED WITH HEAVY LOSS.", "1862-11-05": "Gen. PLEASANTON reached a point near Chester Gap, Va., before reaching which he routed STUART's cavalry....Engagement at New-Baltimore, Va....Two vessels laden with cotton captured in Nassau River....Skirmishing near Nashville, Tenn.", "1864-03-23": "Gen. STEELE's army left Little Rock, Arkansas.....Order reorganizing the Army of the Potomac.", "1862-12-17": "Baton Rouge recaptured.", "1862-04-19": "BATTLE OF CAMDEN, (or South Mills,) N.C....Gen. BANKS' advance occupied Sparta, Va. ....Gen. MITCHEL at Iuka, Miss....Bombardment of Fort Wright continued.", "1861-02-11": "Mr. LINCOLN, President elect, leaves Spring field, Ill., and commences his journey to Washington.", "1863-02-09": "Collision between the transport North Star and the steamer Ella Warley near Sandy Hook....Reconnoitering expedition, under Col. WYNDHAM, left Centreville, Va.", "1864-11-17": "A night attack on our lines near Richmond....A column of SHERMAN's army occupied McDonough, Ga....Out cavalry occupied Griffin, Ga....SHERMAN's left wing reached Covington, Ga., the cavalry pushing on to Social Circle.", "1862-05-28": "RETREAT OF THE REBELS FROM CORINTH, Mrss., COMMENCED....An expedition under Col. ELLIOTT, sent from Camp near Corinth to the Sashville and Ohio Railroad, was successful.", "1864-08-14": "Fighting near Richmond....The rebel Gen. WHEELER demanded the surrender of Dalton, Ga. which was refused. The rebels entered the town, but were kept at bay by the garrison....The Tallahassee scuttled the ship James Littlefield.", "1863-08-20": "Bombardment of Fort Sumter continued.....The Tennessee River reached by Gen. ROSECRANS.", "1861-07-27": "Return of the Sixty-ninth and other New-York regiments from Washington.", "1862-08-13": "Collision between the steamers Peabody and West Point on the Potomac; about 80 lives of convalescent soldiers lost.", "1863-02-28": "President LINCOLN called an extra session of the Senate....Col. WYNDHAM's cavalry arrived at Falmouth, Va.....The rebel steamer Nashville destroyed by the Montauk in Ogeechee River, Ga.....The Yazoo Pass expedition reached the Coldwater River, twelve miles from Moon Lake, through Yazoo Pass.", "1863-02-05": "Our forces repulsed a rebel attack on Fort Donelson, Tenn.....Union ram Queen of the West returned from her expedition past the batteries of Vicksburgh, having destroyed three rebel transports and an immense quantity of rebel stores.", "1861-04-11": "Demand made by BEAUREGARD for the unconditional surrender of Fort Sumter.", "1863-02-18": "Gen. BEAUREGARD issued a proclamation announcing that an attack on Charleston and Savannah would probably soon be made....Bombardment of Vicksburgh, Miss.", "1863-08-11": "President LINCOLN ended the correspondence with Gov. SEYMOUR relative to the draft.", "1864-07-02": "The expedition from Hilton Head disembarked at Seabrook Island... An unsuccessful attempt to take the rebel Fort Johnson on the north end of James Island.", "1864-07-28": "THE SIEGE OF ATLANTA COMMENCED -- The Fifteenth Corps of SHERMAN's army assaulted the rebels in force and defeated them. The rebel army under HOOD was repeatedly hurled against SHERMAN's army, [???] as often rolled back and cut to pieces. The rebels suffered severely without gaining any advantage....An expedition sent into North Carolina....Gen. HOOKER relieved of his command at his own request....Our gunboats in Louisiana destroyed a large amount of rebel lumber and two saw-mills.", "1863-02-01": "Franklin, Tenn., occupied by Federal forces..A.J. BOILEAU, editor of the Philadelphia Evening Journal, released from Fort McHenry....Fort McAllister, Ga., again attacked....Gunboat New Era attacked Island No. 10.", "1864-10-18": "Gen. BLUNT, with 2,000 cavalry and four howitzers, entered Lexington, Mo. ..Death of Major-Gen. D.B. BIRNEY.", "1864-06-05": "The rebels attacked our forces after dark, near Coal Harbor, in a fog, but were disastrously repulsed.....BATTLE OF PIEDMONT, WEST VIRGINIA. Our forces under Gen. HUNTER came on the rebels in force at Piedmont, 15 miles north of Staunton, Va., and after a brief and spirited fight, whipped them....The rebels before SHERMAN evacuated their position.", "1862-01-28": "Gunboat expedition to reconnoitre in the neighborhood of Fort Pulaski, below Savannah. Engagement between our boats and those of rebel Commodore TATNALL.", "1861-01-11": "Secession of Alabama -- Resignation of Secretary THOMAS -- Appointment of Gen. DIX as Secretary of the Treasury.", "1862-02-14": "The Secretary of War ordered the release of all political prisoners, on condition of their taking an oath not to aid the rebellion....Amnesty granted to such by the President....Return of Messrs. AMES and FISH from Fort Monroe. The rebels refused to allow them within their lines for the object on which they went, but agreed to exchange all the prisoners, releasing 300 Union prisoners more than we released rebels, on condition of the release of the next 300 falling into our hands....Cavalry reconnoisance to Blooming Gap, Va.", "1864-08-22": "CANNONADE OF OUR WORKS NEAR PETERSBURGH. The rebels charged, but finding themselves in a trap, retreated in confusion. The rebels disappeared from our front on the Weldon Railroad....Return of KILPATRICK to SHERMAN's lines from a successful raid.", "1862-03-16": "Rebels defeated by Gen. GARFIELD in the Cumberland Mountains, East Tenn.", "1861-01-06": "Gov. HICKS refuses to convene the Maryland Legislature.", "1862-09-18": "The rebels in front of Gen. MCCLELLAN abandoned their position in the night, leaving many of their dead and wounded on the field An expedition left Pensacola for Sabine Pass and Galveston....The rebel army from Maryland passed hastily through Sharpsburgh.", "1864-10-10": "Engagement with the rebel Gen. FORREST at East Point, Tenn....Reconnoissance to within three miles of Mobile.", "1864-01-29": "Three brigades of a cavalry corps, about 1,600 strong, skirmished with the rebels under Gen. JONES on the Virginia road, 13 miles from Cumberland Gap. The skirmishing lasted three hours. Our forces held their position until dark, though they were attacked by a superior force, when they withdrew to their camps, three miles in the rear.", "1864-04-23": "Sharp fight on Cane River, La., near Chetersville....BRISK ENGAGEMENT NEAR CAMDEN, ARK. -- The rebels were several times repulsed, but carried the day.", "1861-08-30": "Gen. FREMONT issues a proclamation confiscating the slaves of rebels.", "1864-09-07": "The rebels routed at Readyville, Tenn....Hon. REUBEN E. FENTON nominated for Governor of New-York.", "1864-06-12": "Gov. LETCHER's house burned by HUNTER's troops.", "1861-05-09": "Blockade of Charleston by the Niagara.", "1862-01-07": "Ex-Gov. MOREHEAD, of Kentucky, releases from Fort Warren....Gunboat reconnoissance to within two miles of Columbus, Ky.", "1864-02-26": "Gen. SMITH's expedition arrived in the vicinity of Memphis, Tenn.", "1862-08-10": "Slight skirmishing at Cedar Mountain, Va. ....The enemy fell back two miles from our front.", "1862-04-13": "Two bridges on the Mobile and Ohio Railroad destroyed by an expedition from Pittsburgh Landing.", "1864-12-27": "Destruction of a fort and artillery at Chicasaw, Ala. The means of crossing the Tennessee River, below Florence, by Gen. HOOD, destroyed.", "1864-11-07": "A rebel attack on our pickets south of Atlanta.", "1864-04-24": "The rebels made an impetuous charge on the rear of BANKS' army in Louisiana. They were repulsed, but made another charge, and, after a two hours' battle, were driven back at all points.", "1862-09-19": "BATTLE OF IUKA, MISS. -- Gen. ROSENCRANS' army marched 20 miles, driving in the rebel outposts for the last eight miles. He reached the front of Gen. PRICE's army, advantageously posted in unknown woods, and opened the action at 4 P.M. The battle raged furiously till night closed in, when our army rested on the field from which the enemy retired during the night....A reconnoitering force from our army crossed the Potomac at Shepardstown, after a stout resistance on the part of the rebels. Four pieces of artillery were captured by our troops. By daylight the main body of rebels, with their artillery, had crossed the Potomac. Our cavalry entered Sharps burgh. The last of the rebels left Harper's Ferry ....Gen. MCCLELLAN reported that Gen. PLEASANTON was driving the enemy across the Potomac, and that our victory was complete.", "1862-02-26": "The Loan and Treasury Bill (legal tender) approved by the President.", "1863-07-08": "SURRENDER OF PORT HUDSON, with 7,000 prisoners, and a large number of cannon and small arms, to Gen. BANKS....The rebel Gen. MORGAN crossed into Indiana, and captured the town of Corydon....Gen. GILLMORE issued orders for an attack on Morris Island, Charleston harbor.", "1863-05-03": "BATTLE OF CHANCELLORSVILLE, VA., CONTINUED. TERRIFIC FIGHTING. The Chancellor mansion shelled and burned by the rebels. Gen. BERRY killed. \"Stonewall\" JACKSON mortally wounded. Attack on Fredericksburg by Gen. SEDGWICK. Storming of Mary's Hill....Great panic in Richmond, Va., on the approach of STONEMAN's cavalry....Columbia, Va., on the James River, reached by our cavalry, who destroyed the canal there. Goochland, Va., visited by our cavalry....Fight near Suffolk, Va....Fighting near Warrenton Junction, Va....Capture of Grand Gulf, Miss., by Admiral PORTER's fleet....Battle of Salem Heights, near Fredericksburgh, Va....Beaver Dam, Ashland and Hanover Court-house, Va., reached by Gen. STONEHAN's cavalry....Capture of newspaper correspondents running past the rebel batteries at Vicksburgh....Col. KILPATRICK's cavalry left Louisa Court-house, Va.....Capture of Col. STREIGHT's Union cavalry, near Rome, Ga.", "1864-09-22": "BATTLE OF FISHER's HILL, VA., in the Shenandoah Valley. Gen. SHERIDAN found the rebel army occupying a position which eppeared almost impregnable. His forces, however, attacked and drove the rebels in the utmost confusion, capturing twenty pieces of artillery and a large number of caissons, artillery, horses, & c.", "1862-01-24": "Two rebel vessels grounded, in attempting to run the blockade at the mouth of the Mississippi. They were burned.", "1864-10-11": "Gen. CURTIS drove the rebels out of Independence, Mo....Skirmish near Fort Wilson, Tenn....The rebel Gen. BUFORD crossed the Cumberland River with 1,200 mounted men....Bloody fight with guerrillas near Winchester, Va....Successful reconnoissance from the Army of the Potomac to Stony Creek.", "1864-08-05": "GREAT BATTLE AT THE ENTRANCE OF MOBILE BAY. Fort Gaines opened on our fleet at about 7 A.M., the monitor Tecumseh having opened the attack a short time before. The rebel ram Tennessee captured after one of the fiercest naval battles on record. In the night the rebels evacuated and blew up Fort Powell. The monitor Tecumseh was blown up by a rebel torpedo....Explosion of a rebel mine near Petersburgh, Va.; but little damage done. A TERRIFIC FIGHT IN FRONT OF PETERSBURGH, lasting from 5:30 to 7:30 P.M. It commenced by a charge of the enemy, which was repulsed with slaughter....Gov. CURTIN, of Pennsylvania, issued a proclamation, announcing that the rebel army had again crossed the Potomac, and occupied Hagerstown, Md.", "1864-09-21": "Gen. SHERIDAN attacked the rebels beyond Strasburgh, Va., ard carried and held the crest of the hill occupied by them....FREMONT and COCHRANE withdrew their names as candidates for President and Vice-President.", "1864-11-10": "Arrest on board of the vessel, of a party of rebels, conspiring to seize the Panama Railroad Co.'s steamship Salvador, on the Pacific.", "1864-07-26": "BATTLE NEAR HELENA, ARK. -- Our forces at first were unsuccessful, but afterward repulsed the enemy and charged through their lines....Engagement at Point of Rocks, Md....The rebels made an attempt to flank Gen. BUTLER's position....Gen. THOMAS issued a congratulatory address to his army....Gen. STONEMAN dispatched a cavalry force to destroy the Macon and Western Railroad. They succeeded in destroying 18 miles of track, and in inflicting other damage....Our gunboats went on an expedition up Grand Lake, La., and destroyed a number of rebel flatboats.", "1861-10-21": "Part of Gen. STONE's Division cross the Potomac at Ball's Bluff, and after severe fighting are driven back, with great loss, by the enemy. On this occasion Gen. BAKER fell.", "1863-01-18": "Gen. HUNTER arrived at Hilton Head to take command of the Department of the South ....A large fleet sailed from Napoleon and Memphis for Young's Point and Milliken's Bend, near Vicksburgh, on this and the following days.", "1863-12-27": "Obsequies of Gen. CORCORAN.", "1863-04-10": "Gen. GRANGER attacked by the rebel VAN DORN's army at Franklin, Tenn....A passenger train near Lavergne, Tenn., attacked by a rebel force....Address of JEFF. DAVIS to the rebel States issued.", "1864-04-22": "The rebels captured the gunboat Petrel on the Zazoo River....Our troops left Nachitoches and Grand Ecore for Alexandria, by land.", "1862-10-18": "The guerrilla Chief MORGAN dashed into Lexington, Ky., at the head of 1,500 troops and took 125 prisoners, killing six of our men... Federal steamer fired into by the rebels thirty miles below Memphis....Steamer Gladiator also attacked 25 miles below and set on fire by the rebels; the flames were extinguished.", "1862-08-03": "Reconnoitering party from the Army of the Potomac advanced to within 14 miles of Petersburgh, Va....Steamer Columbia captured with a valuable cargo.", "1862-01-20": "Order issued for the appointment of Commissioners to visit Richmond, to provide for the welfare of our troops imprisoned there....Rebel schooner Wilder captured, in Mobile Bay.", "1863-12-01": "The Army of the Potomac commenced falling back, and at night crossed the Rapidan in safety.", "1861-09-28": "Occupation of Munson's Hill by National troops.", "1864-03-01": "KILPATRICK's EXPEDITION REACHED THE OUTER FORTIFICATIONS OF RICHMOND early in the morning; carried the outer line of works, but was repulsed from the next....KILPATRICK's and BUTLER's forces met in the night....Arrival of Gen. SHERMAN and his Staff in New-Orleans....Return of Gen. CUSTER's cavalry expedition to Culpepper....Election in Louisiana.", "1861-02-23": "The President elect passes through Baltimore secretly, and arrives in Washington.", "1861-12-20": "Sixteen old whalers sunk by the National forces at the mouth of Charleston Harbor.", "1863-01-31": "The fleet blockading Charleston, S.C., attacked by the rebel iron-clads Chicora and Palmetto State....Gen. BEAUREGARD and Flag-Officer D.N. INGRAHAM (rebel), formally declared by proclamation that the blockade of Charleston, S.C., was raised....Union gunboat Mercedita surrendered....J.P. BENJAMIN, Secretary of State of the Confederate States, gave official notice that the blockade was broken....Schooner Hanover destroyed by the Retribution.", "1864-05-25": "BATTLE OF DALLAS, GA., COMMENCED -- A sharp a bloody fight between HOOKER's corps of SHERMAN's army and HOOD's rebel division. Our army gained two miles and a favorable position. A reconnoissance up the Ashepoo River. Department of the South.", "1861-10-19": "Engagement between the Massachusetts and a rebel steamboat at the mouth of the Mississippi.", "1863-11-12": "Strikes of the laborers, car-drivers and conductors in New-York City-stoppage of the cars on some of the City railroads....Gen. KILPATRICK's camp, near Stevensburgh, Va., shelled by the rebels....A body of rebel cavalry crossed the Tennessee River and destroyed two railroad bridges near Lynnville.", "1863-07-07": "Battle at Williamsport, Md....The rebel Gen. MORGAN's force at Bardstown, Ky....RETREAT OF BRAGG's ARMY ACROSS THE TENNESSEE RIVER -- Gen. MEADE started in pursuit of LEE, by a flank movement on Middletown.", "1864-08-27": "Guerrillas defeated at Shelbyville, Ky.", "1864-09-11": "An expedition left Fort Morgan, near Mobile, and proceeded up White River, destroying a large amount of lumber at Smith's Mills.", "1862-01-02": "Steamer Ella Warley ran the blockade into Charleston, S.C.", "1864-03-14": "FORT DE RUSSEY, ON THE RED RIVER, LA., ATTACKED AND CAPTURED by Union forces under Gen. SMITH.", "1864-08-25": "SEVERE BATTLE ON THE WELDON RAILROAD, NEAR REAM's STATION. A desperate attempt of the rebels to retake the road. HANCOCK's corps was several times attacked, the enemy being each time repulsed. At 5:30 P.M. a combined attack on his centre and left was repulsed after one of the most desperate battles of the war, the enemy withdrawing, leaving their dead and wounded on the field. Our forces afterward fell back....Gen. BUTLER's picket-line driven in, but reestablished....Severe battle with SHERIDAN's army.", "1864-04-16": "Gen. THAYER's force from Fort Smith, Ark., joined the main army at Prairie d'Anne.", "1864-05-02": "ADVANCE OF THE ARMY OF THE POTOMAC COMMENCED.....Gen. MEADE issued an order regarding soldiers who claimed that their time of enlistment had expired, announcing the penalty of mutiny as instant death.....WEST POINT, VIRGINIA, OCCUPIED BY OUR FORCES. Gen. STURGIS' cavalry encountered a band of the rebel FORREST's men near Bolivar, Tennessee, and after a severe fight defeated them.", "1862-05-02": "Rebel Gen. MORGAN captured some of our troops at Pulaski, Tenn....Gen. BUTLER took possession of the True Delta in New-Orleans.", "1864-06-17": "THE NINTH CORPS CARRIED TWO MORE REDOUBTS AT PETERSBURGH, VA....Gen. HUNTER's forces engaged at Quaker Church, Va.", "1861-11-09": "Capture of MASON and SLIDELL by the San Jacinto.", "1863-08-27": "Death of the rebel JOHN B. FLOYD.", "1864-11-19": "Gov. BROWN, of Georgia, issued a proclamation, ordering a levy en masse to oppose SHERMAN....The advance of BEAUREGARD's army at Waynesboro, Tenn. BEAUREGARD's headquarters at Corinth, Miss., and HOOD's at Florence ...MOSBY's force captured a party of Union cavalry.", "1862-05-30": "Front Royal occupied by our troops.", "1862-03-07": "Battle of Pea Ridge continued. The rebels were under command of BEN MCCULLOCH, and our troops of Gen. CURTIS....The rebels commenced their retreat from Centreville, Va.", "1862-08-21": "Two rebel regiments crossed the Rappahannock in face of Gen. SIGEL's batteries, which opened on them, killing many and driving the rest back in confusion.", "1862-10-06": "Gen. HALLECK peremptorily ordered Gen. MCCLELLAN \"to cross the Potomac and give battle to the enemy, or drive him south. Your army must move now, while the roads are good.\".... English mail steamer Merlin brought to off the harbor of St. George, by a shot from one of Commodore WILKES' fleet. Gunboat Tascarora sailed from Fayal, in search of the Alabama.... Expedition to destroy the salt works of the rebels, on the coast of Florida.", "1864-12-04": "Lieut.-Com. FITCH defeated and drove the left wing of HOOD's army on the Cumberland River, with heavy loss to the rebels. He also recaptured two transports....Capture of rebel works and cannon near Pocotaligo, S.C., by Gen. FOSTER's troops....Cavalry battle in Georgia. SHERMAN's army started for Savannah....Gen. DIX caused the arrest of sixty persons who were under suspicion of being connected with the attempt to burn New-York.", "1863-02-26": "Death of Col. D.D. TOMPKINS.", "1863-11-16": "The rebel battery on Lookout Mountain, near Chattanooga, was quite, vigorously worked, and HOOKER's camp, Mocassin Point, and the Chattanooga camps shelted....Gen. BURNSIDE evacuated Lenoir....Our outposts near Knoxville attacked by the rebel advanced guard.", "1863-06-28": "Gen. HOOKER relieved of the command of the Army of the Potomac and Gen. MEADE appointed in his place....The rebels within four miles of Harrisburgh, Penn....Bridge over the Susquehanna at Columbia, Penn., burned....Mechanicsburgh surrendered to the rebels....Brookville, Md., occupied by the rebels....Attempt of the rebels to take our fort at Donaldsonville, La.", "1864-01-08": "Our garrison at Petersburgh, West Virginia, surrounded by the rebels....Chase and destruction of the Anglo-rebel steamer Dare.", "1861-01-09": "The Star of the West, endeavoring to enter Charleston Harbor, was fired upon from Morris Island and Fort Moultrie, and compelled to return -- The President sends a special message to Congress.", "1864-01-04": "Inauguration of C. GODFREY GUNTHER, Mayor of New-York....Return to the Army of the Potomac of the cavalry reconnoissance sent on the 1st to Front Royal, Va.", "1862-05-05": "BATTLE OF WILLIAMSBURGH, VA. After a hard-fought battle in which we came near being defeated, our forces were victorious, and the enemy abandoned their position in the night, leaving sick and wounded in our hands.", "1862-10-26": "Heavy rain, and rise in the Potomac.... Advance of MCCLELLAN's army commenced.... Gen BURNSIDE's Division crossed into Virginia. ....Gen. PLEASANTON's cavalry reached Purcellsville....MCCLELLAN established his Headquarters in Virginia....Schooner Crenshaw, of New-York, captured and burned by the pirate Alabama. ....Gen. WEITZEL's Expedition from New-Orleans landed at Donaldsonville, and his troops took up the line of march. A sharp engagement ensued, in which we took 268 prisoners and I piece of artillery.", "1861-01-17": "Mr. HOLT nominated Secretary of War.", "1863-10-28": "Gen. HOOKER's division of the army at Chattanooga repulsed an attack of the enemy....Battle near Lookout Mountain, important in its result of reestablishing our communications with the army at Chattanooga....The rebels repulsed at Pine Bluff, Ark....Our troops occupied Arkadelphia.", "1862-03-28": "Shipping Point, Va., occupied by Union troops....Reconnoissance beyond Warrenton, Va. ....Battle 20 miles from Santa Fe. New-Mexico.", "1864-12-21": "CAPTURE OF SAVANNAH, GA., BY GEN. SHERMAN, with 25,000 bales of cotton, a large amount of stores, and 150 cannon....Recapture of two of the St. Albans robbers....Admiral FARRAGUT appointed Vice-Admiral.....Admiral PORTER's fleet appeared before Wilmington....Gen. CUSTER's force in the Shenandoah Valley engaged with rebel cavalry. The rebels drove in our men, but were afterward defeated.", "1864-08-13": "Gen. GRANT threw a powerful force, under Gen. HANCOCK, across the river at Deep Bottom. HANCOCK took postion 10 miles from Richmond. Gen. BIRNEY assaulted the rebel was works in his front....Gen. BURNSIDE relieved....Guerrillas attacked Selma, Ky....Gen. SMITH attacked the rebels at Hurricane Creek, Miss., and defeated them....The Tallahassee scuttled the bark Glavomore, and burned the schooner Lamot Dupont.", "1864-08-12": "The Tallahassee bonded the bark Fuliote, burnt the schooner Spokelane and ship Adriatic, scuttled the brig Billow, bonded for $30,000 the schooner Robert E Pecker....Attack of guerrillas on the gunboat Reliance, in Northumberland County, Va.", "1862-12-09": "Sharp fight at Lavergne, Tenn.", "1863-09-16": "Skirmish at Raccoon Ford on the Rapidan.", "1864-07-07": "Our forces ordered to evacuate Harper's Ferry by Gen. SIGEL. Rebel raiders near Frederick, Md. The rebels checked at Monocacy Bridge....Proclamation issued by President Lincoln appointing the first Thursday in August as a Fast Day.", "1864-07-11": "THE REBELS NEAR WASHINGTON, D.C. Capture by the rebels of a railroad train at Magnolia Station, between Philadelphia and Baltimore. The rebels captured Maj.-Gen. FRANKLIN, who was on the train. Burning of Gunpowder Bridge by the rebels....Mayor GUNTHER protested against sending the militia from New-York City, in response to a call from the President.", "1862-05-06": "Williamsburgh occupied by our troops.... The Merrimac moving and the Monitor and other vessels prepared for action....The rebels burned their gunboats on the York River.", "1863-01-08": "Springfield, Mo., attacked by the rebels.....Rebel camp at Huntoon's Mills, near Fort Pillow, surprised.....Steamer Mussulman burned by guerrillas near Memphis, Tenn.", "1862-02-09": "Arrest of Gen. C.P. STONE. He was sent to Fort Lafayette.", "1864-12-17": "Gen. MCCOOK defeated the rebel Gen. LYON in a sharp fight at Ashbvville, Ky....Gen. THOMAS reported continued success in the pursuit of HOOD. An engagement six miles beyond Franklin, Tenn....Our troops entered Wytheville, Southwestern Virginia, destroyed the depot and other buildings, and injured the lead mines in the vicinity....A detachment of Union artillery cut up near Millwood, Va.", "1864-10-19": "BATTLE OF CEDAR CREEK, SHENANDOAH VALLEY. Gen. SHERIDAN's army was attacked before daylight and its left turned and driven in confusion, with a loss of twenty pieces of artillery. Gen. SHERIDAN afterward arrived on the field and drove the rebels, taking 48 pieces of artillery and many prisoners, gaining a great victory. SHERIDAN pursued the rebels to Mount Jackson, which he reached in the night....The rebel Gen. PRICE attacked Gen. BLUNT at Lexington, Mo., with an overwhelming force, and after a sharp fight drove him from the city. Gen. BLUNT fell back to the Little Blue River, fighting desperately, and retarding the advance of the enemy....The rebels entered Mayfield, Ky.", "1861-12-18": "Large bodies of rebels dispersed by Gen. POPE in Missouri -- Capture of a rebel camp with 1,300 prisoners.", "1863-01-15": "Union gunboat Columbia destroyed by rebels near Wilmington, N.C.", "1864-08-20": "The Tallahassee sailed from Halifax.....Surg.-Gen. HAMMOND dismissed from the service and disqualified from holding office.", "1864-05-23": "Gen. GRANT's army moved to the North Anna, closely following LEE's army. The rebels attacked but were repulsed.", "1864-04-10": "Death of Hon. W.S. THAYER, Consul-General to Egypt.", "1863-11-09": "Reconnoissance to Culpepper, Va....Gen. MEADE issued a congratulatory order to his troops on their successful passage of the Rappahannock.", "1861-10-05": "Unsuccessful effort of rebels to retake the Hatteras Inlet forts.", "1863-07-28": "Death of WILLIAM L. YANCEY, of Alabama....The rebels defeated at Lexington, Tenn.", "1861-05-31": "Cavalry skirmish at Fairfax Court-House.", "1863-01-09": "Order issued by Gen. HALLECK, thanking Gen. ROSECRANS and his army for the victory of Murfreesboro.....Return of the reconnoitering expedition from West Point, Va., to Fort Monroe.....The rebels repulsed at Providence Church, on the Blackwater, Va.", "1864-01-02": "Seizure of more machinery used by the contractors with the rebels in making Confederate bonds and Treasury Notes....The Police Commissioners of New-York, who had been removed from office by Gov. SEYMOUR, on Dec. 31, replied to the Governor's communication, declining to relinquish their offices until they had been accorded a trial on the charges preferred against them.", "1862-12-02": "Party of Union cavalry surprised and captured at King George Court-house, Va....Figh at Suffolk, Va... The rebels desert their fortifications at Abbeville, Miss., and the place was occupied by the cavalry of Gen. GRANT's army.", "1863-10-27": "Shells thrown into Charleston, S.C., by Gen. GILLMORE.", "1864-08-02": "Gen. BANKS issued an order enlisting all able-bodied colored men between 18 and 40 years of age.", "1863-08-04": "Engagement neat Brandy Station, Va....Steamer Ruth, with $2,500,000 in Government funds, burned on the Mississippi River....Reconnoissance of Fort Darling on the James River.", "1862-02-16": "SURRENDER OF FORT DONELSON to Gen. GRANT. We captured from 12,000 to 15,000 prisoners and large quantities of stores and artillery. Gens. FLOYD and PILLOW, (rebels), escaped. Gens. BUCKNER and TILGHMAN captured.", "1863-12-07": "Meeting of Congress. Election of SCHUYLER COLFAX, Speaker of the House of Representatives. President LINCOLN issued a proclamation, recommending that all loyal people assemble at their places of worship and give thanks for our great victories....Gen. FOSTER reported LONGSTREET in full retreat....A division of Gen. KELLY's troops moved from Beverly, Va., to cooperate with Gen. AVERILL'a expedition.", "1861-05-29": "The Brooklyn blockading off the mouths of the Mississippi.", "1863-01-21": "The expedition under Gen. GRANT, from Napoleon, arrived at Young's Point, nine miles from Vicksburgh....Engagement near Sabine Pass, Galveston, Texas....Gunboat Morning Light and the bark Velocity, captured by the rebels off Sabine Pass, Texas.", "1862-05-26": "THE CAPITAL SUPPOSED TO BE IN DANGER. ....Hanover, Courthouse, Va., captured by Gen. MCCLELLAN. The rebels completely routed.... Gen. MORGAN ordered the Seventh Regiment to Washington. Other regiments to follow.", "1862-07-18": "Death of the rebel Gen. D.E. TWIGGS.", "1863-09-11": "Arrival at New-York of the first vessel of the Russian fleet....IMBODEN attacked a small force of our troops at Moorefield, wounding 15 and capturing about 150.", "1864-04-12": "MASSACRE OF NEGRO SOLDIERS AT FORT PILLOW, TENN. The rebels drove in our pickets just before sunrise. In the afternoon, a flag of truce was sent by the rebels, with a demand to surrender in twenty minutes. This being refused, the rebels rushed from positions treacherously gained, and carried the fort, after which they slaughtered, indiscriminately, men and women, white and black.", "1862-08-28": "Gen. POPE found Manassas Junction evacuated by the rebels....MCDOWELL's column reached the rebels near Haymarket, and after a prolonged fight drove the entire force of JACKSON back....City Point, Va., entirely demolished by the Union gunboats.", "1864-05-17": "Gen. KAUTZ reached City Point, Va., returning from his raid on the Danville Railroad....Gen. SHERMAN's army at Colburn, Ga....Gen. BANKS' forces reached Semmesport, La.", "1861-06-02": "Union victory at Phillippa, Western Virginia.", "1862-09-09": "Rebel cavalry attacked our force stationed at Williamsburgh, Va. We succeeded in holding the place....Evacuation of Fredericksburgh by the rebels commenced.... The pirate Alabama captured the bark Ocean Rover and the schooner Weather Gauge, which, seeing the Ocean Rover in flames, had come to her assistance. She also captured and burned the bark Alert.", "1861-03-20": "Secession of Arkansas.", "1863-09-03": "Battle with the Indians at Whitestone Hall.", "1863-07-04": "SURRENDER OF VICKSBURGH, MISS., WITH 31,000 TROOPS, 220 GUNS AND 70,009 SMALL ARMS, TO Gen. U.S. GRANT....Union victory at Helena, Ark....The retreat of the rebels from the battle-field of Gettysburgh, Penn., commenced...Proclamation of President LINCOLN announcing a victory at Gettysburgh....Gen. MEADE issued a congratulatory address to his army on the victory at Gettysburgh....ALEXANDER H. STEPHENS, Vice-President of the Confederate States, applied for permission to visit Washington as bearer of a letter from JEFF. DAVIS to President LINCOLN. He was refused.", "1863-11-26": "Thanksgiving Day.....Advance of the Army of the Potomac. Crossing of the Rapidan ....Severe cavalry battle near the Rapidan, in which the rebels were driven back....Our forces left their camps near Missionary Rhine, and marched toward Chickamauga, which they reached at 10 A.M., finding that the rebels had left the place, after destroying a large quantity of stores, &c. HOOKER's column engaged in skirmishing.", "1864-06-01": "BATTLE OF COLD HARBOR, VA. -- Our corps at Cold Harbor attacked the rebels at 5 P.M., and carried the enemy's works on the right. The rebels attacked the corps not engaged in the assault, but were repulsed....BURNSIDE's advance a mile and a half from Mechanicsville, Va....Gen. MCPHERSON's corps of SHERMAN's army moved to the front of the rebels at New Hope Church. The rebels shelled our hospitals....Gen. BUTLER's left wing attacked. Spirited fight resulting in a rebel repulse....Steamer Pocahontas sunk at sea by collision, and 40 lives lost.....Gov. TOD having declined the appointment as Secretary of the Treasury, his nomination was withdrawn, and that of WM. PITT FESSENDEN substituted....An expedition left Hilton Head, S.C., in the direction of North Edisto River....The southern end of James Island, S.C., occupied by our forces.", "1862-12-25": "The Rebels, under Gens. FLOYD and MARSHALL, reported to have reentered Eastern Kentucky through Pound Gap... .Glasgow, Ky., captured by the rebel MORGAN.", "1864-03-19": "Attempt of a body of rebels to land near Port Royal Ferry, S.C.", "1864-04-02": "Fight between GRIERSON's and the rebel FORREST's cavalry, near Summerville, Tenn.", "1863-10-22": "Cavalry skirmish near Fayetteville, Va.", "1862-03-06": "PRESIDENT LINCOLN'S EMANCIPATION MESSAGE sent to Congress....Smithfield, Va., occupied by our troops....Battle of Pea Ridge, Ark., commenced.", "1861-03-04": "Inauguration of President LINCOLN.", "1864-10-31": "Nevada admitted as a State by proclamation of the President....The commissioners appointed by Gov. SEYMOUR to investigate the soldier voting frauds, had an interview with the President and Secretary of War....Capture of the rebel batteries, and their ordnance and ordnance stores, at Plymouth, N.C.", "1863-09-09": "Gen. CRITTENDEN took possession of Chattanooga, Tenn....Cumberland Gap taken by our army....Bombardment of Fort Moultrie continued ....Skirmish at Telford, East Tennessee.", "1863-01-24": "Gen. BURNSIDE relieved of the command of the Army of the Potomac, and the command assigned to Gen. HOOKER,", "1863-06-04": "Our force at Franklin, Tenn., attacked....Gen. BURNSIDE revoked his order suppressing the New-York World and Chicago Times, by order of the President....Departure cf an expedition into King William County, Va. from Yorktown, which was highly successful in its results....Brisk fight at Sataria, on the Yazoo.", "1864-11-30": "BATTLE OF FRANKLIN, TENN. -- The rebels attacked THOMAS' army at Franklin, but were repulsed at all points with heavy loss. The rebels commenced advancing on our lines at 4 P.M. They charged furiously on our lines, but were driven back and a great victory gained. Gen. A.J. SMITH's army passed through Nashville and reinforced THOMAS....Battle of Grahamsville, on the Charleston and Savannah Railroad....HOWARD's column of SHERMAN's army passed through Louisville, Ga....A cavalry expedition arrived at Tangipahoe, La....Hon. JOS. HOLT appointed Attorney-General.", "1861-07-01": "Arrest of the Baltimore Board of Police Commissioners.", "1864-02-27": "General movement of KILPATRICK's forces on the expedition toward Richmond. They left camp near Culpepper Court-house and encamped eight miles south of the Rapidan.", "1863-05-06": "Trial of VALLANDIGHAM at Cincinnati commenced....Return of the Army of the Potomac across the Rappahannock continued....Gen. HOOKER issued an address to his army in respect to the battles at Chancellorsville....Severe battle at Clinton, Miss....Steamer Eugenie captured off Mobile Bay, by a Union gunboat....Battle of Fourteen-Mile Creek, near Vicksburgh.", "1862-05-29": "Evacuation of Corinth, by the rebels completed in the night....Bridge 500 feet long across South Anna Creek, Va., burned by our cavalry, who also captured Ashland, Va.", "1862-01-01": "MASON AND SLIDELL LEFT FORT WARREN, having been transferred to a British gunboat.... Battle between Fort Pickens and the rebel batteries....The Union prisoners transferred from Charleston to Columbia, S.C.", "1862-11-17": "Artillery engagement near Fredericksburgh, Va....JEFF. DAVIS ordered retaliation for the execution of 10 rebels in Missouri..... The Alabama arrived at Martinique. The United States frigate San Jacinto arrived at the same place, but immediately went outside the harbor, to await the appearance of the Alabama.", "1863-01-27": "Gen. HOOKER visited Washington....THURLOW WEED took leave of the Albany Evening Journal....Cavalry skirmish at Middleburgh, Va.....Gen. BURNSIDE arrived in New-York....A.D. BOILEAU, proprietor of the Philadelphia Evening Journal, arrested by order of the Government....Bombardment of Fort McAllister, on the Ogeechee River, Ga., by the Montauk....Brig Chastelaine burned by the Alabama.", "1862-07-30": "A part of Com. PORTER's mortar fleet arrived in Hampton Roads.", "1864-09-04": "Gen. GILLEM SURPRISED JNO. MORGAN's BAND, AND KILLED MORGAN AT GREENVILLE, TENN....The rebels near Murfreesboro retreated.", "1861-08-09": "A steamer runs the blockade of Charleston -- Great complaints of the inefficiency of the blockade at that port.", "1861-10-26": "Brilliant success of National troops under Gen. KELLEY at Romney.", "1862-04-21": "Ship R.C. Files captured at Mobile.", "1863-05-12": "Union victory at Raymond, Miss.", "1863-04-21": "Visit of Gen. HALLECK to Suffolk, Va.", "1862-10-12": "STUART's rebel cavalry occupied Leesburgh, Va., returning from their raid into Pennsylvania. Gen. PLEASANTON passed through Frederick City, Md., in pursuit. The rebels passed a few miles from Frederick, and effected their escape by crossing the Potomac at White's Ferry. Here the chase ended, our troops having met the rebels near the mouth of the Monocacy. The rebels were clothed in captured National uniforms, which misled our soldiers, who were received, when in close proximity, by a fire of carbines and pistols. Gen. PLEASANTON's cavalry marched 90 miles in 24 hours.", "1864-06-15": "GEN. SMITH ASSAULTED AND CARRIED THE PRINCIPAL LINE OF THE ENEMY BEFORE PETERSBURGH....Gen. FOSTER reported that five general officers of the United States had been placed under fire at Charleston, S.C., by the rebels, asking an equal number of rebel officers to place under fire in retaliation....Gen. SHERMAN's army engaged all day in skirmishing.", "1864-11-06": "Attack on our pickets before Richmond....Gen. CANBY wounded in Louisiana.", "1861-07-17": "The pirate Sumter is supplied with coal at Curacoa.", "1864-04-07": "Brisk fighting in Louisiana.", "1861-06-13": "Evacuation of Harper's Ferry by the rebels.", "1863-06-29": "Wrightsville, Penn., evacuated by the rebels....Fight at McConnellsburgh, Penn....Gen. MEADE's army put in motion and at night was put in position, its left at Emmettsburgh and its right at New-Windsor.", "1864-07-18": "Gen. J.B. HOOD assumed command of the rebel army at Atlanta, Ga....Decatur, Ga., occupied by our forces....President LINCOLN issued an order for a draft of 500,000 men to take place immediately after Sept. 5, the term of service to be one year, volunteers to be credited till Sept. 5....HORACE GREELEY reached Niagara Falls to hold a conference with some self-constituted Confederate Commissioners in Canada. The President sent his famous \"To whom it may concern\" dispatch....Fights at Snicker's Gap....Attack by Indians on a train near Fort Larned.", "1862-04-24": "Destruction of the Dismal Swamp Canal, North Carolina, completed....Our fleet passed Forts Jackson and St. Philip below New-Orleans....United States Steamer Varuna sunk, after a most gallant action.....Great destruction of property in New-Orleans, in anticipation of the approach of our forces....Rebels near Corinth attacked and driven back.", "1862-01-15": "Rebel schooner burned by the men on vessels blockading the Rappahannock.", "1863-07-10": "Gen. GILLMORE commenced operations against the rebel batteries on Morris Island, Charleston harbor....Gen. STRONG took possession of several of the rebel works....Martial law declared in Louisville, Ky....Engagement at Jackson, Miss....Engagement at Sharpsburgh, Md....Skirmish near Funkstown.", "1862-01-12": "Sloop-of-war Pensacola ran past the rebel batteries on the Potomac... Gen. BURNSIDE's advance sailed from Fort Monroe....A nephew of Gen. POLK (rebel) captured, bearing dispatches.", "1863-08-26": "An expedition left Williamsburgh, Va., for Bottom's Bridge, Va....Attack on the rebel riflepits near Fort Wagner.", "1863-04-06": "Report of the Committee on the Conduct of the War made public....Gen. MITCHELL dashed into a rebel camp at Green Hill, Tenn....Visit of the President and his family to the Army of the Potomac....The expedition against Charleston, S.C. started for that city.", "1864-11-16": "Gen. SHERMAN's right wing passed through Jonesboro, Ga....The rebel cavalry, under WHEELER, engaged our cavalry at Bear Creek Station....Jackson, Ga., reached by SHERMAN's right wing.", "1861-12-04": "Occupation of Ship Island by National troops.", "1863-07-13": "COMMENCEMENT OF THE GREAT DRAFT RIOT IN NEW-YORK CITY....The drafting office in Third-avenue destroyed; a negro hung, and public and private property destroyed....Gen. LEE's army escaped across the Potomac River in the night....Gen. MEADE reconnoitered the rebel position, and made preparations for an attack ..Engagement at Jackson, Tenn....Capture of Yazoo City by our troops.", "1863-03-25": "Capture of Union troops at Brentwood, Tenn....Union rams Lancaster and Switzerland attempted to run past the batteries at Vicksburgh, the former being sunk and the latter captured....JEFF. DAVIS signed a bill for the impressment of property.", "1862-04-09": "Great rejoicing throughout the loyal State over the Union victories. Congratulatory orders issued by Secretaries STANTON and WELLES.... Gen. HALLECK left St. Louis to assume command of his department in the field.", "1863-12-22": "Death of Gen. MICHAEL CORCORAN.", "1864-06-11": "Cynthiana, Ky., captured by the rebel Gen. JOHN MORGAN, after a pretty severe fight. Gen. BURBRIDGE attacked and totally defeated the rebels....THE MOVEMENT OF GRANT's ARMY TO THE SOUTH SIDE OF RICHMOND COMMENCED....Gen. SMITH's corps marched to White House and embarked for Bermuda Hundreds. The other corps crossed the Chickahominy....Gen. SHERIDAN's forces had an obstinate engagement at Trevilian Station near Richmond -- they drove the rebels from successive lines of earthworks....Gen. HUNTER's army reached Lexington, Va.", "1862-09-21": "The armies of Gen. BUELL and Gen. BRAGG left Lebanon, Tenn., and Carthage respectively on their way toward Louisville. Our army traveled 361 miles; BRAGG's army 206. BUELL's army reached Northern Kentucky one day ahead of BRAGG's....Arrival of the advance boats of of the expedition to Galveston off the bar of that city....The rebels driven out of Munfordsville, Ky....Raid of STEWART's Cavalry in the direction of Williamsport....Reconnoissance beyond Chantilly, Va.", "1863-03-04": "Congress adjourned....Skirmish near Franklin, Tenn....Skirmish at \"Skeet,\" N.C.", "1864-02-04": "Col. MULLIGAN drove the rebels from Morefield, West Va., after six hours' hard fighting....The expedition to White Oak River came on a body of rebel cavalry about five miles from Young's Cross Roads, capturing the entire party....Skirmishing of Gen. SHERMAN's forces near Champion Hill.", "1862-09-22": "PRESIDENT LINCOLN'S EMANCIPATION PROCLAMATION issued, declaring the slaves in any State in rebellion on Jan. 1, 1863, thenceforward and forever free....Battle of Wood Lake, Minnesota, with the Indians.", "1863-04-15": "A rebel battery near Suffolk, Va., silenced....Gen. FOSTER arrived at Newbern, N.C., from Washington, N.C., where his army was besieged.", "1863-08-13": "An expedition left Lagrange, Tenn., for Central Mississippi.", "1862-08-16": "UNION TROOPS EVACUATED HARRISON's LANDING, Va. The rebels made a feint of an attempt to cross the Rapidan but were driven back ....Fight in Charlton County, Mo....Gen. MCCLELLAN's advance arrived at Williamsburgh.", "1863-09-04": "Bread riot in Mobile, Ala....An expedition left New-Orleans, La., for Texas, under Gen. FRANKLIN.", "1862-02-13": "Springfield, Mo., occupied by the Union troops under Gen. CURTIS -- the rebel Gen. PRICE hastily evacuated the place in the morning.... Expedition for the destruction of the Chesapeake and Albemarle Canal, N.C., accomplished the work.", "1864-02-05": "A formidable expedition left Port Royal, S.C., under command of Gen. SEYMOUR, for Jacksonville, Fla....Gen. SHERMAN entered Jackson, Miss., the rebels offering but little resistance....Engagement between Gen. SHERMAN's forces and the rebels at Bear Creek, near Clinton, Miss.", "1862-09-02": "Gen. MCCLELLAN assigned to the command of the fortifications of Washington and of the troops for the defence of the Capital....Business entirely suspended at Cincinnati and martial law proclaimed....Considerable fighting between Fairfax Court-house and Washington; the rebels being held in check by Gens. HOOKER and FITZJOHN PORTER....Engagement at Plymouth, N.C., in which the rebels were thoroughly routed.", "1862-05-20": "Gen. MCCLELLAN's advance reached New Bridge, 8 miles from Richmond....Advance of all his army.", "1862-09-08": "Gen. MCCLELLAN passed through Rockville. His main army followed him, his advance having preceded him some days.....Fight at Poolesville, Md.....Gen. LEE issued his celebrated proclamation to the people of Maryland.....Gen. ROUSSEAU crossed the Cumberland River, moving North..... Restrictions on travel rescinded, and arrests for disloyalty, &c., forbidden, except by direction of the Judge-Advocate at Washington.", "1863-06-27": "The advance of Gen. ROSECRANS' army arrived at Manchester, Tenn....Kingston, Penn., occupied by the rebels....York, Penn., also occupied....Chambersburgh, Penn., occupied by the divisions of the rebel army under Gens. LONGSTREET and HILL....The whole rebel army consisting of 90,000 infantry, upward of 10,000 cavalry and 4,000 or 5,000 artillery.", "1864-03-24": "Surrender of the Union garrison at Union City, East Tennessee, after repulsing the rebels, 2,000 strong, three times.", "1861-09-14": "Destruction of the privateer Judah by the United States frigate Colorado off Pensacola harbor.", "1863-06-25": "Fairfax Court-house, Va., occupied by the rebels....Skirmish at Marysrille, Penn., near Harrisburgh....Another engagement at Liberty Gap, Tenn....An expedition left West Point, Va., for the interior....Destruction of one of the rebel forts at Vicksburgh by the explosion of one of our mines....Ship Constitution captured by the privateer Georgia....The Union army crossed the Potomac at Edwards' Ferry....Gen. ROSECRANS resumed his march.", "1864-11-18": "SHERMAN's cavalry drove WHEELER out of Barnesville, Ga... Gov. BROWN and the Georgia Legislature fled from Milledgeville, Ga....Gen. BUTLER rejoined the Army of the James....Exchange of prisoners at Savannah; commencement of the reception of our men.", "1864-08-03": "Return to Norfolk, Va., of a cavalry expedition sent into North Carolina, July 28, after having visited five counties and captured considerable property....Gov. SEYMOUR addressed Secretary STANTON, complaining of an excessive quota for New-York City.", "1862-01-26": "Anniversary of the secession of Louisiana. The day celebrated in New-Orleans....Reconnoissance toward Munfordsville, Ky.", "1864-03-03": "Gen. KILPATRICK arrived within the lines of BUTLER's army.", "1864-08-11": "The Tallahassee [???] the schooner S.A. Boyce, burnt the pilot-boat Funk, brig Carrie Estelle, bark Bay State, [???] A [???], and bonded the schooner Carrol for $10,000, burnt the pilot-boat Wm. Bell and the schooner [???]....Secretary STANTON replied to Gov. SEYMOUR alleging that his claim of an excessive enrollment in New-York was not well founded.", "1864-11-29": "Sharp fight at Spring Hill, 12 miles south of Franklin, Tenn. -- Our cavalry were driven back on the infantry, who checked the progress of the rebels....Gen. FOSTER's expedition, cooperating with SHERMAN, landed at Broad River.", "1862-09-13": "Gen. MCCLELLAN reached Frederick.... Further reinforcements sent to Col. FORD. The enemy made an attack on the crest of the hill (Maryland Heights.) Our troops retired to the breastworks. The One Hundred and Twenty-sixth Regiment N.Y.V. fled in confusion at the second attack. Col. MILES ordered Col. FORD to spike his guns and throw the heavy ones down the mountain in case he should be compelled to evacuate Maryland Heights. Gen. MCCLELLAN established his headquarters at Frederick City in the morning. Col. MILES sent to him informing him that he could not hold Harper's Ferry more than forty-eight hours unless reinforced. ....The pirate Alabama captured and burned the whaler Benj. Tucker....Cavalry charge on the rebels near Middletown, Md. The rebel wagon train was so pushed that a large number were burned, to prevent their falling into our hands The rebel army threatening Cincinnati fell back beyond Florence.", "1863-03-23": "Our pickets at Chantilly attacked....A portion of Pensacola, Fla., destroyed by Union troops.", "1864-02-24": "Engagement at Tunnel Hill, Ga....Passage by the Senate of a bill authorizing the appointment of a Lieutenant-General.", "1861-03-18": "Important Diplomatic appointments by President LINCOLN.", "1862-04-03": "Bill for the abolition of Slavery in the District of Columbia passed the Senate....Apalachicola, Fla., surrendered to our seamen.", "1863-01-29": "Excitement in Philadelphia over the arrest of the editor of the Evening Journal....Charge of Judge LUDLOW to the Grand Jury on the subject....English steamer Princess Royal captured off Charleston, S.C.", "1862-09-25": "A portion of Commodore WILKES' fleet arrived at St. George, Bermuda, and was notified to leave in twenty-four hours, which notice he disregarded, not leaving the port until Oct. 2....Reconnoissance to Warrenton Junction.", "1862-02-04": "Brisk skirmish on the Potomac, near the Occoquan....Discussion in the rebel Virginia House of Delegates on the subject of enrolling free negroes.", "1864-09-23": "MONTGOMERY BLAIR resigned his office of Postmaster-General....A part of the rebel Gen. FORREST's force, about four hundred strong, crossed the Tennessee River at Bates' Landing....Our garrison at Athens, Ala., compelled to surrender.", "1863-02-11": "Secretary SEWARD transmitted to the Senate a communication relative to the visit of the French Minister to Richmond.", "1862-05-15": "Dash of mounted guerrillas on our railroad guard beyond Front Royal, Va.", "1861-02-04": "Assembling of the Peace Convention at Washington -- Organization of the Southern Convention at Montgomery.", "1862-03-09": "The Battle between the Merrimac and our Vessels continued. The Monitor, having arrived on the evening of the 8th, entered into the contest and fought the Merrimac, the two vessels touching each other part of the time. The Merrimac retired, the Monitor being undamaged. Lieut.-Commanding WORDEN, of the Monitor was injured.....Cockpit Point, Va., occupied by our troops.... The rebel steamer Geo. Page burned by the rebels....Point Pleasant, Mo., taken by a brigade of Union troops.", "1861-02-18": "Inauguration of the President of the Confederate States at Montgomery -- Defeat of secession in Missouri.", "1863-11-14": "Gen. LONGSTREET crossed the Tennessee River in his march against Knoxville, Tenn.", "1862-04-10": "Bombardment of Fort Pulaski commenced.", "1862-10-13": "Gen. BRAGG's army evacuated Camp Dick Robinson, Ky.", "1864-10-02": "The rebels attacked at Saltville, Va., and were d[???] their works. Our ammunition giving out, our troop [???] withdrawn in the night.", "1862-05-09": "Gen. MCCLELLAN effected a junction with FRANKLIN's Corps at West Point....Monitor fired on the batteries at Sewell's Point.... Battle at Farmington, near Corinth, Miss. The rebels attacked our position, and though our forces were at first compelled to fall back, the fight resulted in a victory for our arms....Gen. HUNTER issued his order declaring free the slaves in Georgia, Florida and South Carolina....Evacuation of Pensacola by the rebels completed.... Engagement at Slater's Mills, Va....Gunboat fight at Fort Darling, on the James River.", "1862-01-16": "Reconnoissance from Lexington, Mo.", "1864-09-27": "Skirmish with FORREST's troops in Tennessee....The rebels attacked our forces at Mineral Point, Mo.", "1863-04-07": "ATTACK ON FORT SUMTER, CHARLESON HARBOR, BY OUR MONITORS, AND OUR FORCES REPULSED....An additional force left Newbern, N.C., to aid Gen. FOSTER at Washington, N.C.", "1861-06-01": "At this date twelve ships, two barks, one brig and five schooners had been captured by the blockading squadron.", "1863-01-14": "Col. JAMES W. WALL elected United States Senator from New-Jersey....Engagement at the Bayou Teche, La.....Lieut.-Commander (Union) THOS. MCKEON BUCHANAN killed.", "1862-06-30": "BATTLE OF CHARLES CITY CROSS ROADS, or White Oak Swamp, near Richmond. The rebels still held at bay....Loss very heavy on both sides.", "1862-03-17": "Gunboat Cimerone launched.", "1862-06-07": "Battle at Union Church near Harrisonburgh, Va. The rebels routed....Rebel batteries at Chattanooga silenced....WM. B. MUMFORD executed for tearing down the American flag from the mint at New-Orleans.", "1863-05-30": "Attack on a train of cars near Catlett's Station, Va., by MOSEBY's rebel cavalry....MOSEBY's force defeated near Greenwich, Va....Train of cars destroyed near Kettle Run, Va.", "1862-11-27": "Skirmish near Nashville, Tenn....Railroad from Aquia Creek to Falmouth, Va., completed....Reconnoissance in force by General STAHL's troops.", "1862-06-21": "Death of Col. ELLET, of the Mississippi ram fleet.", "1861-04-20": "Immense Union demonstration in New-York -- Burning of the Gosport Navy-yard, including three ships of the line, three frigates, two sloops and a brig, mounting over 400 guns.", "1862-11-01": "Artillery fight between Gen. PLEASONTON's force and the rebels at Phillimont, Va., lasting five hours....Grand ovation to Gen. FREMONT in St. Louis....Rebel steamboat A.B. Ligur captured near New-Orleans.", "1864-11-15": "The last of SHERMAN's forces left Atlanta.", "1862-06-15": "Gen. WOOL visited Harper's Ferry.", "1862-05-11": "THE REBELS SET FIRE TO THE MERRIMAC. She blew up at 5 A.M....Monitor and other gunboats proceeded toward Norfolk.", "1863-06-02": "Gen. BURNSIDE suppressed the circulation of the New-York World and Chicago Times in his department.", "1863-11-19": "The Gettysburgh battle-field consecrated as a National Cemetery for the Union soldiers who fell in the July battles at that place. Addresses by President LINCOLN and EDWARD EVERETT....Attack on a rebel camp at New Iberia, La.", "1863-06-24": "Shippensburgh, Penn., reached by a portion of the rebel army....Severe skirmish of Gen. ROSECRANS' army at Hoover's Gap, Tenn., successful to our arms in its results....The rebels driven from Liberty Gap, near Murfreesboro....Heavy skirmishing near Murfreesboro, Tenn.....The main body of LEE's army entered Maryland, crossing the Potomac at Shepperdstown and Williamsport, instead of east of the Blue Ridge, as had been the intention.", "1862-06-16": "Battle of James Island, S.C.; our forces repulsed.", "1861-05-25": "Blockade of the Mississippi established.", "1861-11-20": "Disbanding of rebel troops in Accomac and Northampton Counties, Va. -- Return of the population to their allegiance.", "1864-10-06": "Gen. SHERMAN commenced moving back from Port R[???] Mount Crawford and Harrisonburgh, Va., [???] to which the whole country from the B[???] Ridge to the North Mountain was made un[???]enable for the rebel army by destroying an immense quantity of stores, grain, & c....Clinton, La., taken by our troops.", "1863-07-23": "Sharp fight near Front Royal, Va.", "1863-08-08": "Gov. SEYMOUR replied to President LINCOLN's letter relative to the draft.", "1862-10-14": "Our whole force moved in pursuit of BRAGG's army early in the morning. During the day some skirmishing took place....The first donation of $100,000 by San Francisco, received by the Sanitary Commission.", "1864-05-19": "Gen. EWELL attempted to turn GRANT's right, but was repulsed....Gen. SHERMAN advanced on the enemy, who retreated -- Kingston, Ga., reached -- Gen. SHERMAN pushed a column as far as Casville, Ga.", "1864-05-08": "Gen. HANCOCK's corps passed through Spottsylvania Court-house at daylight, and at noon our headquarters were twenty miles south of the battlefield of the 6th....BATTLE OF SPOTTSYLVANIA COURT-HOUSE, VA., COMMENCED. The armies near Spottsylvania Court-House, engaged from 8 to 12 M., at which time our forces gained the point for which they contended. At 6 P.M., two fresh divisions were thrown in, and after a severe engagement of an hour and a-half, the rebel position was carried and their first line of breastworks occupied...General engagement at Mill Creek Gap, Ga...Our troops held possession of Fredericksburgh, Va.", "1862-08-20": "The Sioux Indians attacked Fort Ridgely, Minn., and were repulsed....The rebels drove in our pickets between Culpepper Court-house and the Rappahannock.", "1864-07-30": "EXPLOSION OF AN IMMENSE MINE BY OUR TROOPS IN FRONT OF BURNSIDE's POSITION BEFORE PETERSBURGH. Its explosion was the signal for the discharge of every piece of artillery on our line from the Appomatox to the extreme left. After the discharge of the artillery our army advanced and assaulted the rebel works, but after a desperate attempt to carry them was repulsed....THE REBELS ENTERED CHAMBERSBURGH, PENN., where the rebel Commander demanded $500,000 under threat of burning the city. His demand not being complied with, the city was burned.....Our cavalry cut off, 40 miles from Atlanta ...Gen. SHERMAN's celebrated letter on the recruiting of negroes in rebel States.", "1863-10-21": "Battle near Tuscumbia, Ala... Fight near Philadelphia, Tenn....Cavalry skirmish near Sulphur Springs, Va.", "1862-03-12": "JACKSONVILLE, Fla., occupied by our troops ....Winchester, Va., reached by BANKS' forces ... Forts in New York harbor garrisoned.... Schooner Fair Play captured off South Carolina.", "1861-07-11": "Defeat of PEGRAM by MCCLELLAN at Rich Mountain, Va. -- Surrender of the entire rebel force.", "1861-07-04": "Meeting of Congress.", "1862-08-26": "The rebel cavalry reached Manassas, having marched sixty-two miles in less than two days. From Manassas they advanced nearly to within cannon-shot of Washington.", "1861-11-07": "Engagement at Belmont, Mo. -- Bombardment and capture of the forts at Port Royal Entrance by United States squadron.", "1863-08-14": "Death of Commodore MORRIS.", "1864-11-05": "A midnight attack by the rebels on our works southeast of Petersburgh, Va. A brisk fight and temporary success on the part of the rebels....Gen. BUTLER assumed command of the troops arrived and to arrive in New-York City to protect the city during election.", "1862-03-13": "JOS. HOLT and ROBT. DALE OWEN appointed to audit claims against the United States.", "1862-10-08": "BATTLE OF PERRYVILLE, KY. -- The battle was severe, commencing at 12 1/2 P.M. and continuing furiously until dark. The rebel army was under command of Gen. BRAGG, the different divisions being commanded by Gens. POLK, CHEATHAM, BUCKNER and ANDERSON. The battle was commenced by the rebels furiously assaulting our army. Gen. BRAGG styled it in his report the severest and most desperately contested engagement within his knowledge. He acknowledged a loss in killed, wounded and missing, of 2,500. Among his wounded were Brig.-Gens. WOOD, CLEBURN and BROWN. Gen. HARDEE was engaged in the battle, commanding the rebel left wing. The rebels were everywhere repulsed, but not without some momentary advantages on the left. The Union Gens. JACKSON and TERRELL were killed. Gen. ROUSSEAU was in the thickest of the fight and covered himself with glory. The battle did not accomplish what was hoped, as the enemy had escaped by the morning after the fight.", "1862-02-24": "Harper's Ferry occupied by Gen. BANKS' troops.", "1861-10-31": "Retirement of Gen. SCOTT.", "1863-07-18": "STORMING OF FORT WAGNER, CHARLESTON HARBOR.....Arrival of Gen. FOSTER at Fort Monroe.....Gen. LEE's rear-guard left Martinsburgh. Va.....MORGAN's force dispersed and a large number of his men captured.....Fight with MORGAN's men at Buffington, Ohio.....Admiral PORTER reported the complete success of the Red River expedition.....Bombardment of Fort Wagner, Charleston Harbor; the fort stormed and our troops repulsed.", "1862-04-29": "Gen. MITCHEL routed the rebels at Bridgeport, Ala....Successful skirmish near Corinth. ....Rebel battery near Port Royal captured.", "1864-06-20": "THE REBELS MADE SEVEN DISTINCT ASSAULTS ON SHERMAN's LINES in a desperate attempt to take the position at Kenesaw Mountain, which they had lost the day before....A rebel force attacked our troops at White House, Va., but were repulsed....Gen. SHERIDAN's advance arrived at White House, Va.", "1864-09-26": "Gen. SHERIDAN's headquarters at Harrisonburgh, Va....Our cavalry entered Stanton, Va., and destroyed a large quantity of rebel government property. They then proceeded to Waynesboro', destroying an iron bridge over the Shenandoah and a large amount of property. Gen. EARLY's rebel army routed and demoralized, fled through Brown's Gap toward Gordonsville.", "1861-08-24": "The transmission of secession journals through the mails prohibited.", "1864-11-11": "Reconnoissance by the rebels in the Shenandoah Valley....Commencement of the burning of Atlanta, Ga.", "1864-11-14": "Gen. SHERMAN's left wing left Atlanta....Union reverse at Bull's Gap....A division of PRICE's rebel army assaulted the works at Fayetteville, Ark., but were repulsed.", "1864-10-07": "Gen. KAUTZ' cavalry attacked by the rebels who suffered considerably. They afterward attacked BIRNEY's division, who also repulsed them with very heavy loss. In the afternoon, Gen. BUTLER took the offensive and recaptured some intrenchments which had been taken from KAUTZ....The rebels appeared before Jefferson City, Mo....The advance of the rebels from the Osage River, Mo., spiritedly contested by our cavalry....Gen. SHERIDAN's forces reached Woodstock, Va....CAPTURE OF THE PIRATE FLORIDA BY THE STEAMER WACHUSETT, in the Bay of St. Salvador, Brazil -- A band of 200 rebels captured a steamboat and crossed into Kentucky.", "1861-08-12": "Arrest of Hon. C.J. FAULKNER, late United States Minister to France.", "1864-01-21": "Extensive conflagration of hospital buildings at Camp Winder, near Richmond.", "1862-03-03": "COLUMBUS, KY., OCCUPIED BY OUR FORCES, the city having been deserted by the rebels.... Martinsburgh, Va., occupied by Gen. BANKS' forces....Gen. POPE's forces engaged with the enemy near New-Madrid, Mo....Fernandina, Fla., surrendered to Com. DUPONT and Gen. WRIGHT, (Union.)", "1862-05-31": "BATTLE OF FAIR OAKS, before Richmond, commenced. The result of the day's fighting was unfavorable.", "1864-01-14": "Our pickets at Three Mile Station, Va., attacked by rebel cavalry....Return to Point Lookout of a force of Union troops from a raid in Virginia....The rebels under Gen. VANCE made a raid toward Tenisville, Tenn., and captured a train of 23 wagons. He was promptly pursued by Col. PALMER, who recaptured the wagons and took an ambulance loaded with medicines, 150 saddle-horses, and 100 stand of arms. Gen. VANCE, together with his Adjutant-General and Inspector-General, was captured....The rebel steamer Mayflower captured in Sarasote Pass, Fla.", "1862-09-01": "Gens. KEARNY and I.S. STEVENS killed in a severe engagement near Chantilly, two miles from Fairfax Court-house, Va....Fredericksburgh evacuated by Gen. BURNSIDE's army.... Lexington, Ky., evacuated by our troops, who fell back on Covington. Great excitement in Louisville in anticipation of an attack....Battle of Button's Lane, Tenn. The rebels, estimated to be 5,000 strong, were opposed to a Union force of only 800, under Col. DENNIS. After a fight of four hours, the rebels left Col. DENNIS in possession of the field.", "1863-06-21": "Great cavalry engagement near Middleburgh and Upperville, Va....The rebels driven from Frederick, Md.", "1864-09-16": "A large body of rebel cavalry made a raid on our reserve cattle herd, opposite Harrison's Landing, and succeeded in carrying off the entire herd....Departure of an expedition under Gen. ASBOTH on a raid into Western Virginia.", "1862-08-11": "The enemy sent a flag of truce to Culpepper Court-house, asking permission to bury their dead of the battle of Cedar Mountain....The day spent in burying the dead....Independence, Mo., captured by the rebels....Guerrilla fight near Williamsport, Tenn.", "1864-12-01": "The armies near Nashville engaged in heavy skirmishing....Reconnoissance by Gen. GREGG from the Army of the Potomac. He captured Stony Creek Station and destroyed a considerable amount of stores....Rebel pickets attacked our lines at Bermuda Hundreds....Death of Hon. WM.L. DAYTON, United States Minister to France.", "1863-09-15": "Proclamation of the President, suspending the writ of habeas corpus in certain cases....Order of Gen. GILLMORE congratulating his troops on their success in Charleston Harbor.", "1862-09-17": "BATTLE OF ANTIETAM. The fight of the previous day was renewed in the morning, and raged with the greatest fury. The battles of the 16th and 17th were the most furious and obstinate of the war, and the carnage on both sides was terrible. The rebels were defeated and our army left in possession of the field. Gen. MANSFIELD was killed and Gens. HOOKER and RICHARDSON (the latter mortally) wounded. Surgeon-Gen. HAMMOND telegraphed North for volunteer surgeons for the battle-field of Antietam. Our loss in the battle of Antietam was 12,469; estimated rebel loss in the battles of South Mountain and Antietam 25,542....Reconnoissance toward Leesburgh, Va. The rebel force driven back at the point of the bayonet....Cumberland Gap, Ky., evacuated by the Union forces under Gen. GEO. W. MORGAN, though almost completely surrounded by the enemy, he succeeded in saving his command, which reached Greenupsburgh, Oct. 3. At the time of the evacuation, the rebel Gen. STEVENSON was three miles in his rear; Gen. BRAGG on his left; MARSHALL on his right, and KIRBY SMITH in his front. Before leaving, MORGAN exploded the mines and magazines, and burned the store-houses at the Gap....A strong column of Gen. BRAGG's force reinforced the rebels before Munfordsville, and the combined forces completely surrounded our troops. The latter, to the number of 4,600, were compelled to surrender at 6 A.M....Gen. MITCHEL took command of the Department of the South.", "1860-12-24": "Withdrawal of the South Carolina delegation from Congress.", "1863-06-17": "Great excitement over the invasion of Pennsylvania....Spirited cavalry engagement at Aldie, Va.....Draft in Ohio resisted....Capture of the rebel steamer Atlanta, late the Fingal, near Savannah, Ga.", "1861-02-19": "The President elect in New-York.", "1864-08-29": "Meeting of the Democratic Nominating Convention at Chicago.", "1864-03-15": "Official order issued, promulgating the President's call for 200,000 more troops and ordering a draft for any deficiency, on the 15th of April....Gov. SEYMOUR signed the Police Bill and the Commissioners were sworn in.", "1863-04-13": "Riot between black and white laborers in South street, N.Y....The rebels evacuated their works at Centreville, La., in the night....The fighting in the Teche country, Louisiana, continued.", "1861-05-11": "Pensacola blockaded. The Pawnee. Monticello, Harriet Lane and Yankee are off Fortress Monroe.", "1862-08-25": "Sharp skirmish at Waterloo Bridge, Va. ....\"Stonewall\" JACKSON left the rebel army with his force, and took the direction of Manassas, which he approached through Thoroughfare Gap....The rebels were repulsed in an attack on Fort Donelson.", "1862-06-20": "Commodore PORTER arrived off Vicksburgh with ten mortar-boats....Free Territory act signed by the President....Holly Springs occupied by our forces.", "1862-11-12": "Gen. HALLECK visited the Army of the Potomac....Gen. GRANT's advance reached Holly Springs.", "1863-09-22": "Gallant cavalry action near Madison Court-house, Va....Skirmish near Rockville, Md.", "1863-02-06": "Raid of Union cavalry to Middleburgh and Aldie, Va.", "1863-10-16": "Gen. GRANT ordered to the command of the Departments of the Ohio, the Cumberland, and the Tennessee....Rebel raid into Brownsville, Mo.", "1863-09-08": "Our forces at Bath, Va., attacked....Unsuccessful naval assault on Fort Sumter....Bombardment of Fort Moultrie. One of its magazines exploded....Unsuccessful attack on the rebel fortifications at Sabine Pass, Texas.", "1863-05-07": "President LINCOLN and Gen. HALLECK visited the Army of the Potomac at Falmouth, Va, ....Arrival of Col. KILPATRICK, with a force of cavalry, at Gloucester Point, Va....Death of Gen. WHIPPLE....Trial of C.L. VALLANDIGHAM concluded....West Point, Va., occupied by our forces....Bridges, &c., near White House, Va., destroyed by our troops....Gen. LEE issued a congratulatory address to his army....Steamer Cherokee captured off Charleston, S.C.", "1863-07-27": "The rebel pirate Alabama arrived off the coast of Africa near Cape of Good Hope.", "1864-07-15": "Engagement with the rebel FORREST in Tennessee.", "1862-06-27": "BATTLE OF GAINES' HILL, near Richmond. Stonewall JACKSON and EWELL attempted to turn our right flank and were repulsed. The entire right wing of our army crossed the Chickahominy in the night in perfect order....Shelling of Vicksburgh....Gen. FREMONT relieved of the command of the Mountain Department.", "1862-04-14": "Bombardment of Fort Pillow commenced. ....Gunboat expedition from the Potomac flotilla up the Rappahannock. The batteries at Lowry's Point shelled out.", "1863-08-19": "Draft in New-York City recommenced....Bombardment of Fort Sumter continued.", "1864-05-01": "Death of Commodore W.D. PORTER....A cavalry expedition returned to Vienna, Virginia, after having an encounter with MOSBY's guerrillas, and after destroying Madison Court-house, Virginia.....Gen. STEELE's army forty miles from Little Rock, Arkansas. His cavalry reached that city.", "1863-01-06": "Gen. CARTER's Union force reached Manchester, Ky., on its return from a raid into East Tennessee, where they destroyed bridges and took a number of prisoners.", "1861-09-10": "Defeat of FLOYD, near Gauley River.", "1862-04-18": "BOMBARDMENT OF FORTS JACKSON AND ST. PHILIP, BELOW NEW-ORLEANS, COMMENCED.... Gen. RENO's expedition landed above Elizabeth City... The rebels at Yorktown repulsed in a night attack on our troops....Falmouth, opposite Fredericksburgh, Va., occupied by our troops.", "1862-11-08": "Gen. PLEASANTON engaged in a skirmish near Little Washington, Va....Gen. BAYARD held the railroad bridge across the Rappahannock.... Cavalry charge on the rebels near Gaines' Cross Roads....Ship T.B. Wales captured by the Alabama.", "1864-05-09": "BATTLE OF SPOTTSYLVANIA COURT-HOUSE, VA., CONTINUED. -- LEE's army made a stand, but no general engagement occurred in the morning. Maj.-Gen. SEDGWICK killed. The fight in the evening was brought on by HANCOCK, who crossed the River Po, and established himself on the south bank. President LINCOLN issued a proclamation, announcing that enough was known respecting the success of GRANT's army to claim especial gratitude to God, and recommending that all patriots unite in thanksgiving and prayer. Gen. BUTLER reported that his army had landed at Bermuda Landing, and was in a strong position. HIS FORCES DEFEATED A PORTION OF BEAUREGARD's ARMY UNDER GEN. HILL. The fight commenced at noon and continued till night. The rebels driven back three miles....The railroad between Richmond and Petersburgh in our possession....Night attack on Gen. BUTLER's lines. The rebels repulsed....Gen. SHERIDAN marched around the rebel right flank, and reached the North Anna River in safety in the evening. In the night he destroyed a great quantity of rebel stores, & c.", "1862-07-25": "Steamer Cuba ran the blockade into Mobile....President issued a proclamation warning rebels of the provisions of the Confiscation act.", "1864-12-14": "Gen. DIX issued an order on the occasion of the release of the St. Albans robbers, directing military commanders on the frontier to shoot down rebel marauders, and, if necessary, to pursue them into Canada....Interview between Gens. FOSTER and SHERMAN....An expedition threatening Mobile reached Pascagoula.", "1862-09-20": "A reconnoissance in force across the Potomac, and though our forces were supported by artillery they were compelled to recross the Potomac after a stubborn resistance....The enemy crossed at Williamsport, but were driven back by the advance of our army and the town was afterwards occupied by us in strong force....Reconnoissance to Ashby's Gap....Gov. CURTIN withdrew the Pennsylvania militia....Commander GEO. H. PREBLE, U.S.N., dismissed from the service for allowing the steamer Oreto to escape him at Mobile.", "1862-05-01": "Huntsville, Ala., in possession of Gen. MITCHEL....Great rise in the Mississippi.... Rebel battery at White Point, North Edisto Island, captured....Schooner Magnolia captured.", "1861-01-21": "Withdrawal of the Alabama, Mississippi and Florida Delegations from Washington.", "1863-10-19": "Gen. ROSECRANS relinquishes the command of the Army of the Cumberland.", "1862-11-10": "Gen. ROSECRANS arrived at Nashville.... Gen. HALLECK ordered to their regiments all absent officers.....Gen. PLEASANTON's pickets attacked near Amosville, Va....Great Union demonstration in Memphis.", "1864-01-30": "A supply train captured by the rebels near Petersburgh, West Virginia. The garrison of Petersburgh, West Virginia, evacuated the place in the night....The engagement with the rebels endeavoring to retake Cumberland Gap, continued.....An expedition went up the James River to Smithfield to destroy provisions, & c., of the rebels.....Engagement at Smithfield, Va....Final repulse of the rebels endeavoring to retake Cumberland Gap.", "1862-05-10": "SURRENDER OF NORFOLK....Gosport Navy-yard burned by the rebels....Victory on the Mississippi, near Fort Pillow, in a gunboat engagement between eight rebel iron-clads and six Union boats. Two of the rebel gunboats blown up and one sunk....Craney Island abandoned by the rebels....Gen. BUTLER seized $800,000 in the office of the Consul of the Netherlands, New-Orleans.", "1861-12-22": "Skirmish near Fortress Munroe.", "1862-07-23": "Gen. POPE ordered the arrest of all disloyal male citizens in the lines of his army....A cavalry expedition from Fredericksburgh met and defeated two bodies of rebel cavalry.", "1862-03-22": "Reconnoissance in force to Cumberland Gap.", "1862-05-23": "TERRIFIC, FIGHTING BETWEEN GEN. BANKS' ADVANCE UNDER COL. KENLEY AND THE REBELS AT FRONT ROYAL, VA....A portion of Gen. MCCLELLAN's army crossed the Chickahominy..... MCCLELLAN's army engaged in three skirmishes the rebels driven from Mechanicsville....The rebels defeated at Lewisburgh, Va., in the Mountain Department.", "1862-11-25": "Rebel raid into Poolesville, Md....Attack of the rebels on Newbern, N.C.", "1862-12-12": "Crossing of our army at Fredericksburgh continued. Artillery duel between the two forces....Skirmish near Suffolk, Va....Destruction of the gunboat Cuiro on the Yazoo River by a rebel torpedo.", "1861-06-17": "Successful engagement with the rebels at Booneville, Mo.", "1862-07-10": "BURNSIDE's force encamped at Newport's News.", "1862-09-11": "Union troops occupied Newmarket, Md.... Hagerstown occupied by the rebel troops, who capture a large quantity of flour and commence to tear up the railroad track....Gen. PLEASANTON's Cavalry crossed the Monocacy near the Potomac, and found no enemy in force....Sugar-Loaf Mountain, Md., occupied by our forces.... Rebels made a cavalry raid into Westminster..... Gen. BUELL's army hastening to the support of Nashville. The city being fortified....Bloomfield, Mo., captured by the rebels....Skirmishing along the entire line of the West Licking River ....Maysville, Ky., taken by the rebel MORGAN ....Gen. MCCLELLAN telegraphed from Rockville, Md., to Gen. HALLECK to have Col. MILES (at Harper's Ferry) join him at once. Our forces stationed at Solomon's Gap, near Harper's Ferry, were driven in by the enemy. Col. FORD called on Col. MILES for reinforcements.", "1862-12-28": "Bridge on the Louisville and Nashville Railroad destroyed by MORGAN....New-Madrid evacuated....Unsuccessful attempt of the rebel Gen. STUART to capture the depot of stores at Fairfax Station, Va....Van Buren, Ark., captured and the rebels put to flight.", "1862-01-04": "Huntersville, Va., attacked by Union troops, and the rebel stores there captured or destroyed.", "1862-11-19": "Stuart's rebel cavalry near Warrenton Junction....Our pickets driven in at Suffolk, Va.", "1864-08-07": "BOMBARDMENT OF FORT GAINES CONTINUED. The rebels proposed to surrender....Gen. AVERILL overtook the rebels near Moorefield, in the Shenandoah Valley, and attacked them with great success, routing the rebels, capturing their artillery, a large number of prisoners, horses and arms.", "1861-04-18": "Arrival in New-York of the Sixth Massachusetts Regiment en route to Washington -- Fears begin to prevail for the safety of the capital.", "1863-09-01": "Fierce artillery fight at Port Royal, Va....KNOXVILLE, TENN., CAPTURED by Gen. FOSTER, of BURNSIDE's army....Fort Smith, Ark., occupied by our forces.", "1864-01-03": "Death of Archbishop HUGHES....Three hundred of our troops at Jonesville, Va., attacked by an overwhelming force of rebels. After a desperate resistance, our forces surrendered, losing thirty killed, thirty wounded, one gun, and two small howitzers.", "1863-02-19": "Brig Emily Fisher captured and bonded by the privateer Retribution.", "1864-02-16": "The Governor of Alabama issued a proclamation to the citizens of Mobile, informing them that the city was about to be attacked, and exhorting non-combatants to leave....Gen. SHERMAN's expedition reached Meridian.", "1862-09-12": "Gen. HOOKER's forces arrived in Frederick, Md. They were received with the greatest enthusiasm by the inhabitants of the city....Gen. WHITE returned to Harper's Ferry, where he remained till the surrender without taking command. Reinforcements sent to Col. FORD. Skirmishing commenced at Maryland Heights....Reconnoissances in force from Cincinnati found that the enemy had fallen back....Desperate fight on Elk River, Western Virginia.", "1863-04-01": "Sharp cavalry fight at Broad Run, Va., near Drainesville, Va.", "1862-09-15": "HARPER's FERRY SURRENDERED by Col. MILES. The cavalry from Harper's Ferry reached Greencastle, Penn., having captured an ammunition train belonging to the rebel Gen. LONGSTREET ....Gen. PLEASANTON, of MCCLELLAN's army, started after the enemy, and captured two of their guns. Gen. RICHARDSON's Division came up with the enemy in large force near Sharpsburgh. During the night the greater part of our army arrived on the ground....Business in Cincinnati resumed.", "1861-07-28": "The command under Gen. BANKS, at Harper's Ferry, is withdrawn to the Maryland side of the Potomac.", "1864-05-18": "HEAVY ENGAGEMENT BETWEEN THE ARMIES IN VIRGINIA. Gen. HANCOCK charged the enemy and carried the first line of rebel intrenchments....Gen. SHERMAN reached Adairsville, Ga., where he was engaged in skirmishes....Secretary STANTON announced that a draft would be ordered to take place July 1....A pretended proclamation of the President, calling for 400,000 men, and announcing the Spring campaign closed, published in the Journal of Commerce and the World -- The two papers suppressed....Gen. A.J. SMITH's army had a spirited engagement.", "1863-02-22": "Richmond, Ky., occupied by rebel cavalry.....Tuscumbia, Ala., reached by a Union cavalry force....Ship Golden Eagle destroyed by the Alabama.", "1862-11-18": "The Army of the Potomac reached Falmouth, opposite Fredericksburgh, Va....Skirmish at Rural Hill, Va.....Escape of the Alabama from Martinique.", "1863-11-11": "Formal presentation to Gen. MEADE of the battle-flags captured in the battle on the evening of the 7th....Lord LYONS officially informed the Government at Washington that he had received information from the Governor-General of Canada of a plot to invade the United States from Canada, destroy the City of Buffalo and liberate the rebel prisoners on Johnson's Island in Lake Erie....Gen. BUTLER assumed command of the Departments of Eastern Virginia and North Carolina, headquarters at Fortress Monroe-----Gen. FOSTER took leave of his command at Fort Monroe.", "1863-02-10": "Gen. ROSECRANS issued an order declaring that all rebel soldiers found in National uniforms should not be treated as prisoners of war, or receive quarter in battle....Official denial that the blockade at Charleston, S.C., had been raised.", "1863-11-23": "THE BATTLE OF CHATTANOOGA COMMENCED....Our forces advanced directly in front of the fortifications, drove in the enemy's pickets, and carried his first line of rifle-pits. Gen. HOOKER carried the northern slope of Lookout Mountain.", "1864-08-31": "GREAT BATTLE NEAR ATLANTA. -- During the forenoon, our artillery kept up a cannonade to provoke the rebels to an assault. In the afternoon the rebels assaulted our lines, but were repulsed with great loss. The rebel loss in the attack on RAMSOM's and LOGAN's lines estimated at 3,000. In the evening the Fourteenth Corps struck the railroad, five miles south of Jonesboro. The work of destruction commenced immediately....GEORGE B. MCCLELLAN and GEORGE H. PENDLETON nominated by the Chicago Convention for President and Vice President.", "1864-11-22": "BATTLE OF ROOD's HILL, Va., between SHERIDAN's and EARLY's forces. The rebels being found in superior force, our troops retired....The rebel armies under HOOD and BEAUREGARD, having been reinforced by 9,000 men, advanced and encamped 20 miles from Pulaski, Tenn....SHERMAN's rear guard at Griswoldville attacked. Gen. SLOCUM's column reached Milledgeville, Ga., where both wings united.", "1863-05-15": "Capture of a company of United States cavalry at Charlestown, Md...Destruction of rebel stores at York River, Va....Fight at Carrsville, Va....Jackson, Miss. -- evacuation of by Union troops commenced....British brigantine Cornet captured....Ship Byzantium burned by the Tacony.", "1863-07-03": "THE BATTLE OF GETTYSBURGH CONCLUDED. Heavy losses on both sides. A great victory gained by the Union army, and the rebels compelled to retreat....Rebel pontoon bridge over the Potomac near Williamsport, Md., destroyed....Departure of a cavalry expedition from Newbern, N.C., into the interior....Conference of Union and rebel commanders at Vicksburgh, Miss., relative to the surrender of the city to our forces.", "1863-10-20": "Gen. GEORGE H. THOMAS assumed command of the Army of the Cumberland....Gov. SEYMOUR issued a Proclamation in response to that of the President calling for troops.", "1862-06-26": "TERRIFIC FIGHTING BEFORE RICHMOND, the rebels having attacked our right wing when engaged in changing base from the Pamunkey to the James Rivers....The rebels destroyed their gunboats the Van Dorn, Polk and Livingston, on the Yazoo River....Gen. POPE assigned to the command of the Army of Virginia.", "1863-12-06": "The advance-guard of Gen. SHERMAN's force, sent to the relief of BURNSIDE, arrived at Knoxville....Steamer Chesapeake taken possession of, in the night, by sixteen rebel passengers, near Cape Cod....The monitor Weehawken foundered at her anchors inside Charleston (S.C.) harbor....Rebel attack on Union troops garrisoning Natchez, Miss.", "1861-05-06": "The Monticello is blockading the mouth of the Elizabeth River, and the Quaker City is off the Virginia capes.", "1863-07-30": "Proclamation of President LINCOLN in regard to rebel treatment of colored troops, issued....Cummings Point rebel battery, Charleston harbor bombarded....Rebels defeated at Winchester, Ky.", "1862-09-29": "Gen. BUELL ordered to turn over the command of his army to Maj. -- Gen. THOMAS.... Maj. -- Gen. NELSON killed by Brig. Gen. JEFF. C. DAVIS, at the Galt House, Louisville, for an assault offered by the former....Gen. STAHL's advance took Warrenton, Va....Death of Gen. I.P. RODMAN, wounded at Antietam....Retaliatory resolutions introduced in the rebel Congress, on account of the Emancipation Proclamation.", "1862-07-19": "Gen. BUTLER issued an order emancipating certain negroes.", "1863-04-04": "Gen. MCCLELLAN's report of his campaign, dated Oct. 15, 1862, made public....Town of Palmyra, on the Cumberland, destroyed by our forces, in retaliation for the attack on the gunboat St. Clair....The rebels repulsed at Woodbury, Tenn....The Yazoo Pass expedition operating against Vicksburgh, returning, left Fort Greenwood.", "1864-12-26": "Heavy cannonading on Broad River, between SHERMAN's and HARDEE's forces.", "1861-01-01": "First symptoms of life in the Buchanan Administration -- The frigate Brooklyn and another war-vessel ordered to Charleston.", "1863-08-07": "Reply of President LINCOLN to Gov. SEYMOUR's letter of remonstrance against the draft, in which he asserted that the draft should proceed.", "1861-04-27": "Twenty-one thousand National troops in Washington.", "1862-11-02": "The artillery fight at Phillimont renewed and the rebels fell back....Additional force of our troops took possession of Snicker's Gap, Va. ....Gen. FOSTER's expedition from Newbern took up its line of march.....Schooner Alice captured by the Alabama.", "1862-04-27": "AMERICAN FLAG RAISED OVER THE MINT IN NEW-ORLEANS....Severe skirmish near Newbern, N.C.....Gen. BUTLER landed his troops above Fort St. Philip.", "1863-12-29": "Return to Harper's Ferry of an expedition sent to cooperate with that of Gen. AVERILL.", "1863-02-08": "Our forces entered Lebanon, Tenn., capturing a number of rebels.", "1863-04-11": "Great meeting in New-York in commemoration of the attack on Fort Sumter in 1864....Skirmishing at Williamsburgh, Va.", "1864-05-20": "Gen. BUTLER's forces engaged....Gen. GRANT commenced a new flank movement....Gen. HUNTER placed in command of the Department of West Virginia....Arrest of HOWARD, the forger of the bogus proclamation.", "1863-10-26": "Skirmishing along the lines of the Army of the Potomac....Bombardment of Fort Sumter renewed....Gen. HOOKER moved from Bridgeport, Tenn.", "1862-11-13": "Skirmish near White Sulphur Springs, Va. ....Holly Springs occupied by the Union troops, after a slight skirmish.", "1862-11-04": "Ashby's Gap taken possession of by Union troops....Gen. MCCLELLAN's headquarters at Upperville, Va....Gen. GRANT, with several divisions of the army from Bolivar, Tenn., and Corinth, Miss., marched into Lagrange, Miss., the rebels, under Gen. EARL VAN DORN, being in large force at Holly Springs, Miss....Spirited engagement, at Markham, Va....Salt works at Kingsbury, Ga. destroyed, in effecting which our forces were attacked.", "1863-04-30": "Fast day in the United States....Chancellorsville, Va., occupied by Gen. HOOKER's army....Withdrawal of the rebel Gen. LONGSTREET's army from the south side of the James River commenced....Cavalry fight at Dayton's Gap, Ala....Gen. GRANT's army landed at Bruinsburg, Miss.", "1862-09-06": "The rebels in Maryland. A force under Gen. HILL occupied Frederick City. BRADLEY T. JOHNSON was made rebel Provost-Marshal....Battle at Washington, N.C. Our troops captured four guns and many prisoners.... The pirate Alabama captured and destroyed the whaler Ocmulgee.", "1862-06-13": "Our pickets driven in from Old Church before Richmond....The railroad behind MCCLELLAN's army, four miles from White House, cut by the rebel cavalry.", "1864-03-02": "Uniting of KILPATRICK's and BUTLER's forces....Provost-Marshal-General FRY ordered the draft to take place on the 10th inst. in all sub-districts which had not filled their quotas on the 1st inst.", "1864-05-21": "Gen. HANCOCK's forces entered Bowling Green, Va. Milford reached by our troops.", "1864-04-14": "The surrender of Paducah, Ky., again demanded by the rebels....Skirmish and defeat of the rebels in Kentucky."}